Repository: 1tchy/core
Catalog: reference/*/modules/ri-spi.po
Languages: it_it

source: Integrating the Web Beans RI into other environments
it_it: Integrazione di Web Beans RI in altri ambienti

source: Currently the Web Beans RI only runs in JBoss AS 5; integrating the RI into other EE environments (for example another application server like Glassfish), into a servlet container (like Tomcat), or with an Embedded EJB3.1 implementation is fairly easy. In this Appendix we will briefly discuss the steps needed.
it_it: Attualmente Web Bean RI funziona solo in JBoss AS 5; l'integrazione di RI in altri ambienti EE (per esempio in un application server come Glassfish), in un servlet container (come Tomcat), o con un'implementazione EJB3.1 Embedded è abbastanza facile. In questo appendice si discuterà brevemente dei passi necessari.

source: It should be possible to run Web Beans in an SE environment, but you'll to do more work, adding your own contexts and lifecycle. The Web Beans RI currently doesn't expose lifecycle extension points, so you would have to code directly against Web Beans RI classes.
it_it: Dovrebbe essere possibile far funzionare Web Beans in un ambiente SE, ma occorre molto lavoro per aggiungere i propri contesti ed il ciclo di vita. Web Beans RI attualmemnte non espone punti di estensione del ciclo di vita, così occorre codificare direttamente nelle classi Web Beans RI.

source: The Web Beans RI SPI
it_it: Web Beans RI SPI

source: The Web Beans SPI is located in <literal>webbeans-ri-spi</literal> module, and packaged as <literal>webbeans-ri-spi.jar</literal>.
it_it: Web Beans SPI è collocato nel modulo <literal>webbeans-ri-spi</literal>, ed è impacchettato come <literal>webbeans-ri-spi.jar</literal>."

source: Currently, the only SPI to implement is the bootstrap spi:
it_it: Attualmente l'unico SPI (Service Provider Interface) da implementare è l'spi di bootstrap:

source: The discovery of Web Bean classes and <literal>web-bean.xml</literal> files is self-explanatory (the algorithm is described in Section 11.1 of the JSR-299 specification, and isn't repeated here).
it_it: L'analisi dei file delle classi Web Bean e di <literal>web-bean.xml</literal> è molto istruttiva (l'algoritmo è descritto nella sezione 11.1 della specifica JSR-299 e non viene qua ripetuto).

source: The Web Beans RI also delegates EJB3 bean discovery to the container so that it doesn't have to scan for EJB3 annotations or parse <literal>ejb-jar.xml</literal>. For each EJB in the application an EJBDescriptor should be discovered:
it_it: Web Beans RI delega al container la rilevazione dei bean EJB3 così da non essere necessario eseguire lo scan delle annotazioni EJB3 o fare il parsing di <literal>ejb-jar.xml</literal>. Per ciascun EJB nell'applicazione dovrebbe essere rilevato un EJBDescriptor:

source: The contract described the JavaDoc is enough to implement an EJBDescriptor. In addition to these two interfaces, there is <literal>BusinessInterfaceDescriptor</literal> which represents a local business interface (encapsulating the interface class and jndi name), and <literal>MethodDescriptor</literal> which encapsulates the method name and parameter types (allowing it to be invoked on any instance of the EJB, proxy or otherwise).
it_it: Il contrattodescritto in JavaDoc è sufficiente per implementare un EJBDescriptor. In aggiunta a queste due interfacce, vi è <literal>BusinessInterfaceDescriptor</literal> a rappresentare un'interfaccia locale di business (che incapsula la classe d'interfaccia ed il nome jndi), e <literal>MethodDescriptor</literal> che incapsula il nome del metodo ed i tipi di parametri (che consentono di essere invocati su qualsiasi istanza di EJB, proxy o altro).

source: The Web Beans RI can be told to load your implementation of <literal>WebBeanDiscovery</literal> using the property <literal>org.jboss.webbeans.bootstrap.webBeanDiscovery</literal> with the fully qualified class name as the value. For example:
it_it: Web Beans RI può essere istruita a caricare la propria implementazione di <literal>WebBeanDiscovery</literal> usando la proprietà <literal>org.jboss.webbeans.bootstrap.webBeanDiscovery</literal> con il nome della classe pienamente qualificato (fully qualified) come valore. Per esempio:

source: The property can either be specified as a system property, or in a properties file <literal>META-INF/web-beans-ri.properties</literal>.
it_it: La proprietà può essere specificata come proprietà di sistema o nel file di proprietà <literal>META-INF/web-beans-ri.properties</literal>.

source: The contract with the container
it_it: Il contratto con il container

source: There are a number of requirements that the Web Beans RI places on the container for correct functioning that fall outside implementation of APIs
it_it: Ci sono un numero di requisiti che Web Beans RI pone nel container per il corretto funzionamento al di fuori dell'implementazione delle API

source: Classloader isolation
it_it: Isolamento del classloader

source: If you are integrating the Web Beans into an environment that supports deployment of applications, you must enable, automatically, or through user configuation, classloader isolation for each Web Beans application
it_it: Se si integra Web Beans in un ambiente che supporta il deploy di applicazioni, occorre abilitare, automaticamente o attraverso la configurazione utente, l'isolamento del classloader for ogni applicazione Web Beans

source: The <literal>webbeans-ri.jar</literal>
it_it: <literal>webbeans-ri.jar</literal>

source: If you are integrating the Web Beans into an environment that supports deployment of applications, you must insert the <literal>webbeans-ri.jar</literal> into the applications isolated classloader. It cannot be loaded from a shared classloader.
it_it: Se si integra Web Beans in un ambiente che supporta il deploy di applicazioni, occorre inserire <literal>webbeans-ri.jar</literal> nel classloader isolato delle applicazioni. Non può essere caricato da un classloader condiviso.
