Repository: 1tchy/core
Catalog: reference/*/modules/stereotypes.po
Languages: it_it

source: Stereotypes
it_it: Stereotipi

source: According to the Web Beans specification:
it_it: Secondo la specifica Web Beans:

source: In many systems, use of architectural patterns produces a set of recurring Web Bean roles. A stereotype allows a framework developer to identify such a role and declare some common metadata for Web Beans with that role in a central place.
it_it: In molti sistemi l'uso di pattern architetturali produce un set di ruoli Web Bean ricorrenti. Uno stereotipo consente allo sviluppatore di framework di identificare tale ruolo e di dichiarare alcuni metadati comuni per i Web Bean con tale ruolo come parte principale.

source: A stereotype encapsulates any combination of:
it_it: Uno stereotipo incapsula qualsiasi combinazione di:

source: a default deployment type,
it_it: un tipo di deploy di default,

source: a default scope type,
it_it: un tipo di scope di default,

source: a restriction upon the Web Bean scope,
it_it: una restrizione sullo scope del Web Bean,

source: a requirement that the Web Bean implement or extend a certain type, and
it_it: un requisito che il Web Bean implementi o estenda un certo tipo, e

source: a set of interceptor binding annotations.
it_it: un set di annotazioni di interceptor binding.

source: A stereotype may also specify that all Web Beans with the stereotype have defaulted Web Bean names.
it_it: Uno stereotipo può anche specificare che tutti i Web Beans con tale stereotipo abbiano nomi Web Bean di default.

source: A Web Bean may declare zero, one or multiple stereotypes.
it_it: Un Web Bean può dichiarare zero, uno o più stereotipi.

source: A stereotype is a Java annotation type. This stereotype identifies action classes in some MVC framework:
it_it: Uno stereotipo è un tipo di annotazione Java. Questo stereotipo identifica le classi di azione in alcuni framework MVC:

source: We use the stereotype by applying the annotation to a Web Bean.
it_it: Lo stereotipo viene impiegato applicando l'annotazione al Web Bean.

source: Default scope and deployment type for a stereotype
it_it: Scope di default e tipo di deploy per uno stereotipo

source: A stereotype may specify a default scope and/or default deployment type for Web Beans with that stereotype. For example, if the deployment type <literal>@WebTier</literal> identifies Web Beans that should only be deployed when the system executes as a web application, we might specify the following defaults for action classes:
it_it: Uno stereotipo può specificare uno scope di default e/o un tipo di deploy di default per Web Bean con tale stereotipo. Per esempio, se il tipo di deploy <literal>@WebTier</literal> identifica Web Bean che dovrebbero essere deployati quando il sistema viene eseguito come applicazione web, si potrebbero specificare i seguenti valori di default per le classi d'azione:

source: Of course, a particular action may still override these defaults if necessary:
it_it: Certamente una particolare azione può comunque fare l'override di questi valore se necessario:

source: If we want to force all actions to a particular scope, we can do that too.
it_it: Se si vuole forzare tutte le azioni ad un particolare scope, è possibile.

source: Restricting scope and type with a stereotype
it_it: Restringere lo scope ed il tipo con uno stereotipo

source: Suppose that we wish to prevent actions from declaring certain scopes. Web Beans lets us explicitly specify the set of allowed scopes for Web Beans with a certain stereotype. For example:
it_it: Si supponga di voler prevenire le azioni dal dichiarare certi scope. Web Beans consente esplicitamente di specificare un set di scope consentiti per Web Bean con certi stereotipi. Per esempio:

source: If a particular action class attempts to specify a scope other than the Web Beans request scope, an exception will be thrown by the Web Bean manager at initialization time.
it_it: Se una particolare classe d'azione tenta di specificare uno scope diverso dallo scope di richiesta Web Bean, verrà lanciata un'eccezione dal manager Web Bean in fase di inizializzazione.

source: We can also force all Web Bean with a certain stereotype to implement an interface or extend a class:
it_it: Si può forzare tutti i Web Bean con certi stereotipi ad implementare un'interfaccia o ad estendere una classe:

source: If a particular action class does not extend the class <literal>AbstractAction</literal>, an exception will be thrown by the Web Bean manager at initialization time.
it_it: Se una particolare classe d'azione non estende la classe <literal>AbstractAction</literal>, verrà lanciata un'eccezione dal manager Web Bean in fase di inizializzazione.

source: Interceptor bindings for stereotypes
it_it: Interceptor binding per gli stereotipi

source: A stereotype may specify a set of interceptor bindings to be inherited by all Web Beans with that stereotype.
it_it: Uno stereotipo può specificare un set di interceptor binding da ereditare da tutti i Web Bean con quello stereotipo.

source: This helps us get technical concerns even further away from the business code!
it_it: Questo aiuta ad ottenere concern tecnici anche lontano dal codice di business!

source: Name defaulting with stereotypes
it_it: Assegnare nomi di default con gli stereotipi

source: Finally, we can specify that all Web Beans with a certain stereotype have a Web Bean name, defaulted by the Web Bean manager. Actions are often referenced in JSP pages, so they're a perfect use case for this feature. All we need to do is add an empty <literal>@Named</literal> annotation:
it_it: Infine è possibile specificare che tutti i Web Bean con certi stereotipi abbiamo un certo nome Web Bean, messo di default dal manager Web Bean. Le azioni sono spesso referenziate nelle pagine JSP, e quindi sono un caso d'uso perfetto per questa funzionalità. Basta aggiungere un'annotazione vuota <literal>@Named</literal>:

source: Now, <literal>LoginAction</literal> will have the name <literal>loginAction</literal>.
it_it: Ora, <literal>LoginAction</literal> avrà nome <literal>loginAction</literal>.

source: Standard stereotypes
it_it: Stereotipi standard

source: We've already met two standard stereotypes defined by the Web Beans specification: <literal>@Interceptor</literal> and <literal>@Decorator</literal>.
it_it: Si sono già visti due stereotipi standard definiti dalla specifica Web Bean: <literal>@Interceptor</literal> e <literal>@Decorator</literal>.

source: Web Beans defines one further standard stereotype:
it_it: Web Bean definisce un ulteriore stereotipo standard:

source: This stereotype is intended for use with JSF. Instead of using JSF managed beans, just annotate a Web Bean <literal>@Model</literal>, and use it directly in your JSF page.
it_it: Questo stereotipo è inteso per l'uso con JSF. Invece di usare bean gestiti da JSF, basta annotare un Web Bean con <literal>@Model</literal>, e usarlo direttamente nelle pagine JSF.
