Repository: 1tchy/core
Catalog: reference/*/modules/xml.po
Languages: it_it

source: Defining Web Beans using XML
it_it: Definire i Web Beans tramite XML

source: So far, we've seen plenty of examples of Web Beans declared using annotations. However, there are a couple of occasions when we can't use annotations to define the Web Bean:
it_it: Finora abbiamo visto molti esempi di Web Bean dichiarati usando annotazioni. Comunque ci sono varie occasioni in cui non è possibile usare le annotazioni per definire un Web Bean:

source: when the implementation class comes from some preexisting library, or
it_it: quando la classe d'implementazione proviene da qualche libreria preesistente, o

source: when there should be multiple Web Beans with the same implementation class.
it_it: quando devrebbero esserci Web Beans multipli con la stessa classe d'implementazione.

source: In either of these cases, Web Beans gives us two options:
it_it: In entrambi i casi Web Beans fornisce due opzioni:

source: write a producer method, or
it_it: scrivere un metodo produttore, o

source: declare the Web Bean using XML.
it_it: dichiarare il Web Bean usando XML.

source: Many frameworks use XML to provide metadata relating to Java classes. However, Web Beans uses a very different approach to specifying the names of Java classes, fields or methods to most other frameworks. Instead of writing class and member names as the string values of XML elements and attributes, Web Beans lets you use the class or member name as the name of the XML element.
it_it: Molti framework utilizzano XML per scrivere metadati relazionati alle classi. Web Beans usa un approccio molto diverso rispetto agli altri framework per specificare i nomi delle classi Java, dei campi o dei metodi. Invece di scrivere i nomi delle classi o dei membri come valori stringa di elementi e atttributi XML, Web Beans consente di utilizzare il nome della classe o del membro come nome dell'elemento XML.

source: The advantage of this approach is that you can write an XML schema that prevents spelling errors in your XML document. It's even possible for a tool to generate the XML schema automatically from the compiled Java code. Or, an integrated development environment could perform the same validation without the need for the explicit intermediate generation step.
it_it: Il vantaggio di quest'approccio è che risulta possibile scrivere uno schemaXML che previene gli errori di scrittura nei documenti XML. E' comunque possibile per un tool generare lo schema XML in modo automatico dal codice Java compilato. Oppure un ambiente di sviluppo integrato può eseguire la stessa validazionesenza il bisogno di un passo di generazione intermedio ed esplicito.

source: Declaring Web Bean classes
it_it: Dichiarare classi Web Bean

source: For each Java package, Web Beans defines a corresponding XML namespace. The namespace is formed by prepending <literal>urn:java:</literal> to the Java package name. For the package <literal>com.mydomain.myapp</literal>, the XML namespace is <literal>urn:java:com.mydomain.myapp</literal>.
it_it: Per ogni pacchetto Java, Web Beans definisce un corrispondente namespace XML. Ilnamespace è formato aggiungendo il prefisso <literal>urn:java:</literal> al nomedel pacchetto Java. Per il pacchetto <literal>com.mydomain.myapp</literal>, il namespace XML è <literal>urn:java:com.mydomain.myapp</literal>.

source: Java types belonging to a package are referred to using an XML element in the namespace corresponding to the package. The name of the element is the name of the Java type. Fields and methods of the type are specified by child elements in the same namespace. If the type is an annotation, members are specified by attributes of the element.
it_it: I tipi Java appartenenti al pacchetto vengono riferiti usando un elemento XML nel namespace corrispondente al pacchetto. Il nome dell'elemento è un nome di tipo Java. I campi e metodi del tipo vengono specificati dagli elementi figlio nello stesso namespace. Se il tipo è un'annotazione, i membri sonospecificati dagli attributi dell'elemento.

source: For example, the element <literal>&lt;util:Date/&gt;</literal> in the following XML fragment refers to the class <literal>java.util.Date</literal>:
it_it: Per esempio l'elemento <literal>&lt;util:Date/&gt;</literal> nel seguente frammento XML si riferisce alla classe <literal>java.util.Date</literal>:

source: And this is all the code we need to declare that <literal>Date</literal> is a simple Web Bean! An instance of <literal>Date</literal> may now be injected by any other Web Bean:
it_it: E questo è tutto il codice per dichiarare che <literal>Date</literal> è un Web Bean semplice! Un'istanza di <literal>Date</literal> ora può essere iniettata da qualsiasi altro Web Bean:

source: Declaring Web Bean metadata
it_it: Dichiarare metadati Web Bean

source: We can declare the scope, deployment type and interceptor binding types using direct child elements of the Web Bean declaration:
it_it: Possiamo dichiarare lo scope, il tipo di deploy ed i tipi di binding degli interceptor usando elementi figli diretti della dichiarazione Web Bean:

source: We use exactly the same approach to specify names and binding type:
it_it: Utilizziamo esattamente lo stesso approccio per specificare i nomi ed il tipo di binding:

source: Where <literal>@Login</literal> and <literal>@SystemStart</literal> are binding annotations types.
it_it: Dove <literal>@Login</literal> e <literal>@SystemStart</literal> sono tipi di annotazioni di binding.

source: As usual, a Web Bean may support multiple binding types:
it_it: Di nuovo un Web Bean può supportare tipi di binding multipli:

source: Interceptors and decorators are just simple Web Beans, so they may be declared just like any other simple Web Bean:
it_it: Interceptor e decoratori sono solo eb Bean semplici, e quindi possono essere dichiarati come qualsiasi altro Web Bean semplice:

source: Declaring Web Bean members
it_it: Dichiarare membri Web Bean

source: TODO!
it_it: DA FARE!

source: Declaring inline Web Beans
it_it: Dichiarazione inline dei Web Beans

source: Web Beans lets us define a Web Bean at an injection point. For example:
it_it: I Web Beans consentono di definire un Web Bean ad un certo punto di iniezione. Per esempio:

source: The <literal>&lt;Name&gt;</literal> element declares a simple Web Bean of scope <literal>@Dependent</literal> and class <literal>Name</literal>, with a set of initial field values. This Web Bean has a special, container-generated binding and is therefore injectable only to the specific injection point at which it is declared.
it_it: L'elemento <literal>&lt;Name&gt;</literal> dichiara un Web Bean semplice con scope <literal>@Dependent</literal> e classe <literal>Name</literal>, con un set di valori di campo iniziali. Questo Web Bean ha uno speciale binding generatore dal container e quindi è iniettabile solo allo specifico punto di iniezione al quale è stato dichiarato.

source: This simple but powerful feature allows the Web Beans XML format to be used to specify whole graphs of Java objects. It's not quite a full databinding solution, but it's close!
it_it: Questa caratteristica semplice e potente consente formato XML di Web Bean di essere usato per specificare l'intero grafo di oggetti Java. Non è ancora una completa soluzione di databinding, ma ci si avvicina!

source: Using a schema
it_it: Uso di uno schema

source: If we want our XML document format to be authored by people who aren't Java developers, or who don't have access to our code, we need to provide a schema. There's nothing specific to Web Beans about writing or using the schema.
it_it: Se si vuole che il formato di documento XML sia scritto da persone che non sono sviluppatori Java o che non hanno accesso al codice, occorre fornire uno schema. There's nothing specific to Web Beans about writing or using the schema.

source: Writing an XML schema is quite tedious. Therefore, the Web Beans RI project will provide a tool which automatically generates the XML schema from compiled Java code.
it_it: Scrivere unoschema XML è abbastanza noiso. Quindi il progetto Web Beans RI fornirà uno strumento per generare automaticamente lo schema XML dal codice Java compilato.
