Repository: 1tchy/core
Catalog: reference/*/decorators.po
Languages: de_de, es_es, fr_fr, ja_jp, pt_br

source: Decorators
de_de: Dekoratoren
es_es: Decoradores
fr_fr: Décorateurs
ja_jp: デコレータ
pt_br: Decoradores

source: Interceptors are a powerful way to capture and separate concerns which are <emphasis>orthogonal</emphasis> to the type system. Any interceptor is able to intercept invocations of any Java type. This makes them perfect for solving technical concerns such as transaction management and security. However, by nature, interceptors are unaware of the actual semantics of the events they intercept. Thus, interceptors aren't an appropriate tool for separating business-related concerns.
de_de: Interzeptoren bieten eine leistungsfähige Weise, Probleme, die <emphasis>orthogonal</emphasis> zum Typensystem sind, festzuhalten und zu trennen. Jeder Interzeptor kann Aufrufe jedes Java Typs abfangen. Dies macht ihn perfekt für die Lösung technischer Probleme wie etwa Transaktionsmanagement und Sicherheit.Jedoch sind Interzeptoren ihrem Wesen nach nicht der tatsächlichen Semantik der Ereignisse gewahr, die sie abfangen. Interzeptoren sind daher nicht die geeigneten Tools zur Separierung von unternehmensbezogenen Problemen.
es_es: Los interceptores son una forma potente de capturar y distinguir cuestiones que son <emphasis>ortogonales</emphasis> al tipo de sistema. Cualquier interceptor puede interceptar invocaciones de cualquier tipo Java. Esto los hace perfectos para resolver las cuestiones técnicas como la administración de transacción y la seguridad. Sin embargo, por naturaleza, los interceptores desconocen la semántica real de los eventos que interceptan. Por lo tanto, los interceptores no son una herramienta apropiada para distinguir cuestiones relacionadas con negocios.
fr_fr: Les intercepteurs sont une manière puissante de capter et de séparer les problèmes qui sont <emphasis>orthogonaux</emphasis> au type de système. Tout intercepteur est capable d'intercepter les invocations à tout type Java. Cela les rend parfait pour résoudre des problèmes techniques tels que la gestion transactionnelle et la sécurité.Cependant, par nature, les intercepteurs ne sont pas conscients de la sémantique réelle des évênements qu'ils interceptent. En conséquence, les intercepteurs ne sont pas un outil approprié pour séparer problèmes <emphasis>métiers<emphasis>.
ja_jp: インタセプタは、型システムとは <emphasis>直交した</emphasis> （複数の）関心事をとらえて、それらを分離する強力な方法です。インタセプタは任意のJavaの型の呼び出しに割り込むことができます。しかし、これは当然のこととして、トランザクション管理やセキュリティ管理のような技術的関心事を完全に解決します。しかし、インタセプタは割り込む対象となる事象の実際のセマンティクスまでは気づきません。したがって、インタセプタはビジネス関連の関心事を分離するには適したツールではありません。
pt_br: Interceptores são um meio poderoso para capturar e separar preocupações <emphasis>ortogonais</emphasis> para o tipo de sistema. Qualquer interceptador é capaz de interceptar invocações de qualquer tipo Java. Isto torna-os ideais para resolver questões técnicas, tais como gerenciamento de transação e segurança. No entanto, por natureza, interceptores desconhecem a real semântica dos eventos que interceptam. Assim, interceptores não são um instrumentos adequados para a separação de questões relacionadas à negócios.

source: The reverse is true of <emphasis>decorators</emphasis>. A decorator intercepts invocations only for a certain Java interface, and is therefore aware of all the semantics attached to that interface. This makes decorators a perfect tool for modeling some kinds of business concerns. It also means that a decorator doesn't have the generality of an interceptor. Decorators aren't able to solve technical concerns that cut across many disparate types.
de_de: Das Gegenteil gilt für <emphasis>Dekoratoren</emphasis>. Ein Dekorator fängt Aufrufe nur für ein bestimmtes Java-Interface ab und kennt daher die zu diesem Interface gehörende Semantik. Dadurch sind Dekoratoren das perfekte Tool zur Bearbeitung einige unternehmensbezogener Probleme. Es bedeutet auch, dass Dekoratoren nicht diesselbe Allgemeingültigkeit wie Interzeptoren besitzen. Dekoratoren können keine technischen Probleme lösen, die sich über viele disparate Typen verteilen.
es_es: Contrario a los <emphasis>decoradores</emphasis>, los cuales interceptan invocaciones únicamente para una cierta interfaz de Java y son por lo tanto, conscientes de toda la semántica asociada a la interfaz. Esto los hace una herramienta perfecta para representar algunas clases de cuestiones de negocios. También significa que los decoradores no tienen la generalidad de un interceptor. Los decoradores no pueden resolver problemas técnicos que atraviesan muchos tipos dispares.
fr_fr: L'inverse est vrai pour les <emphasis>décorateurs</emphasis>. Un décorateur intercepte les invocations uniquement pour une certain interface Java, et est donc conscient de toute la sémantique rattachée à cette interface. Cela fait des décorateurs un outil parfait pour modéliser certains concepts métiers. Cela veut aussi dire qu'un décorateur n'est pas aussi générique qu'un intercepteur. Les décorateurs ne sont pas capables de résoudres des problèmes techniques qui peuvent toucher des types très disparates.
ja_jp: 反対のことは <emphasis>デコレータ</emphasis> についても言えます。デコレータは特定のJavaインタフェースのみの呼び出しに割り込むので、そのインタフェースに付随するすべてのセマンティクスを知っています。このことによってデコレータはある種のビジネス関心事をモデリングするための完全なツールになります。また、それはデコレータがインタセプタが持つ一般性を備えていないことも意味します。デコレータは多くの異なる型に対して横断的な技術的関心事を解決することはできないのです。
pt_br: O contrário é verdadeiro <emphasis>decoradores</emphasis>. O decorator intercepta invocações apenas para uma determinada interface Java e, portanto, é ciente de toda a semântica que acompanha a interface. Isto torna os decoradores uma ferramenta perfeita para modelar alguns tipos de questões de negócios. Significa também que um decorador não tem a generalidade de um interceptador. Decoradores não são capazes de resolver questões técnicas que atravessam muitos tipos diferentes.

source: Suppose we have an interface that represents accounts:
de_de: Nehmen wir an, wir besitzen ein Konten repräsentierendes Interface:
es_es: Supongamos que tenemos una interfaz que representa cuentas:
fr_fr: Supposez que nous ayons une interfaces représentant des comptes:
ja_jp: 次のような口座 (account) を表現するインタフェースがあると仮定しましょう。
pt_br: Suponha que temos uma interface que representa contas:

source: Several different Web Beans in our system implement the <literal>Account</literal> interface. However, we have a common legal requirement that, for any kind of account, large transactions must be recorded by the system in a special log. This is a perfect job for a decorator.
de_de: Mehrere verschiedene Web Beans in unserem System implementieren das <literal>Account</literal>-Interface. Es existiert allerdings eine gängige legale Voraussetzung die besagt, dass für jede Art von Konto, große Transaktionen vom System in einem besonderen Protokoll gespeichert werden müssen. Dies ist die perfekte Aufgabe für einen Dekorator.
es_es: Varios Web Beans diferentes en nuestro sistema implementan la interfaz de <literal>Cuenta</literal>. No obstante, tenemos un requisito legal que, para cualquier clase de cuenta, las transacciones grandes deben ser registradas por el sistema en un registro especial. Este es el trabajo perfecto para un decorador.
fr_fr: Plusieurs Web Beans distincts dans notre système implémentent l'interface <literal>Account</literal>. Nous avons cependant une obligation légale qui nous oblige à enregistrer les grosses transactions faites sur le système dans un journal spécial, et ce, pour tout type de compte. Ceci est un cas d'utilisation idéal d'un décorateur.
ja_jp: 私たちのシステムではいくつかの異なるWeb Beansが <literal>Account</literal> を実装します。しかし、どのような口座であろうと大口の取引は特別なログに記録されなければならないという共通の法的要件があります。これはデコレータに最適な仕事です。
pt_br: Vários Web Beans em nosso sistema implementam a interface <literal>Account</literal>. No entanto, temos uma obrigação legal que, para qualquer tipo de conta, as grandes transações devem ser registadas pelo sistema, em um registro especial (log). Este é um trabalho perfeito para um decorador.

source: A decorator is a simple Web Bean that implements the type it decorates and is annotated <literal>@Decorator</literal>.
de_de: Ein Dekorator ist ein einfaches Web Bean, das den Typ das es dekoriert implementiert und <literal>@Decorator</literal> annotiert ist.
es_es: Un decorador es un Web Bean sencillo que implementa el tipo que decora y es anotado <literal>@Decorator</literal>.
fr_fr: Un décorateur est un simple Web Bean qui implémente le type qu'il décore, et qui est annoté <literal>@Decorator</literal>.
ja_jp: デコレータは <literal>@Decorator</literal> というアノテーションによって修飾された型を実装するシンプル Web Beanです。
pt_br: Um decorador é um Web Bean simples que implementa o tipo que decora e é anotado com <literal>@Decorator</literal>.

source: Unlike other simple Web Beans, a decorator may be an abstract class. If there's nothing special the decorator needs to do for a particular method of the decorated interface, you don't need to implement that method.
de_de: Anders als andere einfache Web Beans, kann ein Dekorator eine abstrakte Klasse sein. Falls es nichts besonderes ist, dass der Dekorator für eine bestimmte Methode des dekorierten Interface tun muss, so brauchen Sie diese Methode nicht zu implementieren.
es_es: A diferencia de otros Web Beans sencillos, un decorador puede ser una clase abstracta. Si no hay nada especial que el decorador tenga que hacer para un método particular de la interfaz decorada, usted no necesita implementar ese método.
fr_fr: Contrairement à d'autres Web Beans simples, un décorateur peut être une classe abstraite. Si le décorateur n'a rien de spécial à faire pour une méthode particulière d'une interface décorée, vous n'avez pas besoin d'implémenter cette méthode.
ja_jp: 他のシンプル Web Beans とは異なり、デコレータは抽象クラスにすることができます。修飾されたインタフェースの特定のメソッドのためにデコレータとして何も特別なことをする必要がなければ、そのメソッドを実装する必要はありません。
pt_br: Ao contrário de outros Web Beans simples, um decorador pode ser uma classe abstrata. Se não há nada de especial que o decorador precisa fazer para um determinado método da interface decorada, você não precisa implementar esse método.

source: Delegate attributes
de_de: "Delegate" Attribute
es_es: Atributos de delegado
fr_fr: Attributs de délégation
ja_jp: 移譲属性
pt_br: Atributos delegados

source: All decorators have a <emphasis>delegate attribute</emphasis>. The type and binding types of the delegate attribute determine which Web Beans the decorator is bound to. The delegate attribute type must implement or extend all interfaces implemented by the decorator.
de_de: Alle Dekoratoren besitzen ein <emphasis>"Delegate" Attribut</emphasis>. Typ und Binding-Typen des "Delegate" Attribut bestimmen, an welche Web Beans der Dekorator gebunden wird. Der Typ des "Delegate" Attributs muss alle vom Dekorator implementierten Interfaces implementieren oder erweitern.
es_es: Todos los decoradores tienen un <emphasis>atributo de delegado</emphasis>. El tipo y los tipos de vinculación del atributo de delegado determinan los Web Beans a los que el decorador está vinculado. El tipo de atributo de delegado debe implementar o extender todas las interfaces implementadas por el decorador.
fr_fr: Tous les décorateurs ont un <emphasis>attribut de délégation</emphasis>. Le type et les types liés d'un attribut de délégation déterminent à quel Web Beans le décorateur est relié. Le type de l'attribut délégué doit implémenter ou étendre toutes les interfaces implémentées par le décorateur.
ja_jp: デコレータは <emphasis>移譲属性 (delegate attribute)</emphasis> を持ちます。移譲属性の型やバインディングタイプ
pt_br: Todos os decoradores têm um <emphasis>atributo delegado</emphasis>. O tipo e os tipos de binding do atributo delegado determinam qual o Web Beans que o decorador está vinculado. O tipo do atributo delegado deve implementar ou estender todas as interfaces implementadas pelo decorador.

source: This delegate attribute specifies that the decorator is bound to all Web Beans that implement <literal>Account</literal>:
de_de: Dieses "Delegate" Attribut legt fest, dass der Dekorator an alle <literal>Account</literal> implementierenden Web Beans gebunden wird:
es_es: Este atributo de delegado especifica que el decorador está vinculado a los Web Beans que implementan <literal>Cuenta</literal>:
fr_fr: L'attribut de délégation spécifie que le décorateur est lié à tous les Web Beans qui impémentent <literal>Account</literal>:
ja_jp: この移譲属性は、デコレータが <literal>Account</literal> を実装するすべてのWeb Beansに対して結びついていることを指定します。
pt_br: Este atributo delegado especifica que o decorador está vinculado a todos os Web Beans que implementam <literal>Account</literal>:

source: A delegate attribute may specify a binding annotation. Then the decorator will only be bound to Web Beans with the same binding.
de_de: Ein "Delegate" Attribut kann eine Binding-Annotation festlegen. Dann wird der Dekorator nur an Web Beans mit demselben Binding gebunden.
es_es: Un atributo de delegado puede especificar una anotación de enlace. Luego el decorador sólo estará vinculado a los Web Beans con el mismo enlace.
fr_fr: Un attribut de délégation peut spécifier une annotation de liaison. Alors, le décorateur sera seulement lié à tous les Web Beans ayant la même liaison.
ja_jp: 移譲属性はバインディングアノテーションを指定するかもしれません。そのときは、デコレータは同じバインディングを持つWeb Beansに結びつくだけです。
pt_br: Um atributo delegado pode especificar uma anotação de binding. Então, o decorador só será vinculado ao Web Beans com o mesmo vínculo.

source: A decorator is bound to any Web Bean which:
de_de: Ein Dekorator wird an ein beliebiges Web Bean gebunden, das:
es_es: Un decorador está vinculado a cualquier Web Bean que:
fr_fr: Un décorateur est lié à tout Web Bean qui:
ja_jp: デコレータは以下の任意のWeb Beanに結びつきます。
pt_br: Um decorador é vinculado a qualquer Web Bean que:

source: has the type of the delegate attribute as an API type, and
de_de: den Typ des "Delegate" Attributs als einen API-Typ hat und
es_es: tenga el tipo de atributo de delegado como un tipo API, y
fr_fr: a le type de l'attribut de délégation comme type d'API, et
ja_jp: APIタイプとして移譲属性のタイプを持つものと、
pt_br: tem o tipo do atributo delegado como um tipo da API, e

source: has all binding types that are declared by the delegate attribute.
de_de: alle Binding-Typen besitzt die durch das "Delegate" Attribut deklariert werden.
es_es: tenga todos los tipos de vinculación declarados por el atributo de delegado.
fr_fr: a tous les types de liaison qui sont déclarés par l'attribut de délégation.
ja_jp: 移譲属性によって宣言されるすべてのバインディングタイプを持つもの
pt_br: tem todos os tipos de vínculo que são declarados pelo atributo delegado.

source: The decorator may invoke the delegate attribute, which has much the same effect as calling <literal>InvocationContext.proceed()</literal> from an interceptor.
de_de: Der Dekorator kann das "Delegate" Attribut aufrufen, was eine sehr ähnliche Wirkung wie der Aufruf von <literal>InvocationContext.proceed()</literal> von einem Interzeptor hat.
es_es: El decorador puede invocar el atributo de delegado, el cual tiene casi el mismo efecto que llamar a <literal>InvocationContext.proceed()</literal> desde un interceptor.
fr_fr: Le décorateur peut invoquer l'attribut de délégation, qui a le même effet que d'appeler <literal>InvocationContext.proceed()</literal> à partir d'un intercepteur.
ja_jp: デコレータは移譲属性を呼び出す可能性があります。その移譲属性はインタセプタから <literal>InvocationContext.proceed()</literal> を呼び出すのと同じ効果があります。
pt_br: O decorador pode invocar o atributo delegado, que tem praticamente o mesmo efeito que chamar <literal>InvocationContext.proceed()</literal> a partir de um interceptador

source: Enabling decorators
de_de: Aktivierung von Dekoratoren
es_es: Habilitar decoradores
fr_fr: Activation des décorateurs
ja_jp: デコレータの有効化
pt_br: Habilitando decoradores

source: We need to <emphasis>enable</emphasis> our decorator in <literal>web-beans.xml</literal>.
de_de: Wir müssen unseren Dekorator in <literal>web-beans.xml</literal> <emphasis>aktivieren</emphasis>.
es_es: Necesitamos <emphasis>habilitar</emphasis> nuestro decorador en <literal>web-beans.xml</literal>.
fr_fr: Nous avons besoin d'<emphasis>activer</emphasis> notre décorateur dans le fichier <literal>web-beans.xml</literal>.
ja_jp: デコレータは <literal>web-beans.xml</literal> で <emphasis>有効化</emphasis> する必要があります。
pt_br: Nós precisamos <emphasis>habilitar</emphasis> nosso decorador no <literal>web-beans.xml</literal>.

source: This declaration serves the same purpose for decorators that the <literal>&lt;Interceptors&gt;</literal> declaration serves for interceptors:
de_de: Diese Deklaration dient demselben Zweck für Dekoratoren, den die<literal>&lt;Interceptors&gt;</literal>-Deklaration für Interzeptoren erfüllt:
es_es: Esta declaración sirve el mismo propósito para decoradores que la declaración de <literal>&lt;Interceptores&gt;</literal> sirve para interceptores:
fr_fr: Cette déclaration a le même but pour les décorateurs que la déclaration <literal>&lt;Interceptors&gt;</literal> pour les intercepteurs:
ja_jp: この宣言はデコレータに対して <literal>&lt;Interceptors&gt;</literal> 宣言がインタセプタに対するものと同じ目的を持ちます。
pt_br: Essa declaração tem o mesmo propósito para decoradores que a <literal>&lt;Interceptors&gt;</literal> tem para os interceptadores:

source: it enables us to specify a total ordering for all decorators in our system, ensuring deterministic behavior, and
de_de: es ermöglicht uns eine gesamte Ordnung für alle Dekoratoren in unserem System festzulegen, wodurch deterministisches Verhalten gewährleistet wird und
es_es: nos permite especificar una orden total para los decoradores en nuestro sistema, garantizando una conducta de determinación y
fr_fr: cela nous permet de spécifier un ordre total pour tous les décorateurs dans notre système, assurant un comportement déterministe, et
ja_jp: 私たちのシステムにおけるすべてのデコレータの全体の順番を指定できるようにします。
pt_br: isso possibilita-nos determinar a ordem total para todos os decoradores em nosso sistema, assegurando um comportamento determinístico

source: it lets us enable or disable decorator classes at deployment time.
de_de: es gestattet uns, Dekorator-Klassen zum Deplyment-Zeitpunkt zu aktivieren oder zu deaktivieren.
es_es: permitiéndonos habilitar o inhabilitar las clase de decorador en el tiempo de implementación.
fr_fr: cela nous permet d'activer ou désactiver les classes de décorateurs au moment du déploiement.
ja_jp: デプロイ時にデコレータクラスを有効にしたり無効にしたりできるようにします。
pt_br: isso permite habilitarmos ou desabilitarmos as classes decoradas em tempo de implantação.

source: Interceptors for a method are called before decorators that apply to that method.
de_de: Interzeptoren für eine Methode werden aufgerufen vor den Dekoratoren an dieser Methode angewendet werden.
es_es: Los interceptores para un método son llamados según los decoradores que aplican a ese método.
fr_fr: Les intercepteurs pour une méthode sont appelés avant les décorateurs qui s'appliquent à cette méthode.
ja_jp: あるメソッドに対するインタセプタはデコレータがそのメソッドに適用される前に呼び出されます。
pt_br: Interceptadores para o método são chamados antes dos decoradores que se aplicam a esse método.
