Repository: 1tchy/core
Catalog: reference/*/ee.po
Languages: de_de, es_es, fr_fr, ja_jp, ko_kr, pt_br, zh_cn, zh_tw

source: Sending messages using JMS can be quite complex, because of the number of different objects you need to deal with. For queues we have <literal>Queue</literal>, <literal>QueueConnectionFactory</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> and <literal>QueueSender</literal>. For topics we have <literal>Topic</literal>, <literal>TopicConnectionFactory</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> and <literal>TopicPublisher</literal>. Each of these objects has its own lifecycle and threading model that we need to worry about.
de_de: Das Versenden von Nachrichten unter Verwendung von JMS kann aufgrund der Anzahl verschiedener Objekte mit denen Sie zu tun haben recht komplex sein. Für Warteschlangen haben wir <literal>Queue</literal>, <literal>QueueConnectionFactory</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> und <literal>QueueSender</literal>. Für Topics haben wir <literal>Topic</literal>, <literal>TopicConnectionFactory</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> und <literal>TopicPublisher</literal>. Jedes dieser Objekte besitzt einen eigenen Lebenszyklus und ein eigenes Threading-Modell, das unsere Aufmerksamkeit erfordert.
es_es: Enviar mensajes utilizando JMS puede ser bastante complejo, debido al número de objetos diferentes que se tienen que manejar. Para colas tenemos <literal>Queue</literal>, <literal>QueueConnectionFactory</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> y <literal>QueueSender</literal>. Para temas tenemos <literal>Topic</literal>, <literal>TopicConnectionFactory</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> y <literal>TopicPublisher</literal>. Cada uno de estos objetos tiene su propio ciclo de vida y modelo de hilos de los cuales tenemos que preocuparnos.
fr_fr: Envoyer des messages en utilisant JMS peut être assez complexe, à cause du nombre d'objets différents que vous devez traiter. Pour les queues, nous avons <literal>Queue</literal>; <literal>QueueConnectionFactory</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> et <literal>QueueSender</literal>. Pour les topics nous avons <literal>Topic</literal>, <literal>TopicConnectionFactory</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> et <literal>TopicPublisher</literal>. Chacun de ces objets a son propre cycle de vie et son modèle de threads dont nous devons nous soucier.
ja_jp: 扱う必要のある異なるオブジェクトの数により、JMSを使用してメッセージを送ることはかなり複雑な場合があります。キューのために、<literal>Queue</literal>, <literal>QueueConnectionFactory</literal>、<literal>QueueConnection</literal>および<literal>QueueSession</literal>と<literal>QueueSender</literal>があります。トピックのために、<literal>Topic</literal>、<literal>TopicConnectionFactory</literal>、<literal>TopicConnection</literal>、<literal>TopicSession</literal>および<literal>TopicPublisher</literal>があります。これらのオブジェクトには、自身のライフサイクルとスレッドモデルがあり、私たちは気遣う必要があります。
ko_kr: JMS를 사용하여 메세지를 전송하는 것은 다소 복잡할 수 있습니다. 이는 다수의 다른 개체를 처리해야 하기 때문입니다. 큐의 경우 <literal>Queue</literal>, <literal>QueueConnectionFactory</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> <literal>QueueSender</literal>를 갖습니다. 토픽의 경우 <literal>Topic</literal>, <literal>TopicConnectionFactory</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal>, <literal>TopicPublisher</literal>를 갖습니다. 이러한 각각의 객체는 자체적으로 수명 주기 및 스레딩 모델을 갖고 있습니다.
pt_br: O envio de mensagens usando JMS pode ser bastante complexo, devido à quantidade de objetos diferentes que precisamos utilizar. Para filas, temos <literal>Queue</literal>, <literal>QueueConnectionFactory</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> e <literal>QueueSender</literal>. Para os tópicos, temos <literal>Topic</literal>, <literal>TopicConnectionFactory</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> e <literal>TopicPublisher</literal>. Cada um desses objetos tem seu próprio ciclo de vida e modelo de threads, com que temos de nos preocupar.
zh_cn: 使用JMS发送消息有点复杂，因为你需要处理很多不同的对象。对于队列（Queue），我们有<literal>Queue</literal>, <literal>QueueConnectionFactory</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> 和 <literal>QueueSender</literal>。对于主题（Topic）有<literal>Topic</literal>, <literal>TopicConnectionFactory</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> 和 <literal>TopicPublisher</literal>。这些对象每个都有自己的生命周期和线程模型，我们都需要考虑这些问题。
zh_tw: 基於需要處理許多不同的物件，因此透過使用 JMS 來傳送訊息可能會相當複雜。針對於 queue，我們有 <literal>Queue</literal>、<literal>QueueConnectionFactory</literal>、<literal>QueueConnection</literal>、<literal>QueueSession</literal> 以及 <literal>QueueSender</literal>。針對於 topic 我們有 <literal>Topic</literal>、<literal>TopicConnectionFactory</literal>、<literal>TopicConnection</literal>、<literal>TopicSession</literal> 以及 <literal>TopicPublisher</literal>。針對於各個這些物件，我們都需要去顧及它們自己各別的生命週期和執行緒模型（threading model）。

source: Web Beans takes care of all this for us. All we need to do is declare the queue or topic in <literal>web-beans.xml</literal>, specifying an associated binding type and connection factory.
de_de: Web Beans übernehmen all das für uns. Das Einzige, was wir tun müssen ist unsere Warteschlange oder unser Topic in <literal>web-beans.xml</literal> zu deklarieren und einen assoziierten Binding-Typ und eine Connection-Factory festzulegen.
es_es: Los Web Beans cuidan de todos por nosotros. Todo lo que se necesita es declarar la cola o tópico en <literal>web-beans.xml</literal>, especificando un tipo de enlace y conexión de fábrica.
fr_fr: Les Web Beans prennent en charge tout cela pour nous. Tout ce que nous avons à faire est de déclarer la queue ou le topic dans <literal>web-beans.xml</literal>, en spécifiant un type de liaison et une usine de connexion.
ja_jp: Web Beansはこのすべてを引き受けてくれます。関連したバインディングタイプとコネクションファクトリを指定し、<literal>web-beans.xml</literal>にキューかトピックを宣言するだけで良いのです。
ko_kr: Web Beans는 이러한 모든 것을 처리합니다. 여기서 처리해야 할 사항은 <literal>web-beans.xml</literal>에 있는 큐 또는 토픽을 명명하고 관련된 바인딩 유형 및 연결 팩토리를 지정하는 것입니다.
pt_br: A Web Beans cuida de tudo isso para nós. Tudo que precisamos fazer é declarar a fila ou o tópico no <literal>web-beans.xml</literal>, especificando e associando o tipo de binding e a fábrica de conexão (connection factory).
zh_cn: Web Beans为我们处理所有这些问题。我们只须在 <literal>web-beans.xml</literal>声明队列或者主题，指定一个关联的绑定类型和连接工厂即可。
zh_tw: Web Bean 會全部為我們處理。我們只需要在 <literal>web-beans.xml</literal> 中宣告 queue 或是 topic，指定關聯的綁定類型和連接因數（connection factory）。

source: Now we can just inject the <literal>Queue</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> or <literal>QueueSender</literal> for a queue, or the <literal>Topic</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> or <literal>TopicPublisher</literal> for a topic.
de_de: Jetzt können wir einfach <literal>Queue</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> oder <literal>QueueSender</literal> für eine Warteschlange oder aber <literal>Topic</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> oder <literal>TopicPublisher</literal> für ein Topic einspeisen.
es_es: Ahora podemos inyectar <literal>Queue</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> o <literal>QueueSender</literal> para una cola, o <literal>Topic</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> o<literal>TopicPublisher</literal> para un tema.
fr_fr: Maintenant, nous avons juste à injecter la <literal>Queue</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> ou <literal>QueueSender</literal> pour une queue, ou le <literal>Topic</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> or <literal>TopicPublisher</literal> pour un topic.
ja_jp: これで、キューのために<literal>Queue</literal>、<literal>QueueConnection</literal>、<literal>QueueSession</literal>または<literal>QueueSender</literal>をインジェクトできます。または、トピックのために<literal>Topic</literal>、<literal>TopicConnection</literal>、<literal>TopicSession</literal>または<literal>TopicPublisher</literal>をインジェクトできます。
ko_kr: 이제 큐의 경우 <literal>Queue</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal>, <literal>QueueSender</literal>를 삽입할 수 있고, 토픽의 경우 <literal>Topic</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> <literal>TopicPublisher</literal>를 삽입할 수 있습니다.
pt_br: Agora, podemos injetar a <literal>Queue</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> ou <literal>QueueSender</literal> para uma fila, ou <literal>Topic</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> ou <literal>TopicPublisher</literal> em um tópico.
zh_cn: 现在，对于队列，我们只须注入 <literal>Queue</literal>, <literal>QueueConnection</literal>, <literal>QueueSession</literal> 或者 <literal>QueueSender</literal>；对于主题，我们只须注入<literal>Topic</literal>, <literal>TopicConnection</literal>, <literal>TopicSession</literal> 或者 <literal>TopicPublisher</literal>。
zh_tw: 現在我們只要為 queue 注入 <literal>Queue</literal>、<literal>QueueConnection</literal>、<literal>QueueSession</literal> 或 <literal>QueueSender</literal>，或是為 topic 注入 <literal>Topic</literal>、<literal>TopicConnection</literal>、<literal>TopicSession</literal> 或是 <literal>TopicPublisher</literal> 即可。

source: The lifecycle of the injected JMS objects is completely controlled by the Web Bean manager.
de_de: Der Lebenszyklus der eingespeisten JMS-Objekte wird komplett durch den Web Bean Manager gesteuert.
es_es: El ciclo de vida de objetos JMS inyectados está controlado por el administrador deWeb Bean.
fr_fr: Le cycle de vie des objects JMS injectés est complètement contrôlé par le gestionnaire de Web Beans.
ja_jp: インジェクトされたJMSオブジェクトのライフサイクルは、Web Beanマネージャによって完全に制御されます。
ko_kr: 삽입된 JMS 객체의 수명주기는 Web Bean 관리자에 의해 전적으로 관리됩니다.
pt_br: O ciclo de vida do objeto JMS injetado é completamente controlado pelo gerenciador do Web Bean.
zh_cn: 被注入的JMS对象的生命周期完全由Web Bean管理器控制。
zh_tw: 被注入的 JMS 物件的生命週期完全由 Web Bean 管理員所控制。

source: Packaging and deployment
de_de: Packen und Deployment
es_es: Empaquetamiento y despliegue.
fr_fr: Paquetage et déploiement
ja_jp: パッケージとデプロイ
ko_kr: 패키징 및 배포
pt_br: Empacotamento e implantação
zh_cn: 打包和部署
zh_tw: 封裝和建置

source: Web Beans doesn't define any special deployment archive. You can package Web Beans in JARs, EJB-JARs or WARs&#151;any deployment location in the application classpath. However, each archive that contains Web Beans must include a file named <literal>web-beans.xml</literal> in the <literal>META-INF</literal> or <literal>WEB-INF</literal> directory. The file may be empty. Web Beans deployed in archives that do not have a <literal>web-beans.xml</literal> file will not be available for use in the application.
es_es: Web Beans no define ningún despliegue especial de archivo. Se puede empaquetar Web Beans en JAR, EJB-JAR o WAR&#151; cualquier ubicación de despliegue en la aplicación classpath. No obstante, cada archivo que contiene Web Beans debe incluir un archivo llamado <literal>web-beans.xml</literal> en <literal>META-INF</literal> o en el directorio <literal>WEB-INF</literal>. El archivo puede estar vacío. Los Web Beans desplegados en archivos que no tienen un archivo <literal>web-beans.xml</literal> no estarán disponibles para uso en la aplicación.
ko_kr: Web Beans는 특정 배포 아카이브를 지정하지 않습니다. JAR, EJB-JAR 또는 WAR에 있는 Web Beans &#151; 애플리케이션 classpath에 있는 배포 위치를 패키지화할 수 있습니다. 하지만 Web Beans이 있는 각각의 아카이브에는 <literal>META-INF</literal> 또는 <literal>WEB-INF</literal> 디렉토리에 있는 <literal>web-beans.xml</literal>라는 파일이 들어 있어야 합니다. 파일은 비어 있을 수 도 있습니다. <literal>web-beans.xml</literal> 파일이 없는 아카이브에 배포된 Web Beans는 애플리케이션에서 사용할 수 없습니다.
zh_tw: Web Bean 不會定義任何特殊的建置 archive。您可將 Web Bean 封裝在 JARs、EJB-JARs 或是 WARs&#151; 中，應用程式 classpath 中的任何建置位置上。不過，各個包含著 Web Bean 的 archive 在 <literal>META-INF</literal> 或是 <literal>WEB-INF</literal> 目錄中都必須包含著一個稱為 <literal>web-beans.xml</literal> 的檔案。該檔案能是空的。建置於一個沒有 <literal>web-beans.xml</literal> 檔案的 archive 中的 Web Bean 將無法使用於應用程式中。

source: For Java SE execution, Web Beans may be deployed in any location in which EJBs may be deployed for execution by the embeddable EJB Lite container. Again, each location must contain a <literal>web-beans.xml</literal> file.
de_de: Für die Java SE Ausführung können Web Beans an einem beliebigen Speicherort deployt werden, in welchem EJBs zur Ausführung durch den einbettbaren EJB Lite Container deployt werden können. Auch hier muss jeder Speicherort eine <literal>web-beans.xml</literal>-Datei enthalten.
es_es: Para ejecución Java SE, los Web Beans pueden ser desplegados en cualquier lugar en el que los EJB se puedan implementar para ejecución por el contenedor Lite EJB incorporable. De nuevo, cada lugar debe contener un archivo <literal>web-beans.xml</literal>.
fr_fr: Pour une exécution Java SE, les Web Beans peuvent être déployés dans tout emplacement dans lequel des EJBs peuvent être déployés pour exécution par le conteneur d'EJB lite. De nouveau, chaque emplacement doit contenir un fichier <literal>web-beans.xml</literal>.
ja_jp: Java SEでの実行においては、Web Beansはどのような場所でもデプロイされるでしょう。また、EJBは実行のために組み込み軽量EJBコンテナによってデプロイされるかもしれません。繰り返しますが、デプロイ場所では<literal>web-beans.xml</literal>ファイルを含む必要があります。
ko_kr: Java SE 실행의 경우, 임베드 가능한 EJB Lite 컨테이너에 의해 실행용 EJB를 배포할 수 있는 위치에 Web Beans를 배포할 수 있습니다. 각 위치에서는 <literal>web-beans.xml</literal> 파일이 들어 있어야 합니다.
pt_br: Para execução em ambiente Java SE, Web Beans podem ser implantados em qualquer localização em que EJBs possam ser implantados para execução pelo container EJB Lite embutido (embeddable EJB Lite container). Novamente, cada localização deve conter o arquivo <literal>web-beans.xml</literal>.
zh_cn: 对于Java SE，Web Beans可以被部署在由嵌入式EJB轻量容器支持的EJB中的任何位置。同样，该位置必须包含 <literal>web-beans.xml</literal> 配置文件。
zh_tw: 對於 Java SE 的執行來說，Web Bean 可被建置於任何位置上，同時 EJB 亦可被建置來讓可崁入的 EJB Lite container 執行。再次強調，各個位置都必須包含著一個 <literal>web-beans.xml</literal> 檔案。

source: Web Beans doesn't define any special deployment archive. You can package Web Beans in JARs, EJB-JARs or WARs &#151; any deployment location in the application classpath. However, each archive that contains Web Beans must include a file named <literal>web-beans.xml</literal> in the <literal>META-INF</literal> or <literal>WEB-INF</literal> directory. The file may be empty. Web Beans deployed in archives that do not have a <literal>web-beans.xml</literal> file will not be available for use in the application.
de_de: Web Beans definiert kein spezielles Deployment-Archiv. Sie können Web Beans in JARs, EJB-JARs oder WARs &#151; verpacken, jedem Deployment Speicherort im Klassenpfad der Anwendung. Allerdings muss jedes Web Beans enthaltene Archiv eine Datei namens <literal>web-beans.xml</literal> im <literal>META-INF</literal> oder <literal>WEB-INF</literal>-Verzeichnis enthalten. Die Datei kann leer sein. Web Beans die in Archiven deployt werden, die keine <literal>web-beans.xml</literal>-Datei enthalten, sind nicht für die Verwendung in der Anwendung verfügbar.
fr_fr: Les Web Beans ne définissent aucune archive spéciale pour le déploiement. Vous pouvez paqueter des Web Beans dans des JARs, des EJB-JARs ou des WARs : tout emplacement de déploiement dans le classpath de l'application. Cependant, chaque archive contenant des Web Beans doit contenir un fichier nommé <literal>web-beans.xml</literal> dans le dossier <literal>META-INF</literal> ou <literal>WEB-INF</literal>. Le fichier peut être vide. Les Web Beans déployés dans des archives n'ayant pas de fichier <literal>web-beans.xml</literal> ne seront pas disponibles pour utilisation dans l'application.
ja_jp: Web Beansはどのような特別なデプロイのアーカイブも定義しません。アプリケーションのクラスパスにおいてデプロイの場所である、JAR、EJB-JARまたはWARの中にWeb Beansをパッケージできます。しかしながら、Web Beansを含む各アーカイブは、<literal>META-INF</literal>か<literal>WEB-INF</literal>ディレクトリに<literal>web-beans.xml</literal>というファイルを含む必要があります。そのファイルは空でもよいです。<literal>web-beans.xml</literal>ファイルを持たないアーカイブでデプロイされたWeb Beansは、アプリケーションで利用できないでしょう。
pt_br: A Web Beans não define nenhum tipo especial de pacote de implantação. Você pode empacotar Web Beans em JARs, EJB-JARs ou WARs &#151; qualquer localização de implantação do classpath da aplicação. Entretanto, cada arquivo ( JARs, EJB-JARs ou WARs) que contém Web Beans deve incluir um arquivo chamado <literal>web-beans.xml</literal> no diretório <literal>META-INF</literal> ou no diretório <literal>WEB-INF</literal>. O arquivo pode ser vazio. Os Web Beans implantados em pacotes que não possuem o arquivo <literal>web-beans.xml</literal> não estarão disponíveis para uso na aplicação.
zh_cn: Web Beans并没有指定特殊的部署包。你可以以JAR, EJB-JAR或者WAR&#151;形式将Web Beans打包在任何应用类路径中的部署位置上。然而，每个包含Web Beans的包必须在<literal>META-INF</literal> 或者 <literal>WEB-INF</literal>目录下包含一个名为 <literal>web-beans.xml</literal>的配置文件。这个文件可以是空的。没有<literal>web-beans.xml</literal> 配置文件，应用将无法使用Web Beans。
