Repository: 1tchy/core
Catalog: reference/*/ee.po
Languages: de_de, es_es, fr_fr, ja_jp, ko_kr, pt_br, zh_cn, zh_tw

source: Java EE integration
es_es: Integración Java EE
fr_fr: Intégration dans Java EE
ja_jp: Java EEへの統合
ko_kr: Java EE 통합
pt_br: Integração com o Java EE
zh_cn: Java EE整合
zh_tw: Java EE 整合

source: Web Beans is fully integrated into the Java EE environment. Web Beans have access to Java EE resources and JPA persistence contexts. They may be used in Unified EL expressions in JSF and JSP pages. They may even be injected into some objects, such as Servlets and Message-Driven Beans, which are not Web Beans.
de_de: Web Beans sind voll in die Java EE Umgebung integriert. Web Beans besitzen Zugriff auf Java EE Resourcen und JPA Persistenzkontexte. Sie können in Unified EL Ausdrücken in JSF- und JSP-Seiten verwendet werden. Sie können sogar in einige Objekte eingespeist werden, etwa Servlets and Message-Driven Beans, die keine Web Beans sind.
es_es: Los Web Beans están totalmente integrados en un entorno de Java EE. Los Web Beans tienen acceso a recursos de Java EE y a contextos persistentes de JSF. Ellos pueden ser utilizados en expresiones Unificadas EL en páginas JSF y JSP. Pueden ser inyectados en algunos objetos, tales como Servlets y Message Driven Beans, los cuales no son Web Beans.
fr_fr: Les Web Beans sont totalement intégrés dans l'environnement Java EE. Les Web Beans ont accès aux ressources Java EE et aux contextes de persistance JPA. Ils peuvent être utilisés dans des expressions Unified EL dans des pages JSF et JSP. Ils peuvent même être injectés dans des certains objets, tels que les Servlets et les Message-Driven Beans, qui ne sont pas des Web Beans.
ja_jp: Web BeansはJava EE 環境と完全に統合されます。Web Beansは、Java EEリソースとJPAの永続コンテキストに自由にアクセスできます。それらはJSFとJSPページ中のUnifed ELで使用されるかもしれません。それらはWeb Beansではない、サーブレットやメッセージ駆動型Beanなどのオブジェクトにインジェクトされるかもしれません。
ko_kr: Web Beans는 Java EE 환경으로 완전 통합됩니다. Web Beans는 Java EE 리소스 및 JPA 지속성 컨텍스트로 액세스합니다. 이는 JSF 및 JSP 페이지에서 Unified EL 표현식으로 사용될 수 있습니다. 이는 Web Beans가 아닌 Servlets 및 Message-Driven Beans와 같은 일부 객체로 삽입될 수 도 있습니다.
pt_br: A Web Beans está plenamente integrada ao ambiente Java EE. A Web Beans tem acesso aos recursos Java EE e aos contextos de persistência JPA. Eles podem ser utilizados em expressões EL Unificadas (Unified EL) e em páginas JSF e JSP. Podem até ser injetados em objetos que não são Web Benas, tais como Servlets e Message-Driven Beans.
zh_cn: Web Beans被完全地整合进了Java EE环境里。Web Beans 能够访问Java EE资源和JPA持久化上下文。它们可以在JSF和JSP页面中的统一表达式语言使用。它们甚至可以被注入到一些对象中，例如Servlet和消息驱动Bean，而这些对象都不是Web Bean。
zh_tw: Web Bean 已完整整合入 Java EE 環境中。Web Bean 可存取 Java EE 資源以及 JPA persistence context。它們可能會被使用於 JSF 以及 JSP 網頁中的 Unified EL 表示式中。它們也可被注入一些物件中，例如 Servlets 以及訊息導向的 Bean 中（非 Web Beans）。

source: Injecting Java EE resources into a Web Bean
de_de: Einspeisung von Java EE Ressourcen in ein Web Bean
es_es: Inyección de recursos de Java EE en un Web Bean
fr_fr: Injecter des ressources Java EE dans un Web Bean
ja_jp: Java EEリソースをWeb Beansにインジェクトする
ko_kr: Java EE 리소스를 Web Bean으로 삽입
pt_br: Injetando recursos Java EE em um Web Bean
zh_cn: 将Java EE资源注入到一个Web Bean中
zh_tw: 將 Java EE 資源注入 Web Bean 中

source: All simple and enterprise Web Beans may take advantage of Java EE dependency injection using <literal>@Resource</literal>, <literal>@EJB</literal> and <literal>@PersistenceContext</literal>. We've already seen a couple of examples of this, though we didn't pay much attention at the time:
de_de: Alle einfachen wie auch Enterprise Web Beans können die Java EE "Dependency"-Einspeisung mittels <literal>@Resource</literal>, <literal>@EJB</literal> und <literal>@PersistenceContext</literal> verwenden. Wir haben bereits einige Beispiele hierfür gesehen, obwohl wir diesen zum damaligen Zeitpunkt nicht viel Beachtung geschenkt haben:
es_es: Todos los Web Beans sencillos y de empresa pueden aprovechar la inyección de dependencia de Java EE utilizando<literal>@Resource</literal>, <literal>@EJB</literal> y <literal>@PersistenceContext</literal>. Ya hemos visto algunos ejemplos de esto, aunque no prestamos mucha atención en el momento.
fr_fr: Tous les Web Beans, qu'ils soient simples ou d'entreprise peuvent bénéficier de l'injection de dépendance de Java EE en utilisant <literal>@Resource</literal>; <literal>@EJB</literal> et <literal>@PersistenceContext</literal>. Nous avons déjà vu quelques exemples de cela, bien que nous n'y ayons pas fait attention sur le moment:
ja_jp: すべてのシンプル、エンタープライズ Web Beansは、<literal>@Resource</literal>、<literal>@EJB</literal>、および<literal>@PersistenceContext</literal>を使用することでJava EEの依存性注入を利用できます。ここまでは注意を払いませんでしたが、既にいくつかの例を見てきました。
ko_kr: 모든 엔터프라이즈 Web Beans는 <literal>@Resource</literal>, <literal>@EJB</literal>, <literal>@PersistenceContext</literal>를 사용하여 Java EE 의존성 삽입의 장점을 취할 수 있습니다. 이미 이에 대한 몇몇 예를 살펴보았습니다:
pt_br: Todos Web Beans, simples e corporativos (enterprise Web Beans), podem usufruir da injeção de dependência do Java EE utilizando <literal>@Resource</literal>, <literal>@EJB</literal> e <literal>@PersistenceContext</literal>. Nós já vimos vários exemplos disso, embora não demos muita ênfase até o momento:
zh_cn: 所有简单的和企业的Web Beans都可以通过<literal>@Resource</literal>, <literal>@EJB</literal>和<literal>@PersistenceContext</literal>来使用Java EE的依赖注入。我们已经看过很多例子了，虽然我们没有在这上面耗费精力：
zh_tw: 所有基本與企業的 Web Bean 都能透過 <literal>@Resource</literal>、<literal>@EJB</literal> 以及 <literal>@PersistenceContext</literal> 來有效利用 Java EE 相依性注入。我們早已見過了這方面的範例，不過當時我們並未詳細討論到：

source: The Java EE <literal>@PostConstruct</literal> and <literal>@PreDestroy</literal> callbacks are also supported for all simple and enterprise Web Beans. The <literal>@PostConstruct</literal> method is called after <emphasis>all</emphasis> injection has been performed.
de_de: Die Java EE <literal>@PostConstruct</literal> und <literal>@PreDestroy</literal> Callbacks werden ebenfalls für alle einfachen wie auch Enterprise Web Beans unterstützt. Die <literal>@PostConstruct</literal>-Methode wird nach Durchführung <emphasis>aller</emphasis> Einspeisungen aufgerufen.
es_es: Los <literal>@PostConstruct</literal> de Java EE y las llamadas de <literal>@PreDestroy</literal> también son soportados por todos los Web Beans sencillos y empresariales. El método <literal>@PostConstruct</literal> es llamado después de realizar <emphasis>toda</emphasis> la inyección.
fr_fr: Les rappels de Java EE <literal>@PostContruct</literal> et <literal>@PreDestroy</literal> sont également supportés pour tous les Web Beans, simples ou d'entreprise. La méthode <literal>@PostConstruct</literal> est appelée après que <emphasis>toute</emphasis> injection ait été effectuée.
ja_jp: Java EEの<literal>@PostConstruct</literal>と<literal>@PreDestroy</literal>によるコールバックは、すべのシンプル、エンタープライズ Web Beansでサポートされます。 <emphasis>すべて</emphasis> のインジェクションが実行された後に、<literal>@PostConstruct</literal>のメソッドは呼ばれます。
ko_kr: Java EE <literal>@PostConstruct</literal> 및 <literal>@PreDestroy</literal> 콜백은 모든 엔터프라이즈 Web Beans에 대해 지원됩니다. <emphasis>모든</emphasis> 삽입이 실행된 후 <literal>@PostConstruct</literal> 방식이 호출됩니다.
pt_br: As chamadas Java EE <literal>@PostConstruct</literal> e <literal>@PreDestroy</literal> também são suportadas para todos os Web Beans simples e corporativos. O método anotado com <literal>@PostConstruct</literal> é invocado após <emphasis>todas</emphasis> injeções serem realizadas.
zh_cn: 所有的简单的和企业的Web Beans都支持Java EE的<literal>@PostConstruct</literal>和<literal>@PreDestroy</literal>回调。<literal>@PostConstruct</literal>方法在<emphasis>所有的</emphasis> 注入完成后被调用。
zh_tw: 所有基本與企業的 Web Bean 也都支援 Java EE <literal>@PostConstruct</literal> 和 <literal>@PreDestroy</literal> 的 callback。<literal>@PostConstruct</literal> 這個 method 會在<emphasis>所有</emphasis>注入被進行後才會被調用。

source: There is one restriction to be aware of here: <literal>@PersistenceContext(type=EXTENDED)</literal> is not supported for simple Web Beans.
de_de: Es gilt eine Einschränkung hier: <literal>@PersistenceContext(type=EXTENDED)</literal> wird nicht für einfache Web Beans unterstützt.
es_es: Hay una restricción para tener en cuenta aquí: <literal>@PersistenceContext(tipo=EXTENDIDO)</literal> no es compatible con Web Beans sencillos.
fr_fr: Il y a une restriction dont vous devez être conscient: <literal>@PersistenceContext(type=EXTENDED)</literal> n'est pas supportée pour les Web Beans simples.
ja_jp: ここで注意すべき制限が一つあります。<literal>@PersistenceContext(type=EXTENDED)</literal>はシンプルWeb Beansではサポートされません。
ko_kr: 여기서 유의해야 할 한 가지 제한 사항이 있습니다: <literal>@PersistenceContext(type=EXTENDED)</literal>는 단순한 Web Beans에 대해 지원되지 않습니다.
pt_br: Existe uma restrição de que devemos estar conscientes: <literal>@PersistenceContext(type=EXTENDED)</literal> não é suportada por Web Beans simples.
zh_cn: 这里需要注意的一个限制是：简单的Web Beans不支持 <literal>@PersistenceContext(type=EXTENDED)</literal>
zh_tw: 在此有項需要注意的限制：基本的 Web Bean 並不支援 <literal>@PersistenceContext(type=EXTENDED)</literal>。

source: Calling a Web Bean from a Servlet
de_de: Aufruf eines Web Bean von einem Servlet
es_es: LLamando a Web Bean desde un Servlet
fr_fr: Appeler un Web Bean à partir d'un Servlet
ja_jp: サーブレットからWeb Beanを呼び出す
ko_kr: Servlet에서 Web Bean 호출
pt_br: Invocando um Web Bean a partir de um Servlet
zh_cn: 从Servlet调用一个Web Bean
zh_tw: 透過一個 Servlet 來調用 Web Bean

source: It's easy to use a Web Bean from a Servlet in Java EE 6. Simply inject the Web Bean using Web Beans field or initializer method injection.
de_de: In Java EE 6 ist die Verwendung eines Web Beans von einem Servlet ganz einfach. Speisen Sie einfach das Web Bean mittels Web Beans Field oder Initialisierungsmethodeneinspeisung (sog. "Initializer Method Injection") ein.
es_es: Resulta fácil utilizar un Web Bean desde un Servlet en Java EE 6. Simplemente inyecte el Web Bean mediante campo de Web Beans o Inyección de método inicializador.
fr_fr: Il est facile d'utiliser un Web Bean à partir d'une Servlet dans Java EE 6. Injectez simplement le Web Bean en utilisant les méthodes d'injection de champs ou de méthode d'initialisation.
ja_jp: Java EE 6でサーブレットからWeb Beanを使用することは簡単です。フィールドか初期化メソッドによるインジェクションを使用して、Web Beansをインジェクトしてください。
ko_kr: Java EE 6에 있는 Servlet에서 Web Bean을 사용하기가 쉽습니다. Web Beans 영역 또는 초기화 방식 삽입을 사용하여 Web Bean을 삽입합니다.
pt_br: É fácil utilizar um Web Bean a partir de um Servlet em Java EE : basta injetar o Web Bean usando a injeção de atributos ou de método de inicialização de Web Beans.
zh_cn: 在Java EE 6中，从一个Servlet中调用一个Web Bean非常容易，只须使用Web Beans域注入一个Web Bean或者将初始方法注入即可。
zh_tw: 在 Java EE 6 中透過 Servlet 來使用 Web Bean 相當地簡單。只要使用 Web Bean 欄位或是 initializer method 注入來注入 Web Bean 即可。

source: The Web Beans client proxy takes care of routing method invocations from the Servlet to the correct instances of <literal>Credentials</literal> and <literal>Login</literal> for the current request and HTTP session.
de_de: Der Web Beans Client Proxy kümmert sich um Aufrufe der Routing-Methode vom Servlet, um die Instanzen von <literal>Credentials</literal> und <literal>Login</literal> für die aktuelle Anfrage und HTTP-Session zu korrigieren.
es_es: El cliente proxy de Web Beans cuida las invocaciones del método de enrutamiento desde el Servlet a las instancias correctas de <literal>Credentiales</literal> e <literal>Inicio de sesión</literal> para la solicitud actual y sesión HTTP.
fr_fr: Le client proxy Web Beans s'occupe du routage d'invocations de méthodes de la Servlet vers les bonnesi instances de <literal>Credentials</literal> et <literal>Login</literal> pour la requête courante et la session HTTP.
ja_jp: Web Beansのクライアントプロキシは、現在のリクエストとHTTPセッションの間、サーブレットから正しい<literal>Credentials</literal>と<literal>Login</literal>インスタンスへの呼び出しを引き受けます。
ko_kr: Web Beans 클라이언트 프록시는 Servlet에서 현재 요청 및 메소드 HTTP 세션의 올바른 <literal>Credentials</literal> 및 <literal>Login</literal> 인스턴스로 호출을 라우팅을 처리합니다.
pt_br: O proxy cliente do Web Bean (Web Beans client proxy) cuida do encaminhamento das invocações dos métodos do Servlet para as instâncias corretas de <literal>Credentials</literal> e <literal>Login</literal> para a requisição e sessão HTTP atuais.
zh_cn: Web Beans客户端代理将Servlet中的方法调用路由到当前请求和HTTP会话中相应的<literal>Credentials</literal> 和 <literal>Login</literal> 实例。

source: Calling a Web Bean from a Message-Driven Bean
de_de: Aufruf eines Web Beans von einem Message-Driven Bean
es_es: Llamada a un Web Bean desde un Message-Driven Bean
fr_fr: Appeler un Web Bean à partir d'un Message-Driven Bean
ja_jp: Web Beanからメッセージ駆動型Beanを呼び出す
ko_kr: Message-Driven Bean에서 Web Bean 호출
pt_br: Invocando um Web Bean de um Message-Driven Bean
zh_cn: 从消息驱动Bean中调用一个Web Bean
zh_tw: 透過訊息導向的 Bean 來調用 Web Bean

source: Web Beans injection applies to all EJBs, even when they aren't under the control of the Web Bean manager (if they were obtained by direct JNDI lookup, or injection using <literal>@EJB</literal>, for example. In particular, you can use Web Beans injection in Message-Driven Beans, which are not considered Web Beans because you can't inject them.
de_de: Einspeisung von Web Beans gilt für alle EJBs, selbst wenn sie nicht der Steuerung des Web Bean Manager s unterliegen (wenn sie etwa durch direkten JNDI-Lookup oder Einspeisung mittels <literal>@EJB</literal> erworben wurden). Insbesondere Web Beans Einspeisung in Message-Driven Beans, die nicht als Web Beans angesehen werden, da sie nicht eingespeist werden können.
es_es: La inyección de Web Beans se aplica a todos los EJB, incluso cuando no están bajo el control del administrador de Web Bean (si fueron obtenidos por el JNDI o inyección utilizando <literal>@EJB</literal>, por ejemplo. En particular, se puede utilizar inyección de Web Beans en Message-Driven Beans, los cuales no son considerados Web Beans porque usted no puede inyectarlos.
fr_fr: L'injection de Web Beans s'applique à tous les EJBs, même ceux qui ne sont pas sous le contrôle du gestionnaire de Web Beans (s'ils ont été obtenus par une résolution direct par JNDI, ou par injection utilisant <literal>@EJB</literal>, par exemple). En particulier, vous pouvez utiliser l'injection de Web Beans dans des Message-Driven Beans, qui ne sont pas considérés comme des Web Beans car vous ne pouvez pas les injecter.
ja_jp: Web BeansのインジェクションはすべてのEJBに適用されます。EJBがWeb Beanマネージャの管理下にない場合でさえもです(たとえば、直接のJNDIルックアップ、または<literal>@EJB</literal>を使用したインジェクションで得た場合)。特に、メッセージ駆動型Bean(インジェクトできないため、Web Beansであることは考えられていないもの)でWeb Beansのインジェクションを使用できます。
ko_kr: Web Beans 삽입은 모든 EJB에 적용되며, Web Bean 관리자 제어 하에 있지 않을 경우에도 (예들 들어, JNDI lookup에 의해 획득되었거나 <literal>@EJB</literal>를 사용하여 삽입되었을 경우) 적용됩니다. 특히, Message-Driven Beans에서 Web Beans 삽입을 사용할 수 있으며, 이를 삽입할 수 없기 때문에 이는 Web Beans를 고려하지 않습니다.
pt_br: Injeção de Web Beans aplica-se a todos EJBs, mesmo quando esses não estão sob o controle do gerenciador do Web Bean (se tiverem sido obtidos por busca direta no JNDI, ou por injeção utilizando <literal>@EJB</literal>, por exemplo). Em particular, você pode usar a injeção de Web Beans em Message-Driven Beans, que não são considerados Web Beans porque você não pode injetá-los.
zh_cn: Web Beans注入可以应用于所有的EJB，甚至这些EJB不在Web Bean管理器的控制之下也可以（如果它们可以直接从JNDI查找或者使用<literal>@EJB</literal>注入）。消息驱动Bean不能成为Web Beans，因为你无法注入它们，但你仍然可以将Web Beans注入到消息驱动Bean中。
zh_tw: Web Bean 注入適用於所有 EJB，儘管它們不是由 Web Bean 管理員所控制（比方說若它們是透過直接的 JNDI 搜尋或是透過使用 <literal>@EJB</literal> 來被取得的情況下）。特別是，您可在訊息導向的 Bean 中使用 Web Bean 注入，不過這些 Bean 並不被視為是 Web Bean 因為您無法注入它們。

source: You can even use Web Beans interceptor bindings for Message-Driven Beans.
de_de: Sie können sogar Web Beans Interzeptor-Bindings für Message-Driven Beans.
es_es: Se pueden incluso utilizar enlaces de interceptor de Web Beans para Message-Driven Beans.
fr_fr: Vous pouvez même utiliser des liaisons d'intercepteurs de Web Beans avec des Message-Driven Beans.
ja_jp: メッセージ駆動型BeanにWeb Beansのインタセプタを使用することさえできます。
ko_kr: Message-Driven Beans에 대한 Web Beans 인터셉터 바인딩을 사용할 수 있습니다.
pt_br: Você ainda pode usar bindings de interceptadores Web Beans em Message-Driven Beans.
zh_cn: 你甚至可以将Web Beans拦截器绑定到消息驱动Bean上。
zh_tw: 針對於訊息導向的 Bean，您甚至可使用 Web Bean 攔截器綁定。

source: Thus, receiving messages is super-easy in a Web Beans environment. But beware that there is no session or conversation context available when a message is delivered to a Message-Driven Bean. Only <literal>@RequestScoped</literal> and <literal>@ApplicationScoped</literal> Web Beans are available.
de_de: Daher ist der Empfang von Nachrichten in einer Web Beans Umgebung sehr einfach. Seien Sie sich aber dessen bewusst, dass bei Lieferung einer Nachricht an ein Message-Driven Bean keine Session oder Konversationskontext verfügbar ist. Es sind nur <literal>@RequestScoped</literal> und <literal>@ApplicationScoped</literal> Web Beans verfügbar.
es_es: Así, la recepción de mensajes es superfácil en un entorno de Web Beans. No obstante, tenga en cuenta que no hay sesión o contexto de conversación disponible cuando se envía un mensaje a un Message-Driven Bean. Sólo los Web Beans <literal>@RequestScoped</literal> y <literal>@ApplicationScoped</literal> Web Beans están disponibles.
fr_fr: Donc, recevoir des messages est très facile dans un environnement Web Beans. Mais faites attention, il n'y a pas de session ni de contexte de conversation disponible lorsqu'un message est délivré à un Message-Driven Bean. Seuls les Web Beans <literal>@RequestScoped</literal> et <literal>@ApplicationScoped</literal> sont disponibles.
ja_jp: このように、メッセージを受け取ることはWeb Beans環境ではとても簡単です。しかし、メッセージがメッセージ駆動型Beanに配信されるときに、利用可能なセッションコンテキストも対話コンテキストも存在しないことに注意してください。<literal>@RequestScoped</literal>と<literal>@ApplicationScoped</literal>のWeb Beansだけが利用可能です。
ko_kr: 따라서, Web Beans 환경에서 메세지를 받는 것은 초간편합니다. 하지만 메세지가 Message-Driven Bean으로 전달될 때 사용할 수 있는 세션 또는 대화 컨텍스트가 없음에 유의하시기 바랍니다. <literal>@RequestScoped</literal> 및 <literal>@ApplicationScoped</literal> Web Beans 만을 사용할 수 있습니다.
pt_br: Assim, receber mensagens é super fácil no ambiente Web Beans. Mas, cuidado, pois não existe um contexto de sessão ou conversação disponível quando uma mensagem é entregue a um Message-Driven Bean. Apenas <literal>@RequestScoped</literal> e <literal>@ApplicationScoped</literal> Web Beans estão disponíveis.
zh_cn: 这样，在一个Web Beans环境中接受消息就相当简单了。但是需要注意的是，当一个消息发送到一个消息驱动Bean的时候，此时没有会话，我们无法获得对话上下文。我们只能获得 <literal>@RequestScoped</literal> 和 <literal>@ApplicationScoped</literal> 注释的Web Beans。
zh_tw: 因此，在 Web Bean 環境下，取得訊息是相當地簡單的。不過請注意，當訊息提交至一個訊息導向的 Bean 時，不會有可用的 session 或是對話 context。只有 <literal>@RequestScoped</literal> 和 <literal>@ApplicationScoped</literal> Web Bean 可使用。

source: It's also easy to send messages using Web Beans.
de_de: Es ist ebenfalls ganz einfach mittels Web Beans Nachrichten zu versenden.
es_es: También es fácil enviar mensajes mediante Web Beans.
fr_fr: Il est également facile d'envoyer des messages en utilisant des Web Beans.
ja_jp: また、Web Beansを使用してメッセージを送ることも簡単です。
ko_kr: 또한 Web Beans를 사용하여 메세지를 전송하기 쉽습니다.
pt_br: Também é fácil enviar mensagens usando Web Beans.
zh_cn: 使用Web Beans发送消息也相当简单。
zh_tw: 透過使用 Web Bean 來傳送訊息也相當地簡單。

source: JMS endpoints
de_de: JMS Endpunkte
es_es: endpoints JMS
fr_fr: Terminaisons JMS
ja_jp: JMSエンドポイント
ko_kr: JMS 엔드포인트
pt_br: Endpoints JMS
zh_cn: JMS端点
zh_tw: JMS 端點
