Repository: 1tchy/core
Catalog: reference/*/environments.po
Languages: it_it

source: Application Servers and environments supported by Web Beans
it_it: Application Server ed ambienti supportati da Web Beans

source: Using Web Beans with JBoss AS
it_it: Usare Web Beans con JBoss AS

source: No special configuration of your application, beyond adding either <literal>META-INF/beans.xml</literal> or <literal>WEB-INF/beans.xml</literal> is needed.
it_it: Non occorre alcuna configurazione speciale dell'applicazione oltre all'aggiunta di <literal>META-INF/beans.xml</literal> o <literal>WEB-INF/beans.xml</literal>.

source: If you are using JBoss AS 5.0.1.GA then you'll need to install Web Beans as an extra. First we need to tell Web Beans where JBoss is located. Edit <literal>jboss-as/build.properties</literal> and set the <literal>jboss.home</literal> property. For example:
it_it: Se si usa JBoss AS 5.0.1.GA allora occorre installare Web Beans come extra. Innanzitutto occorre dire a Web Beans dove si trova JBoss. Modificare <literal>jboss-as/build.properties</literal> ed impostare la proprietà <literal>jboss.home</literal>. Per esempio:

source: Now we can install Web Beans:
it_it: Ora installiamo Web Beans:

source: A new deployer, <literal>webbeans.deployer</literal> is added to JBoss AS. This adds supports for JSR-299 deployments to JBoss AS, and allows Web Beans to query the EJB3 container and discover which EJBs are installed in your application.
it_it: Un nuovo deploer - <literal>webbeans.deployer</literal> - viene aggiunto a JBoss AS. Questo aggiunge a JBoss AS il supporto ai deploy JSR-299, e consente a Web Beans di interrogare il container EJB3 per scoprire quali EJB sono installati nell'applicazione.

source: Web Beans is built into all releases of JBoss AS from 5.1 onwards.
it_it: Web Beans è incluso in tutte le release di JBoss AS da 5.1 in avanti.

source: TODO
it_it: DA FARE

source: Servlet Containers (such as Tomcat or Jetty)
it_it: Servlet Container (come Tomcat o Jetty)

source: Web Beans can be used in any Servlet container such as Tomcat 6.0 or Jetty 6.1.
it_it: Web Beans può essere usato in ogni Servlet container come Tomcat 6.0 o Jetty 6.1.

source: Web Beans doesn't support deploying session beans, injection using <literal>@EJB</literal>, or <literal>@PersistenceContext</literal> or using transactional events in Servlet containers.
it_it: Web Beans non supporta il deploy di session bean, l'injection usando <literal>@EJB</literal>, o <literal>@PersistenceContext</literal> o l'uso di eventi transazionali nei Servlet container.

source: Web Beans should be used as a web application library in a servlet container. You should place <literal>webbeans-servlet.jar</literal> in <literal>WEB-INF/lib</literal>. <literal>webbeans-servlet.jar</literal> is an "uber-jar" provided for your convenience. Alternatively, you could use its component jars:
it_it: Web Beans dovrebbe essere usata come libreria per web application in un servlet container. Si dovrebbe mettere <literal>webbeans-servlet.jar</literal> in <literal>WEB-INF/lib</literal>. <literal>webbeans-servlet.jar</literal> è un "sovra-jar" fornito per comodità. Invece, è possibile usare i suoi jar componenti:

source: You also need to explicitly specify the servlet listener (used to boot Web Beans, and control its interaction with requests) in <literal>web.xml</literal>:
it_it: Occorre esplicitamente specificare il servlet listener (usato per avviare Web Beans, e controllare la sua interazione con le richieste) in <literal>web.xml</literal>:

source: Tomcat has a read-only JNDI, so Web Beans can't automatically bind the Manager. To bind the Manager into JNDI, you should populate <literal>META-INF/context.xml</literal> with the following contents:
it_it: Tomcat ha un JNDI read-only, e quindi Web Beans non può automaticamente associare il Manager. Per associare il Manager a JNDI occorre popolare <literal>META-INF/context.xml</literal> con i seguenti contesti:

source: and make it available to your deployment by adding this to the bottom of <literal>web.xml</literal>:
it_it: e renderlo disponibile nel proprio deploy aggiungendo questo in fondo a <literal>web.xml</literal>:

source: Tomcat only allows you to bind entries to <literal>java:comp/env</literal>, so the Manager will be available at <literal>java:comp/env/app/Manager</literal>
it_it: Tomcat consente solo di associare le entry a <literal>java:comp/env</literal>, e quindi il Manager sarà disponibile in <literal>java:comp/env/app/Manager</literal>

source: Web Beans also supports Servlet injection in Tomcat. To enable this, place the <literal>webbeans-tomcat-support.jar</literal> in <literal>$TOMCAT_HOME/lib</literal>, and add the following to your <literal>META-INF/context.xml</literal>:
it_it: Web Beans supporta anche l'iniezione dei servlet in Tomcat. Per abilitarla, collocare <literal>webbeans-tomcat-support.jar</literal> in <literal>$TOMCAT_HOME/lib</literal>, ed aggiungere il seguente codice a <literal>META-INF/context.xml</literal>:

source: Like Tomcat, Jetty has a read-only JNDI, so Web Beans can't automatically bind the Manager. To bind the Manager to JNDI, you should populate <literal>WEB-INF/jetty-env.xml</literal> with the following contents:
it_it: Come Tomcat, Jetty ha un JNDI read-only, e quindi Web Beans non può automaticamente associare il Manager. Per associare il Manager a JNDI occorre popolare <literal>META-INF/jetty-env.xml</literal> con i seguenti contesti:

source: Notice that Jetty doesn't not have built-in support for an <literal>javax.naming.spi.ObjectFactory</literal> like Tomcat, so it's necessary to manually create the <literal>javax.naming.Reference</literal> to wrap around it.
it_it: Si noti che Jetty non ha un supporto predefinito per <literal>javax.naming.spi.ObjectFactory</literal> come Tomcat, quindi è necessario creare manualmente il <literal>javax.naming.Reference</literal> con cui fare il wrap.

source: Jetty only allows you to bind entries to <literal>java:comp/env</literal>, so the Manager will be available at <literal>java:comp/env/app/Manager</literal>
it_it: Jetty consente solo di associare le entry a <literal>java:comp/env</literal>, e quindi il Manager sarà disponibile in <literal>java:comp/env/app/Manager</literal>

source: Web Beans does not currently support Servlet injection in Jetty.
it_it: Web Beans non supporta attualmente l'injection dei servlet in Jetty.

source: Apart from improved integration of the Enterprise Java stack, Web Beans also provides a state of the art typesafe, stateful dependency injection framework. This is useful in a wide range of application types, enterprise or otherwise. To facilitate this, Web Beans provides a simple means for executing in the Java Standard Edition environment independently of any Enterprise Edition features.
it_it: Oltre alla migliorata integrazione dello stack Java Enterprise, Web Beans fornisce anche uno stato dell'arte typesafe, con dependency injection stateful . Questo è utile in un ampio raggio di applicazioni tipo, enterprise o altre. Per facilitare ciò, Web Beans fornisce semplici mezzi per eseguire in ambiente Java Standard Edition indipendentemente da qualsiasi caratteristica Enterprise Edition.

source: When executing in the SE environment the following features of Web Beans are available:
it_it: Eseguendo in ambiente SE sono disponibili le seguenti caratteristiche di Web Beans:

source: Simple Web Beans (POJOs)
it_it: Semplice Web Beans (POJOs)

source: Typesafe Dependency Injection
it_it: Iniezioni di dipendenza typesafe

source: Application and Dependent Contexts
it_it: Applicazione e contesti dipendenti

source: Binding Types
it_it: Tipi di binding

source: Deployment Types
it_it: Tipi di deploy

source: Stereotypes
it_it: Stereotipi

source: Typesafe Event Model
it_it: Modello a eventi typesafe

source: Web Beans SE Module
it_it: Module Web Beans SE

source: To make life easy for developers Web Beans provides a special module with a main method which will boot the Web Beans manager, automatically registering all simple Web Beans found on the classpath. This eliminates the need for application developers to write any bootstrapping code. The entry point for a Web Beans SE applications is a simple Web Bean which observes the standard <literal>@Deployed Manager</literal> event. The command line paramters can be injected using either of the following:
it_it: Per semplificare la vita agli sviluppatori Web Beans fornisce un modulo speciale con un metodo main che avvia il manager Web Beans, registrando automaticamente tutti i Web BEans semplici trovati nel classpath. Questo elimina il bisogno da parte degli sviluppatori di scrivere codice per il bootstrap. L'entry point per le applicazioni Web Beans SE è un semplice Web Bean che osserva l'evento standard <literal>@Deployed Manager</literal>. I parametri da linea di comando possono essere iniettati usando una delle seguenti:

source: Here's an example of a simple Web Beans SE application:
it_it: Ecco un esempio di una semplice applicazione Web Beans SE:

source: Web Beans SE applications are started by running the following main method.
it_it: Le applicazioni Web Beans SE vengono avviate eseguendo il seguente metodo main.

source: If you need to do any custom initialization of the Web Beans manager, for example registering custom contexts or initializing resources for your beans you can do so in response to the <literal>@Initialized Manager</literal> event. The following example registers a custom context:
it_it: Se occorre fare una qualsiasi inizializzazione personalizzata del manager Web Beans, per esempio registrando i contesti personalizzati o inizializzando le risorse dei bean, si può fare questo in risposta all'evento <literal>@Initialized Manager</literal>. Il seguente esempio registra un contesto personalizzato:

source: The command line parameters do not become available for injection until the <literal>@Deployed Manager</literal> event is fired. If you need access to the parameters during initialization you can do so via the <literal>public static String getParameters()</literal> method in <literal>StartMain</literal>.
it_it: I parametri da linea di comando non sono disponibili per l'injection fino a che non viene lanciato l'evento <literal>@Deployed Manager</literal>. Se serve l'accesso ai parametri durante l'inizializzazione si può averlo tramite il metodo <literal>public static String getParameters()</literal> in <literal>StartMain</literal>.
