Repository: 1tchy/core
Catalog: reference/*/events.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn, zh_tw

source: Events
de_de: Ereignisse
es_es: Eventos
it_it: Eventi
ja_jp: イベント
zh_cn: 事件
zh_tw: 事件（Events）

source: The Web Beans event notification facility allows Web Beans to interact in a totally decoupled manner. Event <emphasis>producers</emphasis> raise events that are then delivered to event <emphasis>observers</emphasis> by the Web Bean manager. This basic schema might sound like the familiar observer/observable pattern, but there are a couple of twists:
de_de: Die Web Beans Ereignisbenachrichtigungs-Facility gestattet es Web Beans auf eine völlig abgekoppelte Weise zu interagieren. Ereignis <emphasis>Producer</emphasis> bringen Ereignisse auf, die dann vom Web Bean Manager an Ereignis <emphasis>Observer</emphasis> geliefert werden. Dieses schlichte Schema klingt zwar etwas nach dem bekannten Observer/observierbar Muster, aber es gibt ein paar Überraschungen:
es_es: La notificación de eventos de Web Beans permite a Web Beans interactuar de una manera completamente disociada. Los <emphasis>productores</emphasis> crean eventos que son enviados luego a <emphasis>observadores</emphasis> de evento por el administrador de Web Beans. Este esquema básico podría sonar como el patrón de observador familiar/observable, pero hay un par de cambios:
it_it: Il sistema di notifica a eventi di Web Beans consente a Web Beans di interagire in maniera totalmente disaccoppiata. I <emphasis>produttori</emphasis> di eventi sollevano eventi che vengono consegnati agli <emphasis>osservatori</emphasis> di eventi tramite il manager Web Bean. Lo schema base può suonare simile al familiare pattern observer/observable, ma ci sono un paio di differenze:
ja_jp: Web Beansのイベント通知機能はWeb Beans同士が完全に疎結合ままで相互作用を可能にします。イベント <emphasis>プロデューサ</emphasis> は、Web Beanマネージャによってイベント <emphasis>オブザーバ</emphasis> へ配送されるイベントを発生します。この基本スキーマはおなじみの observer/observable パターンのように聞こえるかもしれませんが、次のように違いもあります。
zh_cn: Web Beans事件通知机制能够让Web Beans以完全解耦的方式交互。事件<emphasis>产生者(producers)</emphasis>触发事件，然后由Web Bean管理器发送给事件 <emphasis>观察者(observers)</emphasis> 。基本的模式和我们常见的观察者设计模式类似，但也有一些曲解：
zh_tw: Web Bean 事件通知功能能讓 Web Bean 以一個完全 decouple 的方式來進行互動。事件<emphasis>產生器（producers）</emphasis>會產生事件並且之後會被透過 Web Bean 管理員來傳送給事件<emphasis>觀察器（observers）</emphasis>。這個基本的 schema 可能看起來和熟悉的觀察器/可觀察的格式類似，不過卻有幾點不大相同：

source: not only are event producers decoupled from observers; observers are completely decoupled from producers,
de_de: nicht nur sind Ereignis-Producer von Observern abgekoppelt, Observer sind auch komplett von Producern abgekoppelt,
es_es: no solamente los productores de eventos están disociados de los observadores; los observadores están completamente disociados de los productores.
it_it: non solo i produttori di eventi sono disaccoppiati dagli osservatori; gli osservatori sono completamente disaccoppiati dai produttori,
ja_jp: イベントプロデューサはオブザーバから分離されているだけではなく、オブザーバはプロデューサから完全に分離されています。
zh_cn: 不仅是事件产生者和观察者解耦；观察者和产生者也完全解耦，
zh_tw: 不只是事件產生器由觀察器被 decouple；觀察器也完全地由產生器被 decouple 了，

source: observers can specify a combination of "selectors" to narrow the set of event notifications they will receive, and
de_de: Observer können eine Kombination von "Selektoren" festlegen, um den Satz von Ereignisbenachrichtigungen einzugrenzen, die sie erhalten und
es_es: los observadores pueden especificar una combinación de "selectores" para limitar el conjunto de notificaciones de eventos que recibirán y
it_it: gli osservatori possono specificare una combinazione di "selettori" per restringere il set di notifiche di eventi da ricevere, e
ja_jp: オブザーバは "セレクタ"の組み合わせを指定することで、受信するイベント通知の集まりを狭めることが可能です
zh_cn: 观察者可以指定一个"选择器"组合来限定接受的事件通知，并且
zh_tw: 觀察器可指定一組「選擇器（selectors）」的組合來過濾並減少它們所將會收到的事件通知數量，並且

source: observers can be notified immediately, or can specify that delivery of the event should be delayed until the end of the current transaction
de_de: Observer können sofort benachrichtigt werden oder sie können festlegen, dass die Lieferung des Ereignisses bis zum Abschluss der aktuellen Transaktion verschoben wird
es_es: los observadores pueden ser notificados inmediatamente o pueden especificar que la entrega del evento sea retrasada hasta el final de la transacción actual
it_it: gli osservatori possono essere notificati immediatamente, o possono specificare che la consegna degli eventi venga ritardata fino alla fine della transazione conrrente
ja_jp: オブザーバは直ちにに通知を受信するか、あるいは現在のトランザクションの終了を待ってイベント配送を遅延させるように指定することが可能です
zh_cn: 观察者可以即刻被通知，也可以指定只有当前事务结束后再发送事件通知。
zh_tw: 觀察器可即刻地被通知，或是您亦可指定將事件的傳送延遲到目前交易動作（又稱為工作邏輯單元）結束之後

source: Event observers
de_de: Ereignis-Observer
es_es: Observadores de evento
it_it: Osservatori di eventi
ja_jp: イベントオブザーバ
zh_cn: 事件观察者
zh_tw: 事件觀察器（Event observers）

source: An <emphasis>observer method</emphasis> is a method of a Web Bean with a parameter annotated <literal>@Observes</literal>.
de_de: Eine <emphasis>Observer-Methode</emphasis> ist eine Methode eines Web Beans mit einem Parameter, der <literal>@Observes</literal> annotiert ist.
es_es: Un <emphasis>método de observador</emphasis> es un método de un Web Bean con un parámetro anotado <literal>@Observes</literal>.
it_it: Un <emphasis>metodo osservatore</emphasis> è un metodo di un Web Bean con un parametro annotato <literal>@Observes</literal>.
ja_jp: <emphasis>オブザーバメソッド</emphasis> は、 <literal>@Observes</literal> というアノテーションの付いたパラメータを持つWeb Beanのメソッドです。
zh_cn: 一个 <emphasis>观察者方法</emphasis>是一个在Web Bean中的方法，该方法有一个用<literal>@Observes</literal>注释的参数。
zh_tw: <emphasis>observer method</emphasis> 是個 Web Bean 的 method 並有個標記為 <literal>@Observes</literal> 的參數。

source: The annotated parameter is called the <emphasis>event parameter</emphasis>. The type of the event parameter is the observed <emphasis>event type</emphasis>. Observer methods may also specify "selectors", which are just instances of Web Beans binding types. When a binding type is used as an event selector, it is called an <emphasis>event binding type</emphasis>.
de_de: Der annotierte Parameter heißt <emphasis>Ereignisparameter</emphasis>. Der Typ des Ereignisparameter ist der beobachtete <emphasis>Ereignistyp</emphasis>. Observer-Methoden können auch "Selektoren" festlegen, die nur Instanzen von von Web Beans Binding-Typen sind. Wird ein Binding-Typ als Ereignis-Selektor verwendet, so wird dies als <emphasis>Ereignis Binding-Typ</emphasis>.
es_es: El parámetro anotado es llamado el <emphasis>parámetro de evento</emphasis>. El tipo del parámetro de evento es el <emphasis>tipo de evento</emphasis> observado. Los métodos de observador pueden también especificar "selectores", los cuales son sólo instancias de tipos de enlaces de Web Beans. Cuando un tipo de enlace se utiliza como un selector de evento, es llamado un <emphasis>tipo de enlace de evento</emphasis>.
it_it: Il parametro annotato viene chiamato <emphasis>parametro evento</emphasis>. Il tipo di parametro evento è il <emphasis>tipo evento</emphasis> osservato. I metodi osservatori possono anche specificare dei "selettori", che sono solo istanze di tipi di binding di Web Beans. Quando un tipo di binding viene usato come selettore di eventi viene chiamato <emphasis>tipo binding di evento</emphasis>.
ja_jp: このアノテーション付きのパラメータは <emphasis>イベントパラメータ</emphasis> と呼ばれます。イベントパラメータの種類は<emphasis>イベントタイプ</emphasis> で指定されます。オブザーバメソッドは "セレクタ"を指定することもできます。それはWeb Beansバインディングタイプのインスタンスに過ぎません。バインディングタイプがイベントセレクタとして使用されると、それは <emphasis>イベントバインディングタイプ</emphasis> と呼ばれます。
zh_cn: 这个使用注释的参数被称为<emphasis>事件参数</emphasis>。事件参数的类型是被观察的<emphasis>事件类型</emphasis>。观察者方法也可以指定"选择器"，选择器其实就是Web Beans绑定类型的实例。当一个绑定类型作为事件选择器时，它也被称为一个<emphasis>事件绑定类型</emphasis>。
zh_tw: 這個被標記的參數稱為<emphasis>事件參數（event parameter）</emphasis>。這個事件參數的 type 相當於被觀察到的<emphasis>事件類型（event type）</emphasis>。Observer method 也能指定「selector」，它們只不過是 Web Bean 綁定類型（binding types）的 instance。當有個綁定類型被用來作為一個事件選擇器時，它就會被稱為是一個<emphasis>事件綁定類型（event binding type）</emphasis>。

source: We specify the event bindings of the observer method by annotating the event parameter:
de_de: Wir legen die Ereignis-Bindings der Observer-Methode durch Annotation des Ereignisparameters fest:
es_es: Especificamos los enlaces de evento del método de observador al anotar el parámetro de evento:
it_it: Specifichiamo i binding di evento del metodo osservatore annotando il parametro evento:
ja_jp: イベントパラメータにアノテーションを付加することによってオブザーバメソッドのイベントバインディングを指定します。
zh_cn: 我们通过注释事件参数来指定观察者方法的事件绑定。
zh_tw: 我們可藉由標記事件參數來指定 observer method 的事件綁定：

source: An observer method need not specify any event bindings &#151; in this case it is interested in <emphasis>all</emphasis> events of a particular type. If it does specify event bindings, it is only interested in events which also have those event bindings.
de_de: Eine Observer-Methode muss keine Ereignis-Bindings &#151; festlegen, in diesem Fall interessiert sie sich für <emphasis>alle</emphasis> Ereignisse eines bestimmten Typs. Legt sie Ereignis-Bindings fest, so interessiert sie sich nur für Ereignisse, die diese Ereignis-Bindings besitzen.
it_it: Un metodo osservatore non ha bisogno di specificare alcun binding di evento &#151; in questo caso è interessato a <emphasis>tutti</emphasis> gli eventi di un particolare tipo. Se specifica dei binding di evento, è solamente interessato agli eventi che hanno anche gli stessi binding di evento.
ja_jp: オブザーバメソッドはイベントバインディングを指定する必要はありません&#151; このケースでは特定のタイプの <emphasis>すべて</emphasis> のイベントに関心があります。もしイベントバインディングを指定するのであれば、イベントバインディングを持つイベントだけに関心があります。
zh_cn: 一个观察者方法无须指定一个事件绑定 &#151; 在这种情况下，它对一个特定类型的 <emphasis>所有</emphasis> 事件都感兴趣（观察）。如果它没有指定事件绑定，那么它只对那些有事件绑定的事件感兴趣（观察）。

source: The observer method may have additional parameters, which are injected according to the usual Web Beans method parameter injection semantics:
de_de: Die Observer-Methode kann zusätzliche Parameter besitzen, die gemäß der üblichen Einspeisungssemantik Web Beans Methodenparameter eingespeist werden:
es_es: El método de observador puede tener parámetros adicionales, los cuales se inyectan de acuerdo con la semántica de inyección del parámetro usual de método de Web Beans:
it_it: Il metodo osservatore può avere parametri addizionali che vengono iniettati secondo la solita semantica di iniezione del parametro del metodo Web Beans.
ja_jp: オブザーバメソッドは追加のパラメータを持つこともできます。それは通常のWeb Beansメソッドパラメータインジェクションのセマンティクスに従って依存性の注入が行われます。
zh_cn: 观察者方法可以有其他的参数，它们可以按照普通的Web Beans方法参数注入语法注入：
zh_tw: Observer method 能夠含有額外的參數，這些參數會被根據一般的 Web Bean method 參數注入語意（parameter injection semantic）來注入：

source: Event producers
de_de: Ereignis-Producer
es_es: Productores de Evento
it_it: Produttori di eventi
ja_jp: イベントプロデューサ
zh_cn: 事件生产者
zh_tw: 事件產生器（Event producers）

source: The event producer may obtain an <emphasis>event notifier</emphasis> object by injection:
de_de: Der Ereignis-Producer kann ein <emphasis>Ereignisbenachrichtigungs</emphasis>-Objekt durch Einspeisung erhalten:
es_es: El productor de evento puede obtener un objeto que <emphasis>notifica el evento</emphasis>por inyección:
it_it: Il produttore dell'evento può ottenere tramite iniezione un oggetto <emphasis>notificatore d'evento</emphasis>:
ja_jp: イベントプロデューサは次のようにインジェクションによって <emphasis>イベント通知</emphasis> オブジェクトを取得できます。
zh_cn: 事件生产者可以通过注入获得一个 <emphasis>事件通知者</emphasis>对象：
zh_tw: 事件產生器可透過注入來取得一個<emphasis>事件通知器（event notifier）</emphasis> 物件：

source: The <literal>@Observable</literal> annotation implicitly defines a Web Bean with scope <literal>@Dependent</literal> and deployment type <literal>@Standard</literal>, with an implementation provided by the Web Bean manager.
de_de: Die <literal>@Observable</literal>-Annotation definiert implizit ein Web Bean mit Geltungsbereich <literal>@Dependent</literal> und Deployment-Typ <literal>@Standard</literal> mit einer durch den Web Bean Manager bereitgestellten Implementierung.
es_es: La anotación <literal>@Observable</literal> define implícitamente un Web Bean con ámbito <literal>@Dependent</literal> y tipo de despliegue <literal>@Standard</literal>, con una implementación provista por el administrador de Web Bean.
it_it: L'annotazione <literal>@Observable</literal> definisce implicitamente un Web Bean con scope <literal>@Dependent</literal> e tipo di deploy <literal>@Standard</literal>, con un'implementazione fornita dal manager Web Bean.
ja_jp: <literal>@Observable</literal> アノテーションはスコープ <literal>@Dependent</literal> とデプロイメントタイプ <literal>@Standard</literal> とWeb Beanマネージャによって提供される実装を持つWeb Beanを暗黙的に定義します。
zh_cn: <literal>@Observable</literal>注释隐式指定了一个 <literal>@Dependent</literal> 范围的，部署类型为<literal>@Standard</literal> 的Web Bean。其实现由Web Bean管理器提供。
zh_tw: <literal>@Observable</literal> 這個標記暗示性地以 <literal>@Dependent</literal> 這個 scope 和 <literal>@Standard</literal> 這個建置類型，以及 Web Bean 管理員所提供的實做來定義了一個 Web Bean。

source: A producer raises events by calling the <literal>fire()</literal> method of the <literal>Event</literal> interface, passing an <emphasis>event object</emphasis>:
de_de: Ein Producer bringt durch Aufruf der <literal>fire()</literal>-Methode des <literal>Event</literal>-Interface Ereignisse auf, wobei ein <emphasis>Ereignisobjekt</emphasis> weitergegeben wird:
es_es: Un productor crea eventos llamando al método <literal>fire()</literal> de la interfaz del <literal>Evento</literal>, pasando un <emphasis>objeto de evento</emphasis>:
it_it: Un produttore solleva eventi chiamando il metodo <literal>fire()</literal> dell'intefaccia <literal>Event</literal>, passando un <emphasis>oggetto evento</emphasis>:
ja_jp: プロデューサは <literal>Event</literal> インタフェースの <literal>fire()</literal> メソッドを呼び出し、<emphasis>イベントオブジェクト</emphasis> を渡すことでイベントを発生させます。
zh_cn: 一个生产者通过调用 <literal>Event</literal> 接口的 <literal>fire()</literal> 方法来触发事件，传递一个 <emphasis>事件对象</emphasis> ：
zh_tw: 產生器可藉由調用 <literal>Event</literal> 介面的 <literal>fire()</literal> method，並傳送一個 <emphasis>event object</emphasis> 來產生事件：

source: An event object may be an instance of any Java class that has no type variables or wildcard type parameters. The event will be delivered to every observer method that:
de_de: Ein Ereignis-Objekt kann eine Instanz einer beliebigen Java-Klasse sein, die keine Typ-Variablen oder Platzhalter-Typenparameter besitzt. Das Ereignis wird an jede Observer-Methode geliefert, die:
es_es: Un objeto de evento puede ser una instancia de una clase de Java que no tiene variables de tecla o parámetros de comodines. El evento será entregado a cada método de observador que:
it_it: Un oggetto evento può essere un'istanza di una classe Java che non ha variabili tipo o parametri tipo wildcard. L'evento verrà consegnato ad ogni metodo osservatore che:
ja_jp: イベントオブジェクトは、型変数またはワイルドカードの型パラメータを持たないJavaクラスのインスタンスになる可能性があります。そのイベントは次のような特徴を持つ各オブザーバメソッドに配送されます。
zh_cn: 一个事件对象可以是没有任何类型变量或者通配类型参数的任何Java类的实例。事件可以通过符合下面条件的观察者方法传送：
zh_tw: Event object 可能會是個沒有 type variable 或是 wildcard type 參數的任何 Java class 的 instance。該事件會被傳送給符合下列條件的每個 observer method：

source: has an event parameter to which the event object is assignable, and
de_de: einen Ereignisparameter besitzt, dem das Ereignisobjekt zugeschrieben werden kann und
es_es: tenga un parámetro de evento al cual el objeto de evento sea asignable y
it_it: ha un parametro evento a cui l'oggetto evento è assegnabile, e
ja_jp: イベントオブジェクトが代入可能なイベントパラメータ、かつ
zh_cn: 有一个事件参数可以赋给事件对象，并且
zh_tw: 含有可指派 event object 的事件參數，以及

source: specifies no event bindings.
de_de: keine Ereignis-Bindings festlegt.
es_es: especifique que no hay enlaces de eventos.
it_it: non specifica binding d'evento.
ja_jp: イベントバインディングを指定しない
zh_cn: 没有指定事件绑定
zh_tw: 沒有指定事件綁定的 observer method。

source: The Web Bean manager simply calls all the observer methods, passing the event object as the value of the event parameter. If any observer method throws an exception, the Web Bean manager stops calling observer methods, and the exception is rethrown by the <literal>fire()</literal> method.
de_de: Der Web Bean Manager ruft einfach alle Observer-Methoden auf und gibt das Ereignis-Objekt als den Wert des Ereignisparameters weiter. Meldet eine Observer-Methode eine Ausnahme, so stoppt der Web Bean Manager den Aufruf von Observer-Methoden und die Ausnahme wird durch die <literal>fire()</literal>-Methode erneut gemeldet.
es_es: El administrador de Web Beans simplemente llama a todos los métodos de observador, pasando el objeto del evento como el valor de un parámetro de evento. Si cualquier método de observador produce una excepción, el administrador de Web Beans se detiene llamando a los métodos de observador y la excepción es reenviada por le método <literal>fire()</literal>.
it_it: Il manager Web Bean chiama semplicemente tutti i metodi osservatori, passando l'oggento evento come valore del parametro evento. Se il metodo osservatore lancia un'eccezione, il manager Web Bean smette di chiamare i metodi osservatori, e l'eccezione viene rilanciata dal metodo <literal>fire()</literal>.
ja_jp: Web Beanマネージャは単にすべてのオブザーバメソッドを呼び出し、そのイベントパラメータの値としてイベントオブジェクトを渡します。もしオブザーバメソッドが例外をスローしたら、Web Beanマネージャはオブザーバメソッドの呼び出しを停止し、その例外は <literal>fire()</literal> メソッドによって再スローされます。
zh_cn: Web Bean管理器简单地调用所有观察者方法，以事件参数值来传递事件对象。如果任何观察者方法抛出一个异常，Web Bean管理器将停止调用观察者方法，<literal>fire()</literal> 方法再次抛出这个异常。
zh_tw: Web Bean 管理員會調用所有 observer method，並將 event object 作為是事件參數的值一般地來傳送。若任何 observer method 回傳了一個 exception，Web Bean 管理員便會停止調用 observer method，然後這個 exception 會被 <literal>fire()</literal> method 重新回傳。

source: To specify a "selector", the event producer may pass an instance of the event binding type to the <literal>fire()</literal> method:
de_de: Um einen "Selektor" festzulegen kann der Ereignis-Producer eine Instanz des Ereignis-Binding-Typs an die <literal>fire()</literal>-Methode weitergeben:
es_es: Para especificar un "selector", el productor del evento puede pasar una instancia del tipo de enlace del evento al método <literal>fire()</literal>:
it_it: Per specificare un "selettore" il produttore d'evento può passare un'istanza del tipo di binding d'evento al metodo <literal>fire()</literal>:
ja_jp: "セレクタ" を指定するために、イベントプロデューサは次のように <literal>fire()</literal> メソッドへのイベントバインディングタイプのインスタンスを渡すことができます。
zh_cn: 要指定"选择器"，事件生产者可以将一个事件绑定类型的实例传递给 <literal>fire()</literal> 方法：
zh_tw: 若要指定一個「selector」，事件產生器可將事件綁定類型的一個 instance 傳送至 <literal>fire()</literal> 這個 method：

source: The helper class <literal>AnnotationLiteral</literal> makes it possible to instantiate binding types inline, since this is otherwise difficult to do in Java.
de_de: Die Helferklasse <literal>AnnotationLiteral</literal> ermöglicht die Instanziierung der Binding-Typen inline, da es andernfalls schwierig ist, die in Java zu tun.
es_es: La <literal>Anotación Literal</literal> clase auxiliar hace posible crear una instancia de tipos de enlaces en línea, ya que de otra manera es difícil hacerlo en Java.
it_it: La classe helper <literal>AnnotationLiteral</literal> rende possibile istanziare inline i tipi di binding, dato che questo risulta difficile da fare in Java.
ja_jp: ヘルパークラス <literal>AnnotationLiteral</literal> はバインディングタイプをインラインで生成することが可能です。一方、これはJavaでは困難なことです。
zh_cn: <literal>AnnotationLiteral</literal> 帮助类能够让我们内部实例化绑定类型，这在Java里很难这么做。
zh_tw: <literal>AnnotationLiteral</literal> 這個 helper class 可例示內部的綁定類型，因為要在 Java 中這麼作相當的困難。

source: The event will be delivered to every observer method that:
de_de: Das Ereignis wird an jede Observer-Methode geliefert, die:
es_es: El evento será entregado a cada método de observador que:
it_it: L'evento verrà consegnato ad ogni metodo osservatore che:
ja_jp: イベントは次のような特徴を持つ各オブザーバメソッドへ配送されます。
zh_cn: 事件将被发送给每个符合下面条件的观察者方法：
zh_tw: 事件會被傳送給符合下列條件的每個觀察器 method：

source: does not specify any event binding <emphasis>except</emphasis> for the event bindings passed to <literal>fire()</literal>.
de_de: kein Ereignis-Binding festlegt <emphasis>außer</emphasis> für die an <literal>fire()</literal> weitergegebenen Ereignis-Bindings.
es_es: no especifique ningún enlace de evento <emphasis>excepto</emphasis> para enlaces de evento pasados a <literal>fire()</literal>.
it_it: non specifica alcun event binding <emphasis>tranne</emphasis> per gli event binding passati a <literal>fire()</literal>.
ja_jp: <literal>fire()</literal> へ渡されるイベントバインディングを <emphasis>除いて</emphasis> イベントバインディングを指定しない
zh_cn: 除了传递给<literal>fire()</literal>方法的事件绑定之外，没有指定任何事件绑定。
zh_tw: 不會指定任何的事件綁定，<emphasis>除了</emphasis>傳送給 <literal>fire()</literal> 的事件綁定。

source: Alternatively, event bindings may be specified by annotating the event notifier injection point:
de_de: Alternativ können Ereignis-Bindings durch Festlegen des Einspeisungspunkts der Ereignisbenachrichtigung festgelegt werden:
es_es: De modo alternativo, se pueden especificar eventos de enlaces anotando el punto de inyección de notificador de eventos:
it_it: In alternativa gli event binding possono essere specificati annotando il punto di iniezione del notificato d'evento:
ja_jp: 別の方法として、次のようにイベント通知インジェクションポイントのアノテーションを付加することでイベントバインディングを指定可能です。
zh_cn: 或者，通过注释事件通知者注入点来指定事件绑定：
zh_tw: 另外，事件綁定亦可透過標記事件通知器注入點來指定：

source: Then every event fired via this instance of <literal>Event</literal> has the annotated event binding. The event will be delivered to every observer method that:
de_de: Dann besitzt jedes über diese Instanz abgegebene Ereignis das <literal>Event</literal> annotierte Ereignis-Binding. Das Ereignis wird an jede Observer-Methode geliefert, die:
es_es: Luego cada evento disparado vía esta instancia de <literal>Evento</literal> tiene el enlace de evento anotado. El evento será enviado a cada método de observador que:
it_it: Quindi ciascun evento sollevato tramite quest'istanza di <literal>Event</literal> ha annotato l'event binding. L'evento verrà consegnato ad ogni metodo osservatore che:
ja_jp: 次に <literal>Event</literal> のインスタンスを介して発火したイベントは、イベントバインディングのアノテーションを付加します。そのイベントは次のような特徴持つ各オブザーバメソッドに配送されます。
zh_cn: 然后，每个通过 <literal>Event</literal> 实例触发的事件都有注释的事件绑定。事件将被发送给每个符合下面条件的观察者方法：
zh_tw: 若是如此，所有透過 <literal>Event</literal> 的 instance 來產生的事件都會含有被標記的事件綁定。事件會被傳送給符合下列條件的每個觀察器 method：

source: does not specify any event binding <emphasis>except</emphasis> for the event bindings passed to <literal>fire()</literal> or the annotated event bindings of the event notifier injection point.
de_de: Kein Ereignis-Binding festlegt <emphasis>außer</emphasis> für die an <literal>fire()</literal> oder die annotierten Ereignis-Bindings des Einspeisungspunkts für Ereignisbenachrichtigungen weitergegebenen.
es_es: no especifica ningún enlace de evento<emphasis>excepto</emphasis> para los enlaces de eventos pasados a <literal>fire()</literal> o a los enlaces de evento anotados del punto de inyección del notificador de evento.
it_it: non specifica alcun event binding <emphasis>tranne</emphasis> per gli event binding passati a <literal>fire()</literal> o per gli event binding annotati del punto di iniezione del notificatore eventi.
ja_jp: <literal>fire()</literal> へ渡されるイベントバインディング、またはイベント通知インジェクションポイントのアノテートの付いたイベントバインディングを <emphasis>除いて</emphasis> イベントバインディングを指定しない。
zh_cn: <emphasis>除了</emphasis>传递给 <literal>fire()</literal> 方法或者是事件通知者注入点的事件绑定。
zh_tw: 不會指定任何的事件綁定，<emphasis>除了</emphasis>傳送給 <literal>fire()</literal> 的事件綁定或是被標記的事件通知器注入點的事件綁定。

source: Registering observers dynamically
de_de: Dynamische Registrierung von Observern
es_es: Registrando observadores dinámicamente
it_it: Registrare dinamicamente gli osservatori
ja_jp: 動的なオブザーバの登録
zh_cn: 动态注册观察者
zh_tw: 動態式地註冊觀察器
