Repository: 1tchy/core
Catalog: reference/*/events.po
Languages: de_de, es_es, it_it, ja_jp, zh_cn, zh_tw

source: It's often useful to register an event observer dynamically. The application may implement the <literal>Observer</literal> interface and register an instance with an event notifier by calling the <literal>observe()</literal> method.
de_de: Es ist oft hilfreich, einen Ereignis-Observer dynamisch zu registrieren. Die Anwendung kann das <literal>Observer</literal>-Interface implementieren und eine Instanz mit einer Ereignisbenachrichtigung registrieren, indem die <literal>observe()</literal>-Methode aufgerufen wird.
es_es: Suele ser útil registrar dinámicamente un observador de evento. La aplicación puede implementar la interfaz del <literal>Observador</literal> y registrar una instancia con un notificador de evento llamando el método de <literal>observe()</literal>.
it_it: E' spesso utile registrare un osservatore d'evento in modo dinamico. L'applicazione può implementare l'interfaccia <literal>Observer</literal> e registrare un'istanza con un notificatore d'evento chiamando il metodo <literal>observe()</literal>.
ja_jp: イベントオブザーバを動的に登録すると役立つことが多いです。アプリケーションは <literal>Observer</literal> インタフェースを実装し、 <literal>observe()</literal> メソッドを呼び出すことによってイベント通知を持つインスタンスを登録することができます。
zh_cn: 动态地注册一个事件观察者相当有用。应用可以实现 <literal>Observer</literal> 接口，通过调用 <literal>observe()</literal> 方法注册一个事件通知者的观察者实例。
zh_tw: 通常以動態式的方式來註冊事件觀察器相當地有幫助。應用程式可實做 <literal>Observer</literal> 介面然後藉由調用 <literal>observe()</literal> method 來以一個事件通知器去註冊某個 instance。

source: Event binding types may be specified by the event notifier injection point or by passing event binding type instances to the <literal>observe()</literal> method:
de_de: Typen von Ereignis-Bindings können durch den Einspeisungspunkt für Ereignisbenachrichtigungen oder Weitergabe von Instanzen von Typen von Ereignis-Bindings an die <literal>observe()</literal>-Methode festgelegt werden:
es_es: Los tipos de enlace de evento pueden ser especificados por el punto de inyección del notificador del evento o pasando las instancias de tipo de enlace de evento al método <literal>observe()</literal>:
it_it: I tipi di event binding possono essere specificati dal punto di iniezione del notificatore d'eventi o passando istance del tipo di event binding al metodo <literal>observe()</literal>:
ja_jp: イベントバインディングタイプは、イベント通知インジェクションポイントまたは <literal>observe()</literal> メソッドへイベントバインディングタイプのインスタンスを渡すことによって指定できます。
zh_cn: 事件绑定类型可以通过事件通知者注入点指定，或者将一个事件绑定类型实例传递给 <literal>observe()</literal> 方法：
zh_tw: 事件綁定類型能由事件通知器注入點來指定，或是透過將事件綁定類型的 instance 傳送至 <literal>observe()</literal> method：

source: Event bindings with members
de_de: Ereignis-Bindings mit Mitgliedern
es_es: Enlaces de evento con miembros
it_it: Event binding con membri
ja_jp: メンバを持ったイベントバインディング
zh_cn: 事件绑定成员
zh_tw: member 的事件綁定

source: An event binding type may have annotation members:
de_de: Ein Ereignis-Binding-Typ kann Annotationsmitglieder besitzen:
es_es: Un tipo de enlace de evento puede tener miembros de anotación:
it_it: Un tipo di event binding può avere membri annotati:
ja_jp: イベントバインディングは次のようにアノテーションメンバーを持つことができます。
zh_cn: 一个事件绑定类型可以有注释成员：
zh_tw: 事件綁定類型能夠有下列標記成員：

source: The member value is used to narrow the messages delivered to the observer:
de_de: Der Mitgliederwert dient der Eingrenzung von an den Observer gelieferten Nachrichten:
es_es: El valor de miembro se utiliza para limitar los mensajes enviados al observador:
it_it: Il valore del membro è usato per restringere i messaggi consegnati all'osservatore:
ja_jp: メンバー値は次のようにオブザーバへ配送されるメッセージを狭めるのに使用されます。
zh_cn: 成员值用来限制发送给观察者的消息：
zh_tw: member value（這是個編譯期常數）會被使用來過濾並減少傳送至觀察器的訊息數量：

source: Event binding type members may be specified statically by the event producer, via annotations at the event notifier injection point:
de_de: Typenmitglieder von Ereignis-Bindings können durch den Ereignis-Producer statisch festgelegt werden - dies erfolgt über Annotationen am Einspeisungspunkt der Ereignisbenachrichtigungen:
es_es: Los miembros de tipo de enlace de evento se pueden especificar estáticamente por el producto del evento, a través de anotaciones en el punto de inyección del notificador de evento.
it_it: I membri del tipo di eventbinding possono essere specificati staticamente dal produttore di eventi tramite annotazioni nel punto di iniezione del notificatore d'evento:
ja_jp: イベントバインディングタイプはイベントプロデューサによって静的に指定できます。次の例は、イベント通知インジェクションポイントでのアノテーションを通じて指定しています。
zh_cn: 事件绑定类型成员可以通过事件产生者静态地指定，通过在事件通知者注入点使用注释：
zh_tw: 事件綁定類型的成員可由事件產生器在事件通知器的注入點透過標記來靜態地指定：

source: Alternatively, the value of the event binding type member may be determined dynamically by the event producer. We start by writing an abstract subclass of <literal>AnnotationLiteral</literal>:
de_de: Alternativ kann der Wert des Typenmitglieds des Ereignis-Bindings dynamisch durch den Ereignis-Producer bestimmt werden. Wir beginnen durch Schreiben einer abstrakten Unterklasse von <literal>AnnotationLiteral</literal>:
es_es: Alternativamente, el valor del miembro de tipo de enlace de evento puede ser determinado de modo dinámico por el productor de evento. Empezamos por escribir una subclase abstracta de <literal>AnnotationLiteral</literal>:
it_it: Alternativamente il valore del membro del tipo di event binding può esserre dinamicamente determinato dal produttore di eventi. Iniziamo scrivendo una sottoclasse astratta di <literal>AnnotationLiteral</literal>:
ja_jp: 別の方法では、イベントバインディングタイプのメンバー値はイベントプロデューサによって動的に決定することもできます。まず、次のように <literal>AnnotationLiteral</literal> の抽象サブクラスを書くことで始めます。
zh_cn: 或者事件绑定类型成员的值也可以由事件产生者动态地决定。我们先写一个 <literal>AnnotationLiteral</literal> 的抽象子类：
zh_tw: 另外，事件綁定類型成員的值亦可藉由事件產生器來動態式地判斷出。我們首先先從編寫一個 <literal>AnnotationLiteral</literal> 的 abstract subclass 開始：

source: The event producer passes an instance of this class to <literal>fire()</literal>:
de_de: Der Ereignis-Producer gibt eine Instanz dieser Klasse an <literal>fire()</literal> weiter:
es_es: El productor de evento pasa una instancia de esta clase a <literal>fire()</literal>:
it_it: Il produttore di eventi passa un'istanza di questa classe a <literal>fire()</literal>:
ja_jp: イベントプロデューサはこのクラスのインスタンスを <literal>fire()</literal> へ渡します。
zh_cn: 事件产生者将一个这个类的实例传递给 <literal>fire()</literal> ：
zh_tw: 事件產生器會將這個 class 的一個 instance 傳送至 <literal>fire()</literal>：

source: Multiple event bindings
de_de: Multiple Ereignis-Bindings
es_es: Enlaces de evento múltiples
it_it: Event binding multipli
ja_jp: 複数のイベントバインディング
zh_cn: 多个事件绑定
zh_tw: 多重事件綁定（Multiple event binding）

source: Event binding types may be combined, for example:
de_de: Typen von Ereignis-Bindings können kombiniert werden, zum Beispiel:
es_es: Los tipos de enlaces de evento pueden combinarse, por ejemplo:
it_it: I tipi di event binding possono essere combinati, per esempio:
ja_jp: イベントバインディングタイプは、たとえば次のように組み合わせることが可能です。
zh_cn: 事件绑定类型可以组合，例如：
zh_tw: 事件綁定類型可被合併，例如：

source: When this event occurs, all of the following observer methods will be notified:
de_de: Findet dieses Ereignis statt, so werden alle folgenden Observer-Methoden benachrichtigt:
es_es: Cuando un evento ocurre, todos los siguientes métodos de observador serán notificados:
it_it: Quando si genera un evento, tutti i seguenti metodi osservatori verranno notificati:
ja_jp: このイベントが発生すると、次のすべてのオブザーバメソッドは通知されます。
zh_cn: 当这个事件发生时，下列所有观察者方法都会被通知：
zh_tw: 當這個事件發生時，下列所有 observer method 都會被通知：

source: Transactional observers
de_de: Transaktionale Observer
es_es: Observadores transaccionales
it_it: Osservatori transazionali
ja_jp: トランザクション型オブザーバ
zh_cn: 事务性的观察者
zh_tw: 交易觀察器（Transactional observers）

source: Transactional observers receive their event notifications during the before or after completion phase of the transaction in which the event was raised. For example, the following observer method needs to refresh a query result set that is cached in the application context, but only when transactions that update the <literal>Category</literal> tree succeed:
de_de: Transaktionale Observers erhalten ihre Ereignisbenachrichtigungen vor oder nach der Abschlussphase der Transaktion während derer das Ereignis aufgegekommen ist. Zum Beispiel muss die folgende Observer-Methode einen Satz von Abfrageergebnissen neu laden, der im Applikationskontext gecacht ist, jedoch nur dann, wenn die den <literal>Category</literal>-Baum aktualisierenden Transaktionen erfolgreich sind:
es_es: Los observadores transaccionales reciben las notificaciones de sus eventos antes o después de la fase de finalización de la transacción en la se creó el evento. Por ejemplo, el siguiente método de observador necesita actualizar un conjunto de resultados de petición almacenado en caché en el contexto de aplicación, pero sólo cuando las transacciones que actualizan el árbol de <literal>Categoría</literal> tengan éxito:
it_it: Gli osservatori transazionali ricevono notifiche d'evento prima o dopo la fase di completamento della transazione, nella quale l'evento viene sollevato. Per esempio, il seguente metodo osservatore ha bisogno di aggiornare il set di risultati della query memorizzato nel contesto dell'applicazione, ma solo quando hanno successo le transazioni che aggiornano l'albero <literal>Category</literal>.
ja_jp: トランザクション型オブザーバは、イベントが発生したときのトランザクションが完了前または完了後のフェーズ中にイベント通知を受け取ります。たとえば、次のオブザーバメソッドはアプリケーションコンテキストにキャッシュされたクエリーの結果をリフレッシュする必要がありますが、 <literal>Category</literal> ツリーの更新をしたトランザクションが成功したときだけ必要です。
zh_cn: 事务性的观察者在事件触发的事务完成阶段之前或者之后接收到事件通知。例如下面的观察者方法需要刷新在应用上下文中缓存的查询结果集，但只有在事务成果地更新了 <literal>Category</literal> 树之后才能发生：
zh_tw: 交易觀察器會在事件被產生後，於交易完成之前或之後收到它們的事件通知。比方說，下列 observer method 需要更新一組快取儲存於應用程式 context 中的查詢結果，不過只有更新了 <literal>Category</literal> tree 的交易會成功：

source: There are three kinds of transactional observers:
de_de: Es gibt drei Arten von transaktionalen Observern:
es_es: Hay tres clases de observadores transaccionales:
it_it: Ci sono tre tipi di osservatori transazionali:
ja_jp: 次の3種類のトランザクション型オブザーバが存在します。
zh_cn: 我们有三种事务性观察者：
zh_tw: 交易觀察器分為三種類型：

source: <literal>@AfterTransactionSuccess</literal> observers are called during the after completion phase of the transaction, but only if the transaction completes successfully
de_de: <literal>@AfterTransactionSuccess</literal>-Observers werden während der Abschlussphase der Transaktion aufgerufen, jedoch nur bei erfolgreichem Abschluss der Transaktion
es_es: Los observadores<literal>@AfterTransactionSuccess</literal> son llamados durante la fase de después de finalización de la transacción, pero sólo si la transacción finaliza exitosamente.
it_it: gli osservatori <literal>@AfterTransactionSuccess</literal> vengono chiamati dopo la fase di completamento della transazione, ma solo se questa si completa con successo
ja_jp: <literal>@AfterTransactionSuccess</literal> オブザーバは、トランザクション完了後のフェーズ中にそのトランザクションの完了に成功したときだけ呼び出される
zh_cn: <literal>@AfterTransactionSuccess</literal> 观察者仅仅在事务成功完成之后被调用。
zh_tw: <literal>@AfterTransactionSuccess</literal> 觀察器會在交易完成之後的階段才會被調用，不過僅限於交易成功完成的情況下

source: <literal>@AfterTransactionFailure</literal> observers are called during the after completion phase of the transaction, but only if the transaction fails to complete successfully
de_de: <literal>@AfterTransactionFailure</literal>-Observer werden während der Abschlussphase der Transaktion aufgerufen, jedoch nur, wenn der erfolgreiche Abschluss der Transaktion fehlschlägt
es_es: Los observadores <literal>@AfterTransactionFailure</literal> son llamados durante la fase de después de la finalización de la transacción, pero sólo si la transacción falla
it_it: gli osservatori <literal>@AfterTransactionFailure</literal> vengono chiamati dopo la fase di completamento della transazione, ma solo se questa fallisce e quindi non completa con successo
ja_jp: <literal>@AfterTransactionFailure</literal> オブザーバは、トランザクション完了後のフェーズ中にそのトランザクションの完了に失敗したときだけ呼び出される
zh_cn: <literal>@AfterTransactionFailure</literal> 观察者仅仅在事务失败之后被调用。
zh_tw: <literal>@AfterTransactionFailure</literal> 觀察器會在交易完成之後的階段才會被調用，不過僅限於交易無法成功完成的情況下

source: <literal>@AfterTransactionCompletion</literal> observers are called during the after completion phase of the transaction
de_de: <literal>@AfterTransactionCompletion</literal>-Observer werden während der Nach-Abschlussphase der Transaktion aufgerufen
es_es: Los observadores <literal>@AfterTransactionCompletion</literal> son llamados durante la fase de después de finalización de la transacción
it_it: gli osservatori <literal>@AfterTransactionCompletion</literal> vengono chiamati dopo la fase di completamento della transazione
ja_jp: <literal>@AfterTransactionCompletion</literal> オブザーバは、トランザクション完了後のフェーズ中に呼び出される
zh_cn: <literal>@AfterTransactionCompletion</literal> 观察者在事务完成阶段之后被调用。
zh_tw: <literal>@AfterTransactionCompletion</literal> 觀察器會在交易完成之後的階段才會被調用

source: <literal>@BeforeTransactionCompletion</literal> observers are called during the before completion phase of the transaction
de_de: <literal>@BeforeTransactionCompletion</literal>-Observer werden während der Vor-Abschlussphase der Transaktion aufgerufen
es_es: Los observadores <literal>@BeforeTransactionCompletion</literal> son llamados durante la fase de antes de finalización de la transacción
it_it: gli osservatori <literal>@BeforeTransactionCompletion</literal> vengono chiamati prima della fase di completamento della transazione
ja_jp: <literal>@BeforeTransactionCompletion</literal> オブザーバは、トランザクション完了前のフェーズ中に呼び出される
zh_cn: <literal>@BeforeTransactionCompletion</literal> 观察者在事务完成阶段之前被调用。
zh_tw: <literal>@BeforeTransactionCompletion</literal> 觀察器會在交易完成之前的階段被調用

source: Transactional observers are very important in a stateful object model like Web Beans, because state is often held for longer than a single atomic transaction.
de_de: Transaktional Observer sind in einem "stateful" Objektmodell wie Web Beans sehr wichtig, da der Status oft länger bestehen bleibt als eine einzelne atomare Transaktion.
es_es: Los observadores transaccionales son muy importantes en un modelo de objetos con estado como Web Beans, porque el estado suele ser mantenido para más de una transacción atómica.
it_it: Gli osservatori transazionali sono molto importanti in un modello ad oggetto stateful come Web Beans, poiché lo stato è spesso mantenuto per un tempo più lungo di una singola transazione atomica.
ja_jp: トランザクション型オブザーバはWeb Beansのようなステートフルオブジェクトモデルにおいてはとても重要です。なぜなら、ステートは単一のアトミックトランザクションよりも長く保持されることが多いからです。
zh_cn: 事务性的观察者在诸如Web Beans这类具有状态的对象模型中非常重要，因为状态通常比一个单一的原子事务所保留的时间更长。
zh_tw: 交易觀察器在一個像是 Web Bean 的 stateful 物件模型中相當地重要，因為 state 一般被保持的時間比單一 atomic transaction（不可分割的交易）還要長。

source: Imagine that we have cached a JPA query result set in the application scope:
de_de: Stellen wir uns vor, wir besitzen einen gecachten Satz von JPA-Abfrageergebnissen im Geltungsbereich der Anwendung:
es_es: Imagine que hemos almacenado en caché un conjunto de resultados de petición JPA en el ámbito de la aplicación:
it_it: Si immagini di avere cachato un risultato di query JPA nello scope di applicazione:
ja_jp: アプリケーションスコープにおいてJPAクエリーの結果をキャッシュしたと想像してみてください。
zh_cn: 设想一下我们已经在应用范围内缓存了一个JPA的查询结果集：
zh_tw: 想像我們已快取了一個設置於應用程式 scope 中的 JPA 查詢結果：

source: From time to time, a <literal>Product</literal> is created or deleted. When this occurs, we need to refresh the <literal>Product</literal> catalog. But we should wait until <emphasis>after</emphasis> the transaction completes successfully before performing this refresh!
de_de: Von Zeit zu Zeit wird ein <literal>Product</literal> erstellt oder gelöscht. Ist dies der Fall, so müssen wir den <literal>Product</literal>-Katalog neu laden. Wir sollten damit aber bis <emphasis>nach</emphasis> dem erfolgreichen Abschluss der Transaktion warten!
es_es: De vez en cuando, se crea o borra un <literal>Producto</literal>. Cuando esto ocurre, necesitamos refrescar el catálogo del <literal>Producto</literal>. No obstante, deberíamos esperar hasta <emphasis>después</emphasis> de que la transacción finalice exitosamente antes de ¡actualizar!
it_it: Di tanto in tanto un <literal>Product</literal> viene creato o cancellato. Quando questo avviene occorre aggiornare il catalogo del <literal>Product</literal>. Ma si dovrebbe aspettare che la transazione <emphasis>abbia completato</emphasis> con successo prima di eseguire l'aggiornamento!
ja_jp: 時が経つにつれ、 <literal>Product</literal> は生成され、削除されます。これが発生するとき、 <literal>Product</literal> カタログをリフレッシュする必要があります。しかし、このリフレッシュを実行する前にそのトランザクションの完了が成功する <emphasis>後</emphasis> まで待つべきなのです。
zh_cn: 一个 <literal>Product</literal>时常会被创建或者删除。当这个动作发生后，我们需要刷新 <literal>Product</literal> 分类。但是我们需要在事务完全成功<emphasis>之后</emphasis>才能处理刷新。
zh_tw: <literal>Product</literal> 經常會被建立或刪除。當這情況發生時，我們便需要更新 <literal>Product</literal> 的 catalog。不過我們還是應該等到交易成功完成<emphasis>之後</emphasis>才去進行這項更新！

source: The Web Bean that creates and deletes <literal>Product</literal>s could raise events, for example:
de_de: Das Web Bean, das <literal>Product</literal>s erstellt oder löscht könnte Ereignisse aufrufen, zum Beispiel:
es_es: El Web Bean que crea y borra <literal>Productos</literal> podría crear eventos, por ejemplo:
it_it: Il Web Bean che crea o cancella <literal>Product</literal> può sollevare eventi, per esempio:
ja_jp: <literal>Product</literal> を生成、削除するWeb Beansは次のようにイベントを発生させます。
zh_cn: 创建或者删除 <literal>Product</literal> 的Web Bean应该触发事件，例如：
zh_tw: 建立和刪除 <literal>Product</literal> 的 Web Bean 可產生事件，例如：

source: And now <literal>Catalog</literal> can observe the events after successful completion of the transaction:
de_de: Und jetzt kann <literal>Catalog</literal> die Ereignisse nach erfolgreichem Abschluss der Transaktion beobachten:
es_es: Ahora el <literal>Catálogo</literal> puede observar los eventos después de finalizar la transacción exitosamente:
it_it: E ora <literal>Catalog</literal> può osservare gli eventi dopo il completamento (con successo) della transazione:
ja_jp: そして、 <literal>Catalog</literal> は次のようにトランザクションの完了が成功した後にイベントを観察できるようになります。
zh_cn: 现在 <literal>Catalog</literal> 能够观察到事务成功完成之后触发的事件：
zh_tw: 而現在，<literal>Catalog</literal> 可在交易成功完成之後觀察事件：

source: An observer method need not specify any event bindings&#151;in this case it is interested in <emphasis>all</emphasis> events of a particular type. If it does specify event bindings, it is only interested in events which also have those event bindings.
es_es: Un método de observador no necesita especificar ningún enlace de evento &#151;en este caso está interesado en <emphasis>todos</emphasis> los eventos de un tipo determinado. Si no especifica enlaces de eventos, está sólo interesado en eventos que tienen también aquellos enlaces de eventos.
zh_tw: 一個 observer method 不需要指定任何的事件綁定&#151;在此情況下它會專注於特定 type 的<emphasis>所有</emphasis>事件。若它指定了事件綁定的話，它就只會專注於也具有這些事件綁定的事件。
