Repository: 1tchy/core
Catalog: reference/*/extend.po
Languages: es_es, fr_fr, it_it, ko_kr, zh_cn, zh_tw

source: Extending Web Beans
es_es: Extensión de Web Beans
fr_fr: Etendre les Web Beans
it_it: Estendere i Web Beans
ko_kr: Web Beans 확장
zh_cn: 扩展Web Bean
zh_tw: 延伸 Web Bean

source: Web Beans is intended to be a platform for frameworks, extensions and integration with other technologies. Therefore, Web Beans exposes a set of SPIs for the use of developers of portable extensions to Web Beans. For example, the following kinds of extensions were envisaged by the designers of Web Beans:
es_es: Web Beans pretende ser una plataforma para marcos, extensiones e integración con otras tecnologías. Por lo tanto, Web Beans expone una serie de SPI para el uso de desarrolladores de extensiones portátiles para Web Beans. Por ejemplo, las siguientes clases de extensiones fueron previstas por los diseñadores de Web Beans:
fr_fr: Les Web Beans sont conçus pour être une plateforme pour des frameworks, des extensions et l'intégration avec d'autres technologies. Pour cela, les Web Beans exposent une série de SPIs pour l'usage des développeurs d'extensions portables aux Web Beans. Par exemple, les sortes d'extensions suivantes furent envisagées par les concepteurs des Web Beans:
it_it: Web Beans è inteso essere una piattaforma per framework, estensioni e integrazione con altre tecnologie. Quindi Web Beans espone un set di SPI (Service Provider Interface) per l'uso da parte degli sviluppatori di estensioni portabili a Web Beans. Per esempio, i seguentitipi di estensione sono state prese in considerazione dai progettisti di Web Beans:
ko_kr: Web Beans는 다른 기술과의 통합, 확장, 프레임워크에 대한 플랫폼이 되기 위한 것입니다. 따라서, Web Beans는 Web Beans로의 휴대용 확장에 대한 개발자의 사용을 위해 SPI 모음을 노출합니다. 예를 들어, 다음과 같은 종류의 확장은 Web Beans 개발자에 의해 구상되었습니다.
zh_cn: Web Beans意图成为框架的平台，扩展的平台，和能够与其他技术整合的平台。因此，Web Bean将一套SPI暴露给开发者，从而能够让他们便于扩展Web Bean。例如，下面是Web Bean设计者设想的扩展类型：
zh_tw: Web Bean 為架構的平台，它可用來進行其它技術的延伸與整合。因此，Web Bean 提供了一組讓 Web Bean 的 portable extension 開發人員可使用的 SPI。比方說，下列類型的延伸為 Web Bean 設計人員所設想的：

source: integration with Business Process Management engines,
es_es: integración con motores de Gestión de Proceso de Negocios,
fr_fr: intégration avec des moteurs de gestion de processus métiers (BPM),
it_it: Integrazione con i motori di Gestione dei Processi di Business,
ko_kr: 비지니스 프로세스 관리 엔진과의 통합
zh_cn: 整合业务流程管理引擎，
zh_tw: 和商業流程管理上的整合、

source: integration with third-party frameworks such as Spring, Seam, GWT or Wicket, and
es_es: integración con marcos de terceras partes tales como Spring, Seam, GWT o Wicket, y
fr_fr: intégration avec des frameworks tiers tels que Spring, Seam, SWT ou Wicket, et
it_it: integrazione con framework di terze-parti quali Spring, Seam, GWT o Wicket, e
ko_kr: Spring, Seam, GWT, Wicket과 같은 제삼자 프레임워크와의 통합
zh_cn: 整合第三方框架，例如Spring, Seam, GWT或者Wicket，和
zh_tw: 和第三方架構（例如 Spring、Seam、GWT 或 Wicket）上的整合，以及

source: new technology based upon the Web Beans programming model.
es_es: nueva tecnología basada en el modelo de programación de Web Beans.
fr_fr: une nouvelle nouvelle technologie basée sur le modèle de programmation des Web Beans.
it_it: nuova tecnologia basata sul modello di programmazione di Web Beans.
ko_kr: Web Beans 프로그래밍 모델을 기반으로 하는 새로운 기술
zh_cn: 基于Web Bean编程模型的新技术。
zh_tw: 基於 Web Bean 程式撰寫模型（Programming Model）的新技術。

source: The nerve center for extending Web Beans is the <literal>Manager</literal> object.
es_es: El centro nervioso para extender Web Beans es el objeto <literal>Manager</literal>.
fr_fr: Le centre nerveux pour l'extension des Web Beans est l'objet <literal>Manager</literal>.
it_it: Il nervo centrale per l'estensione di Web Beans è l'oggetto <literal>Manager</literal>.
ko_kr: Web Beans 확장의 중심은 <literal>Manager</literal> 객체입니다.
zh_cn: 扩展Web Bean的神经中枢是 <literal>Manager</literal> 对象。
zh_tw: 延伸 Web Bean 的神經中樞為 <literal>Manager</literal> 這個物件。

source: The <literal>Manager</literal> object
es_es: El objeto <literal>Manager</literal>
fr_fr: L'object <literal>Manager</literal>
it_it: L'oggetto <literal>Manager</literal>
ko_kr: <literal>Manager</literal> 객체
zh_cn: <literal>Manager</literal> 对象
zh_tw: <literal>Manager</literal> 物件

source: The <literal>Manager</literal> interface lets us register and obtain Web Beans, interceptors, decorators, observers and contexts programatically.
es_es: La interfaz <literal>Manager</literal> nos permite registrar y obtener Web Beans, interceptores, decoradores, observadores y contextos en forma programada.
fr_fr: L'interface <literal>Manager</literal> nous permet d'enregistrer et d'obtenir des Web Beans, intercepteurs, décorateurs, observateurs et contextes de manière programmatique.
it_it: L'interfaccia <literal>Manager</literal> consente di registrare ed ottenere programmaticamente interceptor, decoratori, osservatori e contesti di Web Beans.
ko_kr: <literal>Manager</literal> 인터페이스는 Web Beans, 인터셉터, 데코레이터, 옵저버 및 컨텍스트를 프로그램적으로 획득하여 등록할 수 있게 합니다.
zh_cn: <literal>Manager</literal> 接口能够让我们通过编程来注册和获得Web Bean，拦截器，装饰器，观察者和上下文。
zh_tw: <literal>Manager</literal> 介面能讓我們程式性地註冊並取得 Web Bean、攔截器（interceptor）、裝飾器（decorator）、觀察器（observer），以及 context。

source: We can obtain an instance of <literal>Manager</literal> via injection:
es_es: Podemos obtener una instancia de <literal>Manager</literal> vía inyección:
fr_fr: Nous pouvons obtenir une instance d'un <literal>Manager</literal> par injection:
it_it: Possiamo ottenere un'istanza di <literal>Manager</literal> via iniezione:
ko_kr: 삽입을 통해 <literal>Manager</literal> 인스턴스를 얻을 수 있습니다:
zh_cn: 我们可以通过注入来获得一个 <literal>Manager</literal> 实例：
zh_tw: 我們可透過注入來取得 <literal>Manager</literal> 的一個 instance：

source: @Current Manager manager
zh_tw: @Current Manager 管理員

source: The <literal>Bean</literal> class
es_es: La clase <literal>Bean</literal>
fr_fr: La classe <literal>Bean</literal>
it_it: La classe <literal>Bean</literal>
ko_kr: <literal>Bean</literal> 클래스
zh_cn: <literal>Bean</literal> 类
zh_tw: <literal>Bean</literal> class

source: Instances of the abstract class <literal>Bean</literal> represent Web Beans. There is an instance of <literal>Bean</literal> registered with the <literal>Manager</literal> object for every Web Bean in the application.
es_es: Instancias de clase abstracta <literal>Bean</literal> representan Web Beans. Hay una instancia de <literal>Bean</literal> registrada con el objeto <literal>Manager</literal> para cada Web Bean en la aplicación.
fr_fr: Les instances de la class abstraite <literal>Bean</literal> représentent les Web Beans. Il y a une instance de <literal>Bean</literal> enregistrée auprès de l'objet <literal>Manager</literal> pour chaque Web Bean dans l'application.
it_it: Istanze della classe astratta <literal>Bean</literal> rappresentano i Web Beans. C'è un'istanza di <literal>Bean</literal> registrata con l'oggetto <literal>Manager</literal> per ogni Web Bean dell'applicazione.
ko_kr: <literal>Bean</literal> 추상 클래스의 인스턴스는 Web Beans를 나타냅니다. 애플리케이션에 있는 모든 Web Bean에 해당하는 <literal>Manager</literal> 객체로 등록된 <literal>Bean</literal> 인스턴스가 있습니다.
zh_cn: 抽象类 <literal>Bean</literal> 的实例代表Web Bean。应用中的每个Web Bean都有一个在 <literal>Manager</literal> 注册的 <literal>Bean</literal> 实例。
zh_tw: <literal>Bean</literal> 這個 abstract class 的 instance 代表 Web Bean。應用程式中的每個 Web Bean 都會有個與 <literal>Manager</literal> 物件註冊的 <literal>Bean</literal> instance。

source: It's possible to extend the <literal>Bean</literal> class and register instances by calling <literal>Manager.addBean()</literal> to provide support for new kinds of Web Beans, beyond those defined by the Web Beans specification (simple and enterprise Web Beans, producer methods and JMS endpoints). For example, we could use the <literal>Bean</literal> class to allow objects managed by another framework to be injected into Web Beans.
es_es: Es posible extender la clase <literal>Bean</literal> y registrar instancias llamando a <literal>Manager.addBean()</literal> para proveer soporte a nuevas clases de Web Beans, además de los definidos por la especificación Web Beans (Web Beans sencillos y empresariales, métodos de productor y endpoints JMS). Por ejemplo, podríamos utilizar la clase <literal>Bean</literal> para permitir que los objetos sean administrados por otro marco que se inyecta en Web Beans.
fr_fr: Il est possible d'étendre la classe <literal>Bean</literal> et d'enregistrer des instances en appelant la méthode <literal>Manager.addBean()</literal> afin de supporter de nouvelles sortes de Web Beans, en plus de ceux déjà définis dans la spécification Web Beans (Web Beans simple et d'entreprise, méthode productrices et terminaisons JMS). Par exemple, nous pourrions utiliser la classe <literal>Bean</literal> pour permettre aux objets gérés par un autre framework d'être injectés dans des Web Beans.
it_it: E' possibile estendere la classe <literal>Bean</literal> e registrare le istanze chiamando <literal>Manager.addBean()</literal> per fornire supporto a nuovi tipi di Web Beans, oltre a quelli definiti dalla specifica Web Beans (semplici ed enterprise, metodi produttori e endpoint JMS). Per esempio possiamo usare la classe <literal>Bean</literal> per consentire ad oggetti gestiti da altri framework di essere iniettati nei Web Beans.
ko_kr: Web Beans 사양 (엔터프라이즈 Web Beans, 생산자 방식 및 JMS 엔드포인트)에 의해 정의된 것 이상으로 새로운 종류의 Web Beans을 지원하기 위해 <literal>Bean</literal> 클래스를 확장하고 <literal>Manager.addBean()</literal>를 호출하여 인스턴스를 등록할 수 있습니다. 예를 들어, <literal>Bean</literal> 클래스를 사용하여 Web Beans에 주입된 다른 프레임워크에 의해 관리되는 객체를 허용하게 할 수 있습니다.
zh_cn: 我们可以继承 <literal>Bean</literal> 类，通过调用 <literal>Manager.addBean()</literal> 方法注册实例，从而提供超出Web Bean规范之外（简单Web Bean, 企业WebBean, 生产者方法和JMS端点）的新的Web Bean类型。例如，我们可以使用 <literal>Bean</literal> 类来允许其他框架管理的对象能够注入到Web Bean中。
zh_tw: 您可藉由調用 <literal>Manager.addBean()</literal> 來延伸 <literal>Bean</literal> class 並註冊 instance 以便提供較新、未經 Web Bean 規格定義（基本與企業級 Web Bean、producer method 以及 JMS 端點）的 Web Bean 上的支援。比方說，我們可使用 <literal>Bean</literal> class 來允許另一個架構所管理的物件被注入 Web Bean 之中。

source: There are two subclasses of <literal>Bean</literal> defined by the Web Beans specification: <literal>Interceptor</literal> and <literal>Decorator</literal>.
es_es: Hay dos subclases de <literal>Bean</literal> definidas por la especificación de Web Beans: <literal>Interceptor</literal> y <literal>Decorador</literal>.
fr_fr: Il y a deux sous-classes de <literal>Bean</literal> définies par la spécification Web Beans: <literal>Interceptor</literal> et <literal>Decorator</literal>.
it_it: Ci sono due sottoclassi di <literal>Bean</literal> definite dalla specifica Web Beans: <literal>Interceptor</literal> e <literal>Decorator</literal>.
ko_kr: Web Beans 사양에 의해 정의되는 두 개의 <literal>Bean</literal> 하부 클래스가 있습니다: <literal>Interceptor</literal> 및 <literal>Decorator</literal>.
zh_cn: Web Bean规范定义了两种 <literal>Bean</literal> 的子类：<literal>拦截器</literal> 和 <literal>装饰器</literal>。
zh_tw: Web Bean 規格定義了 <literal>Bean</literal> 的兩個 subclass：<literal>Interceptor</literal> 和 <literal>Decorator</literal>。

source: The <literal>Context</literal> interface
es_es: La interfaz <literal>Contexto</literal>
fr_fr: L'interface <literal>Context</literal>
it_it: L'interfaccia <literal>Context</literal>
ko_kr: <literal>Context</literal> 인터페이스
zh_cn: <literal>Context</literal> 接口
zh_tw: <literal>Context</literal> 介面

source: The <literal>Context</literal> interface supports addition of new scopes to Web Beans, or extension of the built-in scopes to new environments.
es_es: La interfaz <literal>Contexto</literal> soporta la adición de nuevos ámbitos a Web Beans, o extensión de los ámbitos incorporados a nuevos entornos.
fr_fr: L'interface <literal>Context</literal> supporte l'ajout de nouvelles portées aux Web Beans, ou d'extensions des portées fournies à de nouveaux environnements.
it_it: L'interfaccia <literal>Context</literal> supporta l'aggiunta di nuovi scope ai Web Beans, o l'estensione di scope esistenti a nuovi ambienti.
ko_kr: <literal>Context</literal> 인터페이스는 Web Beans에 새로운 범위를 추가로 지원하거나 새로운 환경에 내장된 범위를 확장 지원합니다.
zh_cn: <literal>Context</literal> 接口支持向Web Bean中添加新的范围，或者在新的环境中扩展内置的范围。
zh_tw: <literal>Context</literal> 介面支援新增額外的 Web Bean 功能，或針對新環境為內建功能進行延伸。

source: For example, we might implement <literal>Context</literal> to add a business process scope to Web Beans, or to add support for the conversation scope to an application that uses Wicket.
es_es: Por ejemplo, podríamos implementar <literal>Contexto</literal> para agregar un ámbito de proceso de negocio a Web Beans, o agregar soporte para el ámbito de conversación a una aplicación que utiliza Wicket.
fr_fr: Par exemple, nous pourrions implémenter <literal>Context</literal> pour ajouter une portée de type processus métier aux Web Beans, ou pour ajouter le support d'une portée conversation à une application qui utilise Wicket.
it_it: Per esempio possiamo implementare <literal>Context</literal> per aggiungere uno scope di tipo business process a Web Beans, o per aggiungere il supporto allo scope di conversazione ad un'applicazione che impiega Wicket.
ko_kr: 예를 들어, Web Beans에 비지니스 프로세스 범위를 추가하거나 또는 Wicket을 사용하는 애플리케이션에 컨버세이션 범위에 대한 지원을 추가하기 위해 <literal>Context</literal>를 구현할 수 있습니다.
zh_cn: 例如，我们可以实现 <literal>Context</literal> ，向Web Bean添加一个业务流程范围，或者向使用Wicket框架的应用添加对对话的支持。
zh_tw: 比方說，我們可能會實做 <literal>Context</literal> 來新增一個商業流程功能至 Web Bean，或是為一個使用 Wicket 的應用程式新增對話功能上的支援。
