Repository: 1tchy/core
Catalog: reference/*/injection.po
Languages: de_de, es_es, it_it, ja_jp, ko_kr, zh_cn, zh_tw

source: There are certain kinds of dependent objects&#151;Web Beans with scope <literal>@Dependent</literal>&#151;that need to know something about the object or injection point into which they are injected in order to be able to do what they do. For example:
es_es: Hay algunas clases de objetos&#151;con ámbito <literal>@Dependent</literal>&#151;que necesitan saber algo acerca del objeto o punto de inyección dentro del cual son inyectados para poder hacer lo que hacen. Por ejemplo:
it_it: Certi tipi di oggetti dipendenti&#151;Web Bean con scope <literal>@Dependent</literal>&#151;hanno bisogno di avere informazioni riguardo l'oggetto o il punto in cui sono iniettati per fare quello che devono. Per esempio:
zh_tw: 有幾種特定相依物件&#151;含有 <literal>@Dependent</literal> 這個 scope 的 Web Bean&#151;需要知道有關於物件或是它們被注入的注入點相關資訊才能進行它們本應進行的工作。比方說：

source: The log category for a <literal>Logger</literal> depends upon the class of the object that owns it.
de_de: Die Protokollkategorie für einen <literal>Logger</literal> hängt von der Klasse des sie besitzenden Objekts ab.
es_es: La categoría de registro para un <literal>Logger</literal> depende de la clase de objeto que lo posea.
it_it: La categoria di log per un <literal>Logger</literal> dipende dalla classe dell'oggetto che lo contiene.
ja_jp: <literal>Logger</literal>のログカテゴリはロガーを保有するオブジェクトのクラスが何であるかに依存します。
ko_kr: <literal>Logger</literal> 용 로그 카테고리는 소유하고 있는 객체 클래스에 의존합니다.
zh_cn: <literal>Logger</literal>的日志分类取决于拥有它的类。
zh_tw: <literal>Logger</literal> 的 log category 取決於擁有它的物件的 class。

source: Injection of a HTTP parameter or header value depends upon what parameter or header name was specified at the injection point.
de_de: Die Einspeisung eines HTTP-Parameters oder Header-Werts hängt davon ab, welcher Parameter oder Header-Name am Einspeisungspunkt festgelegt wurde.
es_es: La inyección de un parámetro HTTP o valor de encabezado depende del parámetro o del nombre de encabezado especificado en el punto de inyección.
it_it: L'iniezione di un parametro o di un header HTTP dipende dal nome del parametro o dello header specificato nel punto di iniezione.
ja_jp: HTTPパラメタ値やヘッダ値の注入は、注入箇所において、どのパラメタ名やヘッダ名が指定されているかに依存します。
ko_kr: 헤더 값이나 HTTP 매개 변수 삽입은 삽입 지점에서 어떤 매개 변수 또는 헤더 이름을 지정하였는가에 의존합니다.
zh_cn: 一个HTTP参数和报头值的注入取决于注入点指定的参数或者报头名称。
zh_tw: HTTP 參數或是 header value 的注入取決於在注入點所指定的參數或標頭名稱。

source: Injection of the result of an EL expression evaluation depends upon the expression that was specified at the injection point.
de_de: Einspeisung als Ergebnis der Evaluierung eines EL-Ausdrucks hängt von vom am Einspeisungspunkt festgelegten Ausdruck ab.
es_es: La inyección del resultado de una prueba de expresión EL depende de la expresión que fue especificada en el punto de inyección.
it_it: L'iniezione del risultato di una espressione EL dipende dall'espressione specificata nel punto di iniezione.
ja_jp: EL式の評価結果の注入は、注入箇所においてどのような式が指定されているかに依存します。
ko_kr: EL 표현식 평가 (expression evaluation) 평가의 삽입은 삽입 지점에서 지정된 표현식에 의존합니다.
zh_cn: 表达式运算结果的注入取决于在注入点指定的表达式。
zh_tw: EL 運算式評估（expression evaluation）結果的注入取決於在注入點所指定的運算式。

source: A Web Bean with scope <literal>@Dependent</literal> may inject an instance of <literal>InjectionPoint</literal> and access metadata relating to the injection point to which it belongs.
de_de: Ein Web Bean mit Geltungsbereich <literal>@Dependent</literal> kann eine Instanz von <literal>InjectionPoint</literal> einspeisen und auf Metadaten zugreifen, die mit dem zugehörigen Einspeisungspunkt zu tun haben.
es_es: Un Web Bean con ámbito <literal>@Dependent</literal> puede inyectar una instancia de <literal>InjectionPoint</literal> y acceder a metadatos relativos al punto de inyección al que pertenezca.
it_it: Un Web Bean con scope <literal>@Dependent</literal> può essere iniettato con un'istanza di <literal>InjectionPoint</literal> e accedere i metadati riguardanti il punto di iniezione cui appartiene.
ja_jp: <literal>@Dependent</literal>スコープを持ったWeb Beanは、<literal>InjectionPoint</literal>のインスタンスに注入を行い、Web Beanが属する注入箇所に関するメタデータにアクセスする可能性があります。
ko_kr: <literal>@Dependent</literal> 범위와 함께 Web Bean은 <literal>InjectionPoint</literal> 인스턴스를 삽입하고 해당 삽입 지점에 관련된 메타데이트를 액세스합니다.
zh_cn: 一个 <literal>@Dependent</literal> 范围的Web Bean可以注入一个 <literal>InjectionPoint</literal> 实例并且访问这个注入点相关的元数据。
zh_tw: 含有 <literal>@Dependent</literal> 這個 scope 的 Web Bean 能夠注入一個 <literal>InjectionPoint</literal> instance 並存取和它所屬的注入點相關的 metadata。

source: Let's look at an example. The following code is verbose, and vulnerable to refactoring problems:
de_de: Sehen wir uns ein Beispiel an. Der folgende Code ist umfangreich und empfänglich für Refaktorierungsprobleme:
es_es: Veamos un ejemplo. El código siguiente es detallado, y vulnerable a problemas de refactorización:
it_it: Vediamo un esempio. Il codice seguente è prolisso e vulnerabile a problemi di refactoring:
ja_jp: 例を見てみましょう。次のコードは、煩雑なうえに、リファクタリングしにくいコードです。
ko_kr: 다음 예를 살펴봅시다. 다음과 같은 코드는 프로그램을 리팩토링하기에 취약하고 장황합니다:
zh_cn: 我们看一个例子。下面的代码很冗长脆弱，有重构问题：
zh_tw: 讓我們來探討下列範例。下列程式碼較為冗長，並且有重構（refactoring）問題上的弱點：

source: This clever little producer method lets you inject a JDK <literal>Logger</literal> without explicitly specifying the log category:
de_de: Diese schlaue kleine Producer-Methode gestattet die Einspeisung eines JDK <literal>Logger</literal>, ohne dass explizit eine Protokollkategorie festgelegt werden müsste:
es_es: Este método inteligente de productor permite inyectar un <literal>Logger</literal> JDK sin especificar explícitamente la categoría de registro:
it_it: Questo piccolo e intelligente metodo produttore permette di iniettare un <literal>Logger</literal> JDK senza specificare esplicitamente la categoria di log:
ja_jp: 次の賢く小さなプロデューサメソッドは、明示的にログカテゴリを指定することなくJDKの<literal>Logger</literal>を注入します。
ko_kr: 이와 같이 현명한 생산자 방식은 로그 범주를 명시적으로 지정하지 않고 JDK <literal>Logger</literal>를 삽입하게 합니다:
zh_cn: 这个生产者方法允许你注入一个JDK的 <literal>Logger</literal> ，没有显式的指定一个日志分类：
zh_tw: 這個 producer method 能讓您在不明確指定 log category 的情況下注入一個 JDK <literal>Logger</literal>：

source: We can now write:
de_de: Wir können jetzt schreiben:
es_es: Ahora podemos escribir:
it_it: Ora è possibile scrivere:
ja_jp: これによって、次のような記述が可能になります。
ko_kr: 이제 다음을 작성할 수 있습니다:
zh_cn: 我们现在可以编写：
zh_tw: 現在我們可寫入：

source: Not convinced? Then here's a second example. To inject HTTP parameters, we need to define a binding type:
de_de: Sie sind noch nicht ganz überzeugt? Dann sehen Sie sich ein weiteres Beispiel an. Zur Einspeisung von HTTP-Parametern müssen wir einen Binding-Typ festlegen:
es_es: ¿No está convencido? Entonces, veamos un segundo ejemplo. Para inyectar parámetros, necesitamos definir el tipo de vinculación:
it_it: Non siete convinti? Eccovi un secondo esempio. Per iniettare parametri HTTP, è necessario definire un tipo di binding:
ja_jp: 納得できませんか？もう一つの例を見てみましょう。HTTPパラメタを注入するためには、バインディングタイプを定義する必要があります。
ko_kr: 확신하시지 않습니까? 그러시다면 여기에 두 번째 예제가 있습니다. HTTP 매개 변수를 삽입하려면, 바인딩 유형을 정의해야 합니다:
zh_cn: 没被说服？我们还有第二个例子。要注入HTTP参数，我们需要定一个绑定类型：
zh_tw: 若您無法被說服的話，我們還有第二個範例。若要注入 HTTP 參數，我們需要定義一個綁定類型：

source: We would use this binding type at injection points as follows:
de_de: Wir würden diesen Binding-Typ an Einspeisungspunkten wie folgt verwenden:
es_es: Utilizaríamos este tipo de enlace en puntos de inyección, como a continuación:
it_it: Potremmo usare questo tipo di binding in corrispondenza ai punti di iniezione in questo modo:
ja_jp: このバインディングタイプを注入箇所において、次のように使うことができます。
ko_kr: 다음과 같이 삽입 지점에서 이러한 바인딩 유형을 사용할 수 있습니다:
zh_cn: 我们可以在注入点使用这个绑定类型：
zh_tw: 我們可如下在注入點使用此綁定類型：

source: The following producer method does the work:
de_de: Die folgende Producer-Methode erledigt die Arbeit:
es_es: El siguiente método de productor sí funciona:
it_it: Il seguente metodo produttore esegue il lavoro:
ja_jp: 次のプロデューサメソッドが動作します。
ko_kr: 다음의 생산자 방식은 다음과 같이 작업합니다:
zh_cn: 下面的生产方法能够完成这个工作：
zh_tw: 下列 producer method 可完成此工作：

source: (Note that the <literal>value()</literal> member of the <literal>HttpParam</literal> annotation is ignored by the Web Bean manager since it is annotated <literal>@NonBinding.</literal>)
de_de: (Beachten Sie, dass das <literal>value()</literal>-Mitglied der <literal>HttpParam</literal>-Annotation vom Web Bean Manager wird, da es mit <literal>@NonBinding.</literal> annotiert ist)
es_es: (Observe que el miembro del <literal>valor()</literal> de la anotación <literal>HttpParam</literal> es ignorado por el administrador de Web Bean porque está anotado como <literal>@NonBinding.</literal>)
it_it: (Occorre notare che il membro <literal>value()</literal> dell'annotazione <literal>HttpParam</literal> viene ignorato dal manager Web Bean poiché è annotato con <literal>@NonBinding.</literal>)
ja_jp: （<literal>HttpParam</literal>アノテーションの<literal>value()</literal>メンバーは、<literal>@NonBinding</literal>アノテーションが付いているので、Web Beanマネージャには無視されることに注意して下さい。）
ko_kr: <literal>HttpParam</literal> 어노테이션의 <literal>value()</literal> 멤버는<literal>@NonBinding.</literal>을 어노테이션하므로 Web Bean 관리자에 의해 무시됨에 유의하시기 바랍니다.
zh_cn: (注意 <literal>HttpParam</literal> 注释的成员 <literal>value()</literal> 将被Web Bean管理器忽略，因为它拥有 <literal>@NonBinding.</literal> 注释)
zh_tw: （請注意，<literal>HttpParam</literal> 標記的 <literal>value()</literal> 成員已被 Web Bean 管理員忽略掉，因為它已被標記為 <literal>@NonBinding.</literal>）

source: The Web Bean manager provides a built-in Web Bean that implements the <literal>InjectionPoint</literal> interface:
de_de: Der Web Bean Manager liefert ein eingebautes Web Bean, das das <literal>InjectionPoint</literal>-Interface implementiert:
es_es: El administrador de Web Bean proporciona un Web Bean incorporado que implementa la interfaz <literal>InjectionPoint</literal>:
it_it: Il manager Web Bean fornisce un Web Bean di sistema che implementa l'interfaccia <literal>InjectionPoint</literal>:
ja_jp: Web Beanマネージャは<literal>InjectionPoint</literal>インタフェースを実装した組み込みWeb Beanを提供します。
ko_kr: Web Bean 관리자는 <literal>InjectionPoint</literal> 인터페이스를 구현하는 내장된 Web Bean을 제공합니다:
zh_cn: Web Bean管理器提供一个内置的实现 <literal>InjectionPoint</literal> 接口的Web Bean：
zh_tw: Web Bean 管理員提供了實做 <literal>InjectionPoint</literal> 介面的內建 Web Bean：

source: If you've been paying attention, you're probably wondering how the Web Bean manager decides which implementation &#151; <literal>ExternalPaymentProcessor</literal> or <literal>MockPaymentProcessor</literal> &#151; to choose. Consider what happens when the manager encounters this injection point:
de_de: Wenn Sie aufgepasst haben, fragen Sie sich jetzt wahrscheinlich, wie der Web Bean Manager entscheidet, welche Implementierung &#151; <literal>ExternalPaymentProcessor</literal> oder <literal>MockPaymentProcessor</literal> &#151; er wählt. Überlegen Sie sich, was passiert, wenn der Manager auf diesen Einspeisungspunkt trifft:
ja_jp: ここまで注意深く読み進めてきた方は、Web Beanマネージャが、一体どうやって<literal>ExternalPaymentProcessor</literal>と<literal>MockPaymentProcessor</literal>のどちらの実装を選択するかを決定するのかという点について、疑問に思われるかもしれません。マネージャがこのような注入箇所に遭遇した場合に、何が起こっているのかを考えてみましょう。
ko_kr: 관심을 기울이셨다면, Web Bean 관리자가 어떤 구현 &#151; <literal>ExternalPaymentProcessor</literal> 또는 <literal>MockPaymentProcessor</literal> &#151; 을 선택할 지를 어떻게 결정하는지에 대해 궁금해 하셨을 것입니다. 관리자기 이러한 삽입 지점에 이르렀을 때 무엇이 발생할 지를 고려합니다:
zh_cn: 如果你注意的话，你可能想知道Web Bean如何决定使用哪个实现&#151; <literal>ExternalPaymentProcessor</literal> 还是 <literal>MockPaymentProcessor</literal> &#151;。思考一下当管理器遇到这个注入点时会发生什么：

source: To fix an <literal>UnsatisfiedDependencyException</literal>, simply provide a Web Bean which implements the API type and has the binding types of the injection point &#151; or enable the deployment type of a Web Bean that already implements the API type and has the binding types.
de_de: Um eine <literal>UnsatisfiedDependencyException</literal> zu beheben, stellen Sie einfach ein Web Bean bereit, das den API-Typ implementiert und die Binding-Typen des Einspeisungspunkts besitzt&#151; oder aktivieren Sie den Deployment-Typ eines Web Beans, das den API-Typ bereits implementiert und die Binding-Typen besitzt.
ja_jp: <literal>UnsatisfiedDependencyException</literal>を修正するには、単に、注入箇所のAPIタイプを実装し、バインディングタイプを持つようなWeb Beanを作成するか、既にAPIタイプを実装し、バインディングタイプを持ったWeb Beanのデプロイメントタイプを有効にするだけです。
ko_kr: <literal>UnsatisfiedDependencyException</literal>을 수정하려면, API 유형을 구현하는 Web Bean을 제공하고 삽입 지점의 바인딩 유형을 갖거나 &#151; 또는 API 유형을 이미 구현하고 있는 Web Bean의 배치 유형을 활성화하고 바인딩 유형을 갖습니다.
zh_cn: 要修正一个 <literal>UnsatisfiedDependencyException</literal>，只须简单的提供一个实现API类型的Web Bean并且拥有注入点的绑定类型 &#151; 或者激活一个已经实现API类型并且拥有绑定类型的Web Bean的部署类型。

source: If the binding type has an annotation member, we can't use an anonymous subclass of <literal>AnnotationLiteral</literal> &#151; instead we'll need to create a named subclass:
de_de: Besitzt der Binding-Typ ein Annotationsmitglied, so können wir keine anonyme Unterklasse von <literal>AnnotationLiteral</literal> &#151; verwenden - stattdessen werden wir eine benannte Unterklasse erstellen müssen:
ja_jp: バインディングタイプがメンバーを持っている場合には、<literal>AnnotationLiteral</literal>の無名サブクラスを使うことはできません。代わりに、名前つきのサブクラスを作成する必要がでてきます。
ko_kr: 바인딩 유형이 어노테이션 멤버를 갖을 경우, <literal>AnnotationLiteral</literal>의 임의의 하부클래스를 사용할 수 없습니다 &#151; 대신 named 하부 클래스를 생성해야 합니다:
zh_cn: 如果绑定类型拥有一个注释成员，我们无法使用 <literal>AnnotationLiteral</literal> 的匿名子类&#151; 相反，我们需要创建一个具名子类：

source: There are certain kinds of dependent objects &#151; Web Beans with scope <literal>@Dependent</literal> &#151; that need to know something about the object or injection point into which they are injected in order to be able to do what they do. For example:
de_de: Es gibt bestimmte Arten abhängiger Objekte &#151; Web Beans mit Geltungsbereich <literal>@Dependent</literal> &#151; die etwas über das Objekt oder den Einspeisungspunkt in die sie eingespeist werden wissen müssen, um ihre Aufgabe zu erledigen. Zum Beispiel:
ja_jp: ある種の依存性を持ったオブジェクト、<literal>@Dependent</literal>スコープを持ったWeb Beanは、それらが機能するために注入されたオブジェクトや注入箇所についての情報が必要になります。例えば、
ko_kr: 특정 종류의 의존성 객체가 있습니다 &#151; <literal>@Dependent</literal> 범위와 함께 Web Beans &#151; 객체 또는 이는 실행 가능하게 되기 위해 삽입되는 삽입 지점에 관해 알아야 합니다. 예:
zh_cn: 我们有一些依赖对象&#151; <literal>@Dependent</literal> 范围的Web Bean &#151; 需要知道它们所注入的对象或者注入点的信息，以便能够实现其功能。例如：
