Repository: 1tchy/core
Catalog: reference/*/injection.po
Languages: de_de, es_es, it_it, ja_jp, ko_kr, zh_cn, zh_tw

source: Imagine that a Web Bean bound to the application scope held a direct reference to a Web Bean bound to the request scope. The application scoped Web Bean is shared between many different requests. However, each request should see a different instance of the request scoped Web bean!
de_de: Stellen wir uns vor, ein an den Geltungsbereich der Anwendung gebundenes Web Bean hielte einen direkten Verweis auf ein an den Geltungsbereich der Anfrage gebundenes Web Bean. Das an den Geltungsbereich der Anwendung gebundene Web Bean wird von vielen verschiedenen Anfragen geteilt. Jedoch sollte jede Anfrage eine andere Instanz des an den Geltungsbereich der Anfrage gebundenen Web Beans sehen!
es_es: Imagine que un Web Bean vinculado al ámbito de aplicación mantiene una referencia directa a un Web Bean vinculado al ámbito de petición. La aplicación en el ámbito de Web Bean es compartida entre muchas peticiones diferentes. No obstante, cada petición ¡debe ver una instancia diferente de la petición en el ámbito de WebBean!
it_it: Immaginiamo che un Web Bean associato allo scope applicazione tenga un riferimento diretto a un Web Bean associato allo scope richiesta. Il Web Bean con scope applicazione è condiviso fra molte diverse richieste. Comunque, ciascuna richiesta dovrebbe vedere una diversa istanza del Web bean con scope richiesta!
ja_jp: アプリケーションスコープに結び付けられたWeb Beanが、リクエストスコープに結び付けられたWeb Beanに対する直接的な参照を持っている場合を想像してみてください。アプリケーションスコープのWeb Beanは、たくさんの異なるリクエスト間で共有されます。しかしながら、それぞれのリクエストは、それぞれ異なったリクエストスコープのWeb Beanインスタンスを参照するべきなのです。
zh_cn: 想象一下如果一个应用范围的Web Bean能够拥有一个请求范围的Web Bean的直接引用。应用范围的Web Bean是被很多不同的请求共享的。但是不同的请求应该看到不同的请求范围的Web Bean实例！
zh_tw: 想像一個綁定至應用程式 scope 的 Web Bean 持有一個綁定至請求 scope 的 Web Bean 的直接參照。這個應用程式 scope 的 Web Bean 會在許多不同的請求之間被共享。不過，各個請求都應要看見一個不同的請求 scope Web Bean 的 instance！

source: Now imagine that a Web Bean bound to the session scope held a direct reference to a Web Bean bound to the application scope. From time to time, the session context is serialized to disk in order to use memory more efficiently. However, the application scoped Web Bean instance should not be serialized along with the session scoped Web Bean!
de_de: Stellen Sie sich nun vor das an den Geltungsbereich der Session gebundene Web Bean hielte einen direkten Verweis auf ein an den Geltungsbereich der Anwendung gebundenes Web Bean. FVon Zeit zu Zeit wird der Session Kontext auf Disk serialisiert, um den Speicher effizienter zu nutzen. Die durch den Geltungsbereich der Anwendung begrenzte Instanz des Web Beans sollte jedoch nicht mit dem durch den Geltungsbereich der Session begrenzetn Web Bean serialisiert werden!
es_es: Ahora imaginemos que un enlace de Web Bean a la sesión mantiene una referencia directa a un Web Bean enlazado al ámbito de la aplicación. De vez en cuando, el contexto de sesión se serializa al disco con el fin de utilizar la memoria de un modo más eficiente. Sin embargo, la aplicación en el ámbito de la instancia de Web Bean ¡no debe serializarse junto con la sesión en el ámbito de Web Bean!
it_it: Immaginiamo ora che un Web Bean con scope sessione abbia un riferimento diretto a un Web Bean con scope applicazione . Ogni tanto, il contesto della sessione viene serializzato su disco in modo da usare la memoria in modo più efficiente. Comunque, l'istanza del Web Bean con scope applicazione non dovrebbe essere serializzato insieme al Web Bean con scope sessione!
ja_jp: 今度は、セッションスコープに結び付けられたWeb Beanが、アプリケーションスコープに結び付けられたWeb Beanに対する直接的な参照を持っている場合を想像してみてください。セッションコンテキストは、メモリを効率的に使う目的で、時々ディスクにシリアライズされます。しかしながら、アプリケーションスコープのWeb Beanインスタンスは、セッションスコープのWeb Beanインスタンスと一緒にシリアライズされるべきではないのです。
zh_cn: 现在再想象一个会话范围的Web Bean拥有一个应用范围的Web Bean的直接引用，会话上下文常常被序列化到硬盘以便更高效的使用内存。但是，应用范围的Web Bean实例不能和会话范围的Web Bean一起被序列化！
zh_tw: 現在，請想像一個綁定至 session scope 的 Web Bean 持有一個綁定至應用程式 scope 的 Web Bean 的直接參照。有時，session context 會被序列化至磁碟中以便更有效率地使用記憶體。不過，應用程式 scope 的 Web Bean instance 不該和 session scope 的 Web Bean 一起被序列化！

source: Therefore, unless a Web Bean has the default scope <literal>@Dependent</literal>, the Web Bean manager must indirect all injected references to the Web Bean through a proxy object. This <emphasis>client proxy</emphasis> is responsible for ensuring that the Web Bean instance that receives a method invocation is the instance that is associated with the current context. The client proxy also allows Web Beans bound to contexts such as the session context to be serialized to disk without recursively serializing other injected Web Beans.
de_de: Daher muss der Web Bean Manageralle eingespeisten Verweise auf das Web Bean durch ein Proxy-Objekt einleiten, wenn das Web Bean nicht den Standard-Geltungsbereich <literal>@Dependent</literal> besitzt. Dieser <emphasis>Client-Proxy</emphasis> ist verantwortlich dafür sicher zu stellen, dass die einen Methodenaufruf erhaltende Web Bean Instanz, die mit dem aktuellen Kontext assoziierte ist. Der Client-Proxy gestattet außerdem die Serialisierung auf Disk von an Kontexte gebundenen Web Beans, ohne dassrekursiv andere eingespeiste Web Beans serialisiert werden.
es_es: Por lo tanto, a menos que un Web Bean tenga un ámbito predeterminado <literal>@Dependent</literal>, el administrador de Web Bean deberá direccionar indirectamente todas las referencias inyectadas al Web Bean a través del objeto de proxy. Este <emphasis>proxy de cliente</emphasis> responsable de garantizar que la instancia de Web Bean reciba un método de invocación es la instancia asociada con el contexto actual. El proxy de cliente también permite a los Web Beans vincularse a contextos tales como el contexto de sesión que debe serializarse al disco sin serializar de modo recursivo a otros Web Beans inyectados.
it_it: Quindi, a meno che un Web Bean abbia lo scope predefinito <literal>@Dependent</literal>, il manager Web Bean deve rendere indiretti tutti i riferimenti al Web Bean iniettati attraverso un oggetto proxy. Questo <emphasis>client proxy</emphasis> ha la responsabilità di assicurare che l'istanza del Web Bean su cui viene invocato un metodo sia l'istanza associata al contesto corrente. Il client proxy, inoltre, permette ai Web Bean associati a contesti come quello di sessione di essere salvati su disco senza serializzare ricorsivamente altri Web Beans che siano stati iniettati.
ja_jp: それゆえWeb Beanマネージャは、Web Beanがデフォルトスコープである<literal>@Dependent</literal>を持っていない限り、すべての注入されたWeb Beanへの参照を、プロキシオブジェクトを通じて間接的に行わなければなりません。この<emphasis>クライアントプロキシ</emphasis>は、メソッドが起動されるWeb Beanインスタンスと、現在のコンテキストに結びついたインスタンスが同一であることを保証する責任を持ちます。またクライアントプロキシは、セッションコンテキストのようなコンテキストに結び付けられたWeb Beanが、他の注入されたWeb Beanを再帰的にシリアライズすることなく、シリアライズすることを可能とします。
zh_cn: 因此，除非Web Bean使用默认的 <literal>@Dependent</literal> 的范围，Web Bean管理器必须通过一个代理对象来间接地拥有所有注入的Web Bean引用。这个 <emphasis>客户代理</emphasis> 负责确保收到方法调用的Web Bean实例就是当前上下文相关联的实例。客户代理也允许诸如绑定到会话上下文的Web Bean可以序列化到硬盘中，而无需递归地序列化注入到这个Web Bean中的其他的Web Bean。
zh_tw: 因此，除非有個 Web Bean 擁有預設的 <literal>@Dependent</literal> scope，否則 Web Bean 管理員便必須透過一個 proxy 物件來將所有注入的參照重新指向 Web Bean。這個 <emphasis>client proxy</emphasis> 負責確保收到 method 調用的 Web Bean instance 是個和目前 context 相聯的 instance。客戶端 proxy 亦可允許在不遞迴地序列化其它已注入的 Web Bean 的情況下也能讓綁定至 context（例如 session context）的 Web Bean 被序列化至磁碟。

source: Unfortunately, due to limitations of the Java language, some Java types cannot be proxied by the Web Bean manager. Therefore, the Web Bean manager throws an <literal>UnproxyableDependencyException</literal> if the type of an injection point cannot be proxied.
de_de: Leider können aufgrund von Einschränkungen von Java einige Java-Typen nicht vom Web Bean Manager geproxiet werden. Daher meldet der Web Bean Manager eine <literal>UnproxyableDependencyException</literal>, wenn der Typ eines Einspeisungspunkts nicht geproxiet werden kann.
es_es: Lamentablemente, debido a limitaciones del lenguaje de Java, el administrador de Web Bean no puede utilizar proxy en algunos tipos de Java. Por lo tanto, el administrador de Web Bean produce un <literal>UnproxyableDependencyException</literal> si no se puede aplicar proxy al tipo de un punto de inyección.
it_it: Purtroppo, a causa di limitazioni del linguaggio Java, alcuni tipi Java non possono essere gestiti tramite un proxy dal manager Web Bean. Quindi, il manager Web Bean lancia un'eccezione <literal>UnproxyableDependencyException</literal> se il tipo di un punto di iniezione non può essere gestito tramite proxy.
ja_jp: 不幸にも、Java言語の制限により、いくつかのJavaタイプはWeb Beanマネージャがプロキシ化することができません。それゆえ、注入箇所のタイプがプロキシ化できないものである場合、Web Beanマネージャは<literal>UnproxyableDependencyException</literal>をスローします。
ko_kr: Java 언어의 한계로 인해, 일부 Java 유형은 Web Bean 관리자에 의해 프록시될 수 없습니다. 따라서, 삽입 지점 유형이 프록시될 수 없을 경우 Web Bean 관리자는 <literal>UnproxyableDependencyException</literal>을 던지게 됩니다.
zh_cn: 不幸的是，由于Java语言的限制，一些Java类型无法被Web Bean管理器代理。因此，如果注入点的类型无法被代理的话，Web Bean管理器会抛出一个 <literal>UnproxyableDependencyException</literal> 异常。
zh_tw: 不巧的是，礙於 Java 語言的限制，有些 Java 類型無法被 Web Bean 管理員代理（proxied）。因此，若某個注入點的 type 無法被代理的話，Web Bean 管理員便會回傳一個 <literal>UnproxyableDependencyException</literal>。

source: The following Java types cannot be proxied by the Web Bean manager:
de_de: Die folgenden Java-Typen können nicht durch den Web Bean Manager geproxiet werden:
es_es: El administrador de Web Bean no puede aplicar proxy en los siguientes tipos de Java:
it_it: I seguenti tipi Java non possono essere gestiti tramite proxy dal manager Web Bean:
ja_jp: 次に挙げるJava型はWeb Beanマネージャがプロキシ化することができません。
ko_kr: 다음과 같은 Java 유형은 Web Bean 관리자에 의해 프록시될 수 없습니다:
zh_cn: 下面的Java类型无法被Web Bean管理器代理：
zh_tw: 下列 Java 類型無法被 Web Bean 管理員代理：

source: classes which are declared <literal>final</literal> or have a <literal>final</literal> method,
de_de: Als <literal>final</literal> deklarierte Klassen oder die eine <literal>final</literal>-Methode besitzen,
es_es: las clases que son declaradas <literal>final</literal> o tienen un método <literal>final</literal>,
it_it: classi dichiarate <literal>final</literal> o che abbiano un metodo <literal>final</literal>,
ja_jp: <literal>final</literal>宣言されたクラスや、<literal>final</literal>メソッドを持つクラス
ko_kr: <literal>final</literal>이라고 명시되어 있거나 또는 <literal>final</literal> 방식을 갖는 클래스,
zh_cn: 声明为 <literal>final</literal> 的类或者拥有 <literal>final</literal> 方法的类，
zh_tw: 所有被宣告 <literal>final</literal> 或是含有一個 <literal>final</literal> method 的 class、

source: classes which have no non-private constructor with no parameters, and
de_de: Klassen, die keinen nicht-privaten Konstruktor ohne Parameter besitzen sowie
es_es: las clases que no tienen un constructor no-privado sin parámetros y
it_it: classi che non abbiano costruttori non privati (non-private) senza parametri, e
ja_jp: プライベートでなく、引数を持たないコンストラクタを持たないクラス
ko_kr: 매개 변수 없는 비전용 생성자를 갖지 않는 클래스,
zh_cn: 没有无参非私有构造器的类，以及
zh_tw: 沒有非私密 constructor 的無參數 class，以及

source: arrays and primitive types.
de_de: Arrays und primitive Typen.
es_es: matrices y tipos primarios.
it_it: array e tipi primitivi.
ja_jp: 配列とプリミティブ型
ko_kr: 배열 및 기본 유형
zh_cn: 数组和原始类型。
zh_tw: 陣列（array）與基本型別（primitive type）。

source: It's usually very easy to fix an <literal>UnproxyableDependencyException</literal>. Simply add a constructor with no parameters to the injected class, introduce an interface, or change the scope of the injected Web Bean to <literal>@Dependent</literal>.
de_de: Es ist in der Regel ganz leicht eine <literal>UnproxyableDependencyException</literal> zu beheben. Fügen Sie der eingespeisten Klasse einfach einen Konstruktor ohne Parameters hinzu, führen Sie ein Interface ein oder ändern Sie den Gelstungsbereich des eingespeisten Web Bean zu <literal>@Dependent</literal>.
es_es: Suele ser muy fácil corregir una <literal>UnproxyableDependencyException</literal>. Basta con añadir un constructor sin parámetros a la clase inyectada, introducir una interfaz, o cambiar el ámbito del Web Bean inyectado a <literal>@Dependent</literal>.
it_it: Di solito è molto facile rimediare a una <literal>UnproxyableDependencyException</literal>. Si deve semplicimente aggiungere un costruttore privo di parametri alla classe iniettata, introdurre un'interfaccia, o modificare lo scope del Web Bean iniettato a <literal>@Dependent</literal>.
ja_jp: 通常、<literal>UnproxyableDependencyException</literal>を修正することはとても簡単です。単に、引数のないコンストラクタを注入されるクラスに追加したり、インタフェースを導入したり、注入されるWeb Beanのスコープを<literal>@Dependent</literal>に変更するだけです。
ko_kr: <literal>UnproxyableDependencyException</literal>을 수정하기 쉽습니다. 간단하게 삽입된 클래스에 매개 변수가 없는 생성자를 추가하고, 인터페이스를 소개하거나, 삽입된 Web Bean의 범위를 <literal>@Dependent</literal>로 변경합니다.
zh_cn: 修正 <literal>UnproxyableDependencyException</literal> 很容易。只需简单的想注入类添加一个无参构造器，引入一个接口或者将注入的Web Bean的范围 <literal>@Dependent</literal> 即可。
zh_tw: 要修正 <literal>UnproxyableDependencyException</literal> 通常相當容易。只要將一個無參數的 constructor 附加至注入的 class、採用一個介面，或將已注入的 Web Bean 的 scope 更改為 <literal>@Dependent</literal> 即可。

source: Obtaining a Web Bean by programatic lookup
de_de: Erhalt eines Web Beans durch programmatsichen "Lookup"
es_es: Obtención de un Web Bean por búsqueda programática
it_it: Ottenere un riferimento a un Web Bean via codice
ja_jp: ルックアップ処理によるWeb Beanの取得
ko_kr: 프로그램적 lookup에 의해 Web Bean 획득
zh_cn: 通过编程查找获得一个Web Bean
zh_tw: 透過程式性的搜尋來取得一個 Web Bean

source: The application may obtain an instance of the interface <literal>Manager</literal> by injection:
de_de: Die Anwendung kann durch Einspeisung eine Instanz des Interface <literal>Manager</literal> erhalten:
es_es: La aplicación puede obtener una instancia de la interfaz <literal>Manager</literal> a través de inyección:
it_it: L'applicazione può ottenere un'istanza dell'interfaccia <literal>Manager</literal> attraverso iniezione:
ja_jp: アプリケーションは注入によって、<literal>Manager</literal>インタフェースを持つインスタンスを取得することができます。
ko_kr: 애플리케이션은 삽입에 의해 <literal>Manager</literal> 인터페이스의 인스턴스를 획득할 수 있습니다:
zh_cn: 应用可以通过注入获得一个 <literal>Manager</literal> 接口实例：
zh_tw: 應用程式可透過注入來取得 <literal>Manager</literal> 這個介面的一個 instance：

source: The <literal>Manager</literal> object provides a set of methods for obtaining a Web Bean instance programatically.
de_de: Das <literal>Manager</literal>-Objekt liefert einen Satz von Methoden zum programmatischen Erhalt einer Web Bean Instanz.
es_es: El objeto <literal>Manager</literal> proporciona un grupo de métodos para obtener una instancia de Web Bean en forma programática.
it_it: L'oggetto <literal>Manager</literal> fornisce un insieme di metodi per ottenere l'istanza di un Web Bean via codice.
ja_jp: <literal>Manager</literal>オブジェクトは、Web Beanインスタンスをプログラミングによって取得するための、メソッド群を提供します。
ko_kr: <literal>Manager</literal> 객체는 프로그램적으로 Web Bean 인스턴스의 획득을 위한 방식 모음을 제공합니다.
zh_cn: <literal>Manager</literal> 对象提供一套通过编程获得一个Web Bean实例的方法。
zh_tw: <literal>Manager</literal> 這個物件提供了一組用來程式性地取得 Web Bean instance 的 method。

source: Binding annotations may be specified by subclassing the helper class <literal>AnnotationLiteral</literal>, since it is otherwise difficult to instantiate an annotation type in Java.
de_de: Binding-Annotationen können durch Subklassifizierung der Helferklasse <literal>AnnotationLiteral</literal> festgelegt werden, da es ansonsten schwierig ist, einen Annotationstyp in Java zu instantiieren.
es_es: Las anotaciones de enlace se pueden especificar a través de subclasificaciones de la clase auxiliar <literal>AnnotationLiteral</literal>, porque de otra manera es difícil instanciar un tipo de anotación en Java.
it_it: Le binding annotation possono essere specificate come sottoclassi della classe helper <literal>AnnotationLiteral</literal>, poiché è altrimenti difficile istanziare un tipo annotazione in Java.
ja_jp: バインディングアノテーションは、ヘルパークラス<literal>AnnotationLiteral</literal>をサブクラス化することによって指定します。これは、その他の方法では、Javaのアノテーションタイプをインスタンス化することは難しいからです。
ko_kr: 바인딩 어노테이션은 <literal>AnnotationLiteral</literal> 도우미 클래스를 하부클래스화하여 지정될 수 있으며, 그렇지 않으면 Java에서 어노테이션 유형을 인스턴스화하기 어렵습니다.
zh_cn: 绑定注释可以通过编写一个帮助类 <literal>AnnotationLiteral</literal> 的子类来指定，否则很难在Java中实例化一个注释类型。
zh_tw: 綁定標記能被透過建立 helper class 的 subclass <literal>AnnotationLiteral</literal> 來指定，否則在 Java 中很難例示一個標記類型。

source: If the binding type has an annotation member, we can't use an anonymous subclass of <literal>AnnotationLiteral</literal>&#151;instead we'll need to create a named subclass:
es_es: Si el tipo de vinculación tiene un miembro de anotación, no podemos utilizar una subclase anónima de <literal>AnnotationLiteral</literal>&#151;en su lugar, necesitaremos crear una subclase llamada:
it_it: Se il tipo di binding ha un membro annotazione, non è possibile utilizzare una sottoclasse anonima di <literal>AnnotationLiteral</literal>&#151;sarà invece necessario creare una sottoclasse non anonima:
zh_tw: 若綁定類型有個標記成員，我們便無法使用 <literal>AnnotationLiteral</literal> 的一個匿名 subclass&#151;我們需要建立一個有命名的 subclass：

source: Lifecycle callbacks, <literal>@Resource</literal>, <literal>@EJB</literal> and <literal>@PersistenceContext</literal>
de_de: Lebenszyklus-Callbacks, <literal>@Resource</literal>, <literal>@EJB</literal> und <literal>@PersistenceContext</literal>
es_es: El ciclo de vida de los callbacks, <literal>@Resource</literal>, <literal>@EJB</literal> y <literal>@PersistenceContext</literal>
it_it: Lifecycle callbacks, <literal>@Resource</literal>, <literal>@EJB</literal> e <literal>@PersistenceContext</literal>
ja_jp: ライフサイクルコールバック、<literal>@Resource</literal>、<literal>@EJB</literal>、<literal>@PersistenceContext</literal>
ko_kr: 수명 주기 콜백, <literal>@Resource</literal>, <literal>@EJB</literal> 및 <literal>@PersistenceContext</literal>
zh_cn: 生命周期回调方法，<literal>@Resource</literal>， <literal>@EJB</literal> 和 <literal>@PersistenceContext</literal>
zh_tw: Lifecycle callback、<literal>@Resource</literal>、<literal>@EJB</literal> 和 <literal>@PersistenceContext</literal>

source: Enterprise Web Beans support all the lifecycle callbacks defined by the EJB specification: <literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, <literal>@PrePassivate</literal> and <literal>@PostActivate</literal>.
de_de: Enterprise Web Beans unterstützen alle durch die EJB-Spezifikation definierten Lebenszyklus-Callbacks: <literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, <literal>@PrePassivate</literal> und <literal>@PostActivate</literal>.
es_es: Los Web Beans de empresa admiten todos los ciclos de vida de las devoluciones de llamadas definidas por la especificación EJB: <literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, <literal>@PrePassivate</literal> y <literal>@PostActivate</literal>.
it_it: I Web Beans di tipo enterprise supportano tutte le callback del ciclo di vita definite dalle specifiche EJB: <literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, <literal>@PrePassivate</literal> e <literal>@PostActivate</literal>.
ja_jp: エンタープライズWeb BeanはEJB仕様で定められたすべてのライフサイクルコールバックをサポートします。<literal>@PostConstruct</literal>、<literal>@PreDestroy</literal>、<literal>@PrePassivate</literal>、<literal>@PostActivate</literal>などです。
ko_kr: Enterprise Web Beans는 EJB 사양에 의해 정의된 모든 수명 주기 콜백을 지원합니다: <literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, <literal>@PrePassivate</literal> 및 <literal>@PostActivate</literal>.
zh_cn: 企业级Web Beans支持所有EJB规范定义的生命周期回调方法：<literal>@PostConstruct</literal>, <literal>@PreDestroy</literal>, <literal>@PrePassivate</literal> 和 <literal>@PostActivate</literal>。
zh_tw: 企業級的 Web Bean 支援 EJB 規格所定義的所有 lifecycle callback：<literal>@PostConstruct</literal>、<literal>@PreDestroy</literal>、<literal>@PrePassivate</literal> 和 <literal>@PostActivate</literal>。

source: Simple Web Beans support only the <literal>@PostConstruct</literal> and <literal>@PreDestroy</literal> callbacks.
de_de: Einfache Web Beans unterstützen nur die <literal>@PostConstruct</literal> und <literal>@PreDestroy</literal> Callbacks.
es_es: Los Web Beans sencillos admiten únicamente las devoluciones de llamadas <literal>@PostConstruct</literal> y <literal>@PreDestroy</literal>.
it_it: Semplici Web Bean supportano soltanto le callback <literal>@PostConstruct</literal> e <literal>@PreDestroy</literal>.
ja_jp: シンプルWeb Beanは<literal>@PostConstruct</literal>と<literal>@PreDestroy</literal>のみをコールバックとしてサポートします。
ko_kr: Simple Web Beans는 <literal>@PostConstruct</literal> 및 <literal>@PreDestroy</literal> 콜백 기능만을 지원합니다.
zh_cn: 简单的Web Bean只支持 <literal>@PostConstruct</literal> 和 <literal>@PreDestroy</literal> 回调。
zh_tw: 基本的 Web Bean 只支援 <literal>@PostConstruct</literal> 和 <literal>@PreDestroy</literal> callback。

source: Both enterprise and simple Web Beans support the use of <literal>@Resource</literal>, <literal>@EJB</literal> and <literal>@PersistenceContext</literal> for injection of Java EE resources, EJBs and JPA persistence contexts, respectively. Simple Web Beans do not support the use of <literal>@PersistenceContext(type=EXTENDED)</literal>.
de_de: Sowohl Enterprise als auch einfache Web Beans unterstützen den Gebrauch von <literal>@Resource</literal>, <literal>@EJB</literal> und <literal>@PersistenceContext</literal> zur Einspeisung von Java EE Ressourcen bzw. EJBs und JPA-Persistenzkontexten. Einfache Web Beans unterstützen den Gebrauch von <literal>@PersistenceContext(type=EXTENDED)</literal> nicht.
es_es: Web Beans sencillos y empresariales soportan el uso de <literal>@Resource</literal>, <literal>@EJB</literal> y <literal>@PersistenceContext</literal> para inyección de recursos de Java EE, EJB y contextos de persistencia JPA, respectivamente. Web Beans sencillos no admiten el uso de <literal>@PersistenceContext(type=EXTENDED)</literal>.
it_it: Sia i Web Bean semplici che quelli enterprise supportano l'uso di <literal>@Resource</literal>, <literal>@EJB</literal> e <literal>@PersistenceContext</literal> per l'iniezione rispettivamente di risorse Java EE, di EJB e di contesti di persistenza JPA. I Web Bean semplici non supportano l'uso di <literal>@PersistenceContext(type=EXTENDED)</literal>.
ja_jp: エンタープライズWeb Beanも、シンプルWeb Beasも、<literal>@Resource</literal>や<literal>@EJB</literal>や<literal>@PersistenceContext</literal>を使用して、それぞれJava EEのリソース、EJB、JPAの永続化コンテキストの注入を行うことをサポートします。シンプルWeb Beanは<literal>@PersistenceContext(type=EXTENDED)</literal>の使用をサポートしません。
ko_kr: enterprise 및 simple Web Beans는 Java EE 리소스 삽입, EJB 및 JPA 영구적 컨텍스에 대해 <literal>@Resource</literal>, <literal>@EJB</literal> 및 <literal>@PersistenceContext</literal>의 사용을 각각 지원합니다. Simple Web Beans는 <literal>@PersistenceContext(type=EXTENDED)</literal>의 사용을 지원하지 않습니다.
zh_cn: 企业级和简单的Web Bean都支持使用f <literal>@Resource</literal>, <literal>@EJB</literal> 和 <literal>@PersistenceContext</literal> 来分别注入Java EE资源，EJB和JPA持久化上下文。简单的Web Bean不支持使用 <literal>@PersistenceContext(type=EXTENDED)</literal> 。
zh_tw: 企業級和基本的 Web Bean 皆支援使用 <literal>@Resource</literal>、<literal>@EJB</literal> 和 <literal>@PersistenceContext</literal> 來相應地注入 Java EE 資源、EJB 和 JPA 的 persistence context。基本的 Web Bean 不支援使用 <literal>@PersistenceContext(type=EXTENDED)</literal>。

source: The <literal>@PostConstruct</literal> callback always occurs after all dependencies have been injected.
de_de: Der <literal>@PostConstruct</literal>-Callback erfolgt immer, nachdem alle Abhängigkeiten eingespeist wurden.
es_es: La devolución de llamada <literal>@PostConstruct</literal> siempre se presenta tras la inyección de todas las dependencias.
it_it: La callback <literal>@PostConstruct</literal> viene sempre eseguita dopo che tutte le dipendenze sono state iniettate.
ja_jp: <literal>@PostConstruct</literal>コールバックは、なんらかの依存性注入が行われた後、毎回実行されます。
ko_kr: <literal>@PostConstruct</literal> 콜백은 모든 의존성이 삽입된 후에 나타납니다.
zh_cn: <literal>@PostConstruct</literal> 调用总是在所有依赖注入之后发生。
zh_tw: <literal>@PostConstruct</literal> callback 一定會在所有相依性都被注入後才會發生。

source: The <literal>InjectionPoint</literal> object
de_de: Das <literal>InjectionPoint</literal>-Objekt
es_es: El objeto <literal>InjectionPoint</literal>
it_it: L'oggetto <literal>InjectionPoint</literal>
ja_jp: <literal>InjectionPoint</literal>オブジェクト
ko_kr: <literal>InjectionPoint</literal> 객체
zh_cn: <literal>InjectionPoint</literal> 对象
zh_tw: <literal>InjectionPoint</literal> 物件
