Repository: 1tchy/core
Catalog: reference/*/injection.po
Languages: de_de, es_es, it_it, ja_jp, ko_kr, zh_cn, zh_tw

source: You can tell the Web Bean manager to ignore a member of a binding annotation type by annotating the member <literal>@NonBinding</literal>.
de_de: Sie können den Web Bean Manager anweisen, ein Mitglied eines Binding-Annotationstyps zu ignorieren, indem Sie das Mitglied mit <literal>@NonBinding</literal> annotieren.
es_es: Se puede pedir al administrador de Web Bean que ignore a un miembro de un tipo de anotación de enlace anotando al miembro <literal>@NonBinding</literal>.
it_it: E' possibile indicare al manager Web Bean di ignorare un membro di un tipo di binding annotation annotando il membro con <literal>@NonBinding</literal>.
ja_jp: バインディングアノテーションタイプのメンバーに@NonBindingアノテーションをつけることによって、Web Beanマネージャがメンバを無視するように指定することもできます。
ko_kr: Web Bean 관리자에게 <literal>@NonBinding</literal> 멤버를 어노테이션하여 바인딩 어노테이션 유형 멤버를 무시하라고 말할 수 있습니다.
zh_cn: 你可以告诉Web Bean管理器忽略一个绑定注释的成员，只需在这个成员上使用 <literal>@NonBinding</literal> 注释。
zh_tw: 您可藉由標記 <literal>@NonBinding</literal> 這個 member 來讓 Web Bean 管理員忽略某個綁定標記類型的成員。

source: Combinations of binding annnotations
de_de: Kombinationen von Binding-Annnotationen
es_es: Combinaciones de anotaciones de enlace
it_it: Combinazioni di binding annotation
ja_jp: バインディングアノテーションの組み合わせ
ko_kr: 바인딩 어노테이션의 조합
zh_cn: 绑定注释的组合
zh_tw: 綁定標記的組合

source: An injection point may even specify multiple binding annotations:
de_de: Ein Einspeisungspunkt kann sogar mehrere Binding-Annotationen festlegen:
es_es: Un punto de inyección puede incluso especificar múltiples anotaciones de enlace:
it_it: Un punto di iniezione può anche specificare più binding annotation:
ja_jp: 注入箇所に、複数のバインディングアノテーションを指定することもできます。
ko_kr: 삽입 지점은 여러 바인딩 어노테이션을 지정할 수 도 있습니다:
zh_cn: 一个注入点甚至可以指定多个绑定注释：
zh_tw: 一個注入點甚至有可能會指定多重綁定標記：

source: In this case, only a Web Bean which has <emphasis>both</emphasis> binding annotations would be eligible for injection.
de_de: In diesem Fall würde nur ein Web Bean mit <emphasis>beiden</emphasis> Binding-Annotationen eingespeist.
es_es: En este caso, sólo el Web Bean que tiene <emphasis>ambas</emphasis> anotaciones de enlace sería elegible para inyección.
it_it: In questo caso, soltanto un Web Bean che ha <emphasis>entrambe</emphasis> le binding annotation sarebbe candidato ad essere iniettato.
ja_jp: このような場合、<emphasis>両方の</emphasis>バインディングアノテーションを持つWeb Beanのみが、注入する対象として適格となります。
ko_kr: 이러한 경우, <emphasis>양쪽</emphasis> 바인딩 어노테이션을 갖는 Web Bean만 삽입될 수 있습니다.
zh_cn: 在这个情况下，只有<emphasis>拥有两个</emphasis>绑定注释的Web Bean才有资格被注入。
zh_tw: 在這種情況下，只有擁有這<emphasis>兩個</emphasis>綁定標記的 Web Bean 可被注入。

source: Binding annotations and producer methods
de_de: Binding-Annotationen und Producer-Methoden
es_es: Anotaciones de enlace y métodos de productor
it_it: Binding annotation e metodi produttori
ja_jp: バインディングアノテーションとプロデューサメソッド
ko_kr: 바인딩 어노테이션 및 생산자 방식
zh_cn: 绑定注释和生产者方法
zh_tw: 綁定標記和 producer method

source: Even producer methods may specify binding annotations:
de_de: Sogar Producer-Methoden können Binding-Annotationen festlegen:
es_es: Incluso los métodos de productor pueden especificar anotaciones de enlace:
it_it: Anche i metodi produttori possono specificare binding annotation:
ja_jp: プロデューサメソッドでバインディングアノテーションを指定することもできます。
ko_kr: 생산자 방식은 바인딩 어노테이션을 지정할 수 도 있습니다:
zh_cn: 甚至生产者方法可以指定绑定注释：
zh_tw: 就連 producer method 也能指定綁定標記：

source: The default binding type
de_de: Der standardmäßige Binding-Typ
es_es: El tipo de enlace predeterminado
it_it: The tipo di binding predefinito
ja_jp: デフォルトのバインディングタイプ
ko_kr: 기본값 바인딩 유형
zh_cn: 默认的绑定类型
zh_tw: 預設綁定類型

source: Web Beans defines a binding type <literal>@Current</literal> that is the default binding type for any injection point or Web Bean that does not explicitly specify a binding type.
de_de: Web Beans definiert einen Binding-Typ <literal>@Current</literal>, der der standardmäßige Binding-Typ für jeden Einspeisungspunkt oder Web Bean ist, der nicht explizit einen Binding-Typ festlegt.
es_es: Web Beans define un tipo de enlace <literal>@Current</literal>, el cual es el tipo de enlace predeterminado para cualquier punto de inyección o Web Bean que no especifique explícitamente un tipo de enlace.
it_it: Web Beans definisce un tipo di binding <literal>@Current</literal> che è il tipo di binding predefinito per ogni punto di iniezione o per ogni Web Bean che non specifichi esplicitamente un tipo di binding.
ja_jp: Web Beansでは、デフォルトのバインディングタイプ<literal>@Current</literal>が定義されており、明示的なバインディングタイプの指定が行われていないすべての注入箇所やWeb Beanに適用されます。
ko_kr: Web Beans는 명확하게 바인딩 유형을 지정하지 않은 Web Bean이나 또는 삽입 지점에 대한 기본값 바인딩 유형인 <literal>@Current</literal> 바인딩 유형을 정의합니다.
zh_cn: Web Beans定义了一个 <literal>@Current</literal> 绑定类型，这个绑定类型是任何注入点或者没有显式指定绑定类型的Web Bean的默认绑定类型。
zh_tw: Web Bean 定義了一個綁定類型 <literal>@Current</literal>，這是個任何未明確指定綁定類型的注入點或 Web Bean 的預設綁定類型。

source: There are two common circumstances in which it is necessary to explicitly specify <literal>@Current</literal>:
de_de: Es existieren zwei gängige Umstände, bei denen es notwendig ist, <literal>@Current</literal> festzulegen:
es_es: Hay dos circunstancias comunes en que se necesita especificar explícitamente a <literal>@Current</literal>:
it_it: Vi sono due circostanze comuni in cui è necessario specificare esplicitamente l'annotazione <literal>@Current</literal>:
ja_jp: 以下の二つの状況においては、<literal>@Current</literal>を明示的に指定する必要があります。
ko_kr: <literal>@Current</literal>를 지정하기 위해 필요한 일반적인 환경이 두 가지 있습니다:
zh_cn: 通常有两种环境需要我们显式地指定<literal>@Current</literal> ：
zh_tw: 一般來講，在兩個情況下會需要明確地指定 <literal>@Current</literal>：

source: on a field, in order to declare it as an injected field with the default binding type, and
de_de: An einem Feld, um es als eingespeistes Feld zu deklarieren mit dem standardmäßigen Binding-Typ und
es_es: en un campo, para declararlo como un campo inyectado con el tipo de enlace por defecto, y
it_it: su un campo, allo scopo di dichiararne l'iniezione con il tipo di binding predefinito, and
ja_jp: フィールドの定義において、そのフィールドがデフォルトのバインディングタイプによって注入される（フィールドが持つ型によって解決される）フィールドであることを宣言する場合
ko_kr: 기본값 바인딩 유형과 함께 삽입 영역으로 이를 명시하기 위한 영역에서
zh_cn: 在一个域上指定，以便声明这是一个拥有默认绑定类型的注入域，以及
zh_tw: 在一個 field 上，為了要將該 field 宣告為含有預設綁定類型的已注入欄位，以及

source: on a Web Bean which has another binding type in addition to the default binding type.
de_de: an einem Web Bean, das neben dem standardmäßigen Binding-Type einen weiteren Binding-Typ besitzt.
es_es: en un Web Bean, el cual tiene otro tipo de enlace además del tipo de enlace predeterminado.
it_it: su un Web Bean che ha un tipo di binding aggiuntivo rispetto al tipo di binding predefinito.
ja_jp: Web Beanの定義において、そのWeb Beanがデフォルトのバインディングタイプ（Web Beanが持つ型によって解決される）に加えて別のバインディングタイプを持つ場合
ko_kr: 기본값 바인딩 유형에 더하여 다른 바인딩 유형을 갖는 Web Bean에서
zh_cn: 在一个Web Bean上指定，这个Web Bean除了默认的绑定类型之外还拥有其他的绑定类型。
zh_tw: 在一個除了預設綁定類型之外還另擁有一個綁定類型的 Web Bean 上。

source: Deployment types
de_de: Deployment Typen
es_es: Tipos de despliegue
it_it: Tipi di deploy
ja_jp: デプロイメントタイプ
ko_kr: 배치 유형
zh_cn: 部署类型
zh_tw: 建置類型

source: All Web Beans have a <emphasis>deployment type</emphasis>. Each deployment type identifies a set of Web Beans that should be conditionally installed in some deployments of the system.
de_de: Alle Web Beans besitzen einen <emphasis>Deployment-Typ</emphasis>. Jeder Deployment-Typ identifiziert einen Satz von Web Beans mit Vorbehalt in einigen Deployments des Systems installiert werden sollten.
es_es: Todos los Web Beans tienen un <emphasis>tipo de despliegue</emphasis>. Cada tipo de despliegue identifica un conjunto de Web Beans que debería ser instalado bajo condiciones en algunos despliegues del sistema.
it_it: Tutti i Web Bean hanno un <emphasis>tipo di deployment (deployment type)</emphasis>. Ogni tipo di deployment identifica un insieme di Web Bean che dovrebbe essere installato in modo condizionale in corrispondenza ad alcuni deploy del sistema.
ja_jp: すべてのWeb Beanは<emphasis>デプロイメントタイプ</emphasis>を持ちます。それぞれのデプロイメントタイプは、システムのある構成の下で条件つきでインストールされるべきWeb Beanの集合を規定します。
ko_kr: 모든 Web Beans는 <emphasis>배치 유형</emphasis>을 갖습니다. 각각의 배치 유형은 시스템의 일부 배치에 조건부로 설치되어야 하는 Web Beans 모음을 인식합니다.
zh_cn: 所有的Web Beans都有一个 <emphasis>部署类型</emphasis> 。每个部署类型标识一套Web Beans，这套Web Beans会有条件地在某些系统部署下面被安装。
zh_tw: 所有 Web Bean 都有一個 <emphasis>deployment type（建置類型）</emphasis>。各個 deployment type 都可標識一組應依照條件性地被安裝在系統的某些 deployment 中的 Web Bean。

source: For example, we could define a deployment type named <literal>@Mock</literal>, which would identify Web Beans that should only be installed when the system executes inside an integration testing environment:
de_de: Zum Beispiel könnten wir einen Deployment-Typ namens <literal>@Mock</literal> definieren, der Web Beans identifiziert, die nur installiert werden sollen, wenn das System innerhalb einer Integrationstestumgebung ausgeführt wird:
es_es: Por ejemplo, podríamos definir un tipo de despliegue llamado <literal>@Mock</literal>, el cual identificaría Web Beans que deben ser instalados sólo cuando el sistema se ejecute dentro de un entorno de pruebas de integración:
it_it: Per esempio, potremmo definire un tipo di deploy denominato <literal>@Mock</literal>, che identifichi i Web Bean da installare soltanto quando il sistema è posto in esecuzione in un ambiente di test integrato:
ja_jp: 例えば、<literal>@Mock</literal>という名前のデプロイメントタイプを定義し、結合テスト環境の中でシステムが稼動するときにのみインストールされるべきWeb Beanを規定するようなことができます。
ko_kr: 예를 들어, <literal>@Mock</literal>라는 배치 유형을 정의할 수 있으며, 이는 시스템이 통합적인 테스트 환경 내에서 실행될 때 설치되어야 하는 Web Beans를 인식합니다:
zh_cn: 例如，我们可以定义一套为名为 <literal>@Mock</literal> 的部署类型，这种部署类型用来标识只应该在整合测试环境下才在系统中安装的Web Beans：
zh_tw: 比方說，我們可定義一個名為 <literal>@Mock</literal> 的 deployment type，它會找出只應在系統執行於一個整合測試環境中的時候才會被安裝的 Web Bean：

source: Suppose we had some Web Bean that interacted with an external system to process payments:
de_de: Nehmen wir an, wir hätten ein Web Bean, das mit einem externen System interagiert, um Zahlungen zu bearbeiten:
es_es: Supongamos que tenemos algunos Web Bean que interactuaron con un sistema externo para procesar pagos:
it_it: Supponiamo di avere alcuni Web Bean che interagiscano con un sistema di pagamenti esterno:
ja_jp: 支払い処理を行う外部システムに関連したあるWeb Beanがあると想定します。
ko_kr: 지불 절차를 처리하기 위한 외부적 시스템과 상호 작용하는 일부 Web Bean이 있다고 가정합시다:
zh_cn: 假定我们有一些和外部系统交互的Web Beans来处理付费：
zh_tw: 假設我們有一些和外部系統進行互動以便處理款項的 Web Bean：

source: Since this Web Bean does not explicitly specify a deployment type, it has the default deployment type <literal>@Production</literal>.
de_de: Da dieses Web Bean nicht explizit einen Deployment-Typ festlegt gilt der standardmäßige Deployment-Typ <literal>@Production</literal>.
es_es: Como este Web Bean no especifica explícitamente un tipo de despliegue, tiene el tipo de despliegue predeterminado <literal>@Production</literal>.
it_it: Dal momento che questo Web Bean non specifica esplicitamente un tipo di deploy, ha il tipo di deploy predefinito <literal>@Production</literal>.
ja_jp: このWeb Beanは明示的にデプロイメントタイプが指定されていないので、デフォルトのデプロイメントタイプである<literal>@Production</literal>を持つことになります。
ko_kr: 이러한 Web Bean이 배치 유형을 명시적을 지정하지 않고 있으므로, 이는 기본값 배치 유형 <literal>@Production</literal>을 갖게 됩니다.
zh_cn: 因为这个Web Bean并不显式地指定一个部署类型，因此它有一个默认的 <literal>@Production</literal> 部署类型。
zh_tw: 因為這個 Web Bean 並未明確地指定一個 deployment type，因此它的 deployment type 會是預設的 <literal>@Production</literal>。

source: For integration or unit testing, the external system is slow or unavailable. So we would create a mock object:
de_de: Für Integration oder das Testen von Einheiten ist das externe System langsam oder nicht verfügbar. Daher würden wir ein "Mock"-Objekt erstellen:
es_es: Para prueba de integración o de unidad, el sistema externo está lento o no está disponible. Por lo tanto, creamos el objeto mock:
it_it: Per le attività di test (d'unità o integrazione), il sistema esterno è lento o non disponibile. Così sarebbe necessario creare un oggetto mock:
ja_jp: 結合テストや単体テストを行う際に、外部システムの処理が遅かったり、使用できなかったりする場合には、このようにモックオブジェクトを作成することでしょう。
ko_kr: 통합 또는 단위 테스트를 위해 외부적 시스템은 속도가 느리거나 또는 사용 불가능합니다. 따라서 모의 객체를 생성할 수 있습니다:
zh_cn: 在整合测试或者单元测试期间，外部系统可能会很慢或者无法获得，所以我们可能会创建一个模拟对象：
zh_tw: 假設要進行整合或是單元測試（unit testing），不過外部系統較慢或是無法使用。因此我們將建立一個 mock 物件：

source: But how does the Web Bean manager determine which implementation to use in a particular deployment?
de_de: Wie aber bestimmt der Web Bean Manager, welche Implementierung in einem bestimmten Deployment verwendet werden soll?
es_es: Pero, ¿cómo determina el administrador de Web Bean la aplicación que debe utilizar en un despliegue determinado?
it_it: Ma in che modo il manager Web Bean determina quale implementazione usare con un particolare deploy?
ja_jp: しかし、Web Beamマネージャは一体どのようにして、そのような特定の環境で使われる実装を決定するのでしょうか？
ko_kr: 하지만 Web Bean 관리자가 특정 배치에 어떤 구현을 사용할 지를 어떻게 결정할까요?
zh_cn: 但是Web Bean管理器如何决定在一个特定部署中使用哪一个实现？
zh_tw: 不過 Web Bean 管理員要如何判斷在特定建置中該使用哪個實做？

source: Enabling deployment types
de_de: Aktivierung von Deployment-Typen
es_es: Habilitar tipos de despliegue
it_it: Abilitazione dei tipi di deploy
ja_jp: デプロイメントタイプを有効にする
ko_kr: 배치 유형 활성화
zh_cn: 激活部署类型
zh_tw: 啟用 deployment type

source: Web Beans defines two built-in deployment types: <literal>@Production</literal> and <literal>@Standard</literal>. By default, only Web Beans with the built-in deployment types are enabled when the system is deployed. We can identify additional deployment types to be enabled in a particular deployment by listing them in <literal>web-beans.xml</literal>.
de_de: Web Beans definieren zwei eingebaute Deployment-Typen: <literal>@Production</literal> und <literal>@Standard</literal>. Standardmäßig sind nur Web Beans mit den eingebauten Deployment-Typen bei Deployment des Systems aktiviert. Wir können weitere Deployment-Typen identifizieren, die bei einem bestimmten Deployment aktiviert werden sollen, indem wir diese in <literal>web-beans.xml</literal> aufführen.
es_es: Web Beans define dos tipos de despliegue incorporados: <literal>@Production</literal> y <literal>@Standard</literal>. Por defecto, sólo los Web Beans con tipos de despliegue incorporados se habilitan cuando se despliega el sistema. Podemos identificar tipos de despliegue adicionales en un despliegue particular listándolos en <literal>web-beans.xml</literal>.
it_it: Web Beans definisce due tipi di deploy percostituiti: <literal>@Production</literal> e <literal>@Standard</literal>. Di default, sono abilitati soltanto i Web Bean con i tipi di deploy precostituiti quando si procede al deploy del sistema. E' possibile abilitare dei tipi di deploy aggiuntivi per un particolare deploy elencandoli in <literal>web-beans.xml</literal>.
ja_jp: Web Beansは、<literal>@Production</literal>と<literal>@Standard</literal>という、二つの組み込みデプロイメントタイプを定めています。システムがデプロイされた際に、デフォルトでは、組み込みデプロイメントタイプを持つWeb Beanのみが有効となります。特定の環境で有効となるような付加的なデプロイメントタイプを規定するためには、それらを<literal>web-beans.xml</literal>に列挙します。
ko_kr: Web Beans는 두 개의 내장된 배치 유형을 정의합니다: <literal>@Production</literal> 및 <literal>@Standard</literal>. 시스템이 배치되면 기본값으로 내장된 배치 유형과 함께 Web Beans 만이 활성화됩니다. <literal>web-beans.xml</literal>에서 몰록을 나열하여 특정 배치에서 활성화될 추가 배치 유형을 인식할 수 있습니다.
zh_cn: Web Beans定义了两个内置的部署类型： <literal>@Production</literal> 和 <literal>@Standard</literal>。默认情况下，当系统被部署时，只有使用内置部署类型的Web Beans才被激活。我们可以在 <literal>web-beans.xml</literal> 文件中列出其他的部署类型以便在某个特定的部署中激活它们。
zh_tw: Web Bean 定義了兩個內建的 deployment type：<literal>@Production</literal> 和 <literal>@Standard</literal>。就預設值，當系統被建置時，只有含有內建 deployment type 的 Web Bean 會被啟用。我們可藉由將特定 deployment type 列在 <literal>web-beans.xml</literal> 中來識別在特定 deployment 中可啟用的額外 deployment type。

source: Going back to our example, when we deploy our integration tests, we want all our <literal>@Mock</literal> objects to be installed:
de_de: Kehren wir zu unserem Beispiel zurück, wenn wir Integrationsstests deployen und wir möchten, dass alle unsere <literal>@Mock</literal>-Objekte installiert werden:
es_es: Volviendo a nuestro ejemplo, cuando desplegamos nuestras pruebas de integración, deseamos que todos nuestros objetos <literal>@Mock</literal> sean instalados:
it_it: Tornando al nostro esempio, quando si fa il deploy dei test di integrazione, si vuole che tutti gli oggetti <literal>@Mock</literal> vengano installati:
ja_jp: 先程の例に戻ると、結合テストをデプロイするには、すべての<literal>@Mock</literal>オブジェクトをインストールする必要があります。
ko_kr: 예제로 다시 돌아가서, 통합적 테스트를 배치할 때, 모든 <literal>@Mock</literal> 객체가 설치되기를 원합니다:
zh_cn: 回到我们的例子中，当我们部署我们的整合测试时，我们希望我们标识的所有的 <literal>@Mock</literal> 对象被安装：
zh_tw: 回到我們的範例，當我們建置我們的整合測試時，我們希望我們所有的 <literal>@Mock</literal> 物件都會被安裝：

source: Now the Web Bean manager will identify and install all Web Beans annotated <literal>@Production</literal>, <literal>@Standard</literal> or <literal>@Mock</literal> at deployment time.
de_de: Jetzt identifiziert und installiert der Web Bean Manager alle mit <literal>@Production</literal>, <literal>@Standard</literal> oder <literal>@Mock</literal> annotierten Web Beans zum Zeitpunkt des Deployments.
es_es: Ahora el administrador de Web Bean identificará e instalará todos los Web Beans anotados <literal>@Production</literal>, <literal>@Standard</literal> o <literal>@Mock</literal> en el momento del despliegue.
it_it: Ora il manager Web Bean identificherà ed installerà tutti i Web Bean annotati con <literal>@Production</literal>, <literal>@Standard</literal> o <literal>@Mock</literal> a deployment time.
ja_jp: このようにすることで、Web Beanマネージャは、デプロイ時に、<literal>@Production</literal>、<literal>@Standard</literal>、<literal>@Mock</literal>のアノテーションが付加されたすべてのWeb Beanを規定し、インストールします。
ko_kr: 이제 Web Bean 관리자는 배치시 <literal>@Production</literal>, <literal>@Standard</literal>, <literal>@Mock</literal> 어노테이션된 모든 Web Beans를 인식 및 설치하게 됩니다.
zh_cn: 现在，Web Bean管理器可以识别并且在部署期间安装所有拥有 <literal>@Production</literal>， <literal>@Standard</literal> 和 <literal>@Mock</literal> 注释的Web Beans。
zh_tw: 現在，Web Bean 管理員將會在 deployment time 找出並安裝所有標記為 <literal>@Production</literal>、<literal>@Standard</literal> 或 <literal>@Mock</literal> 的 Web Bean。

source: The deployment type <literal>@Standard</literal> is used only for certain special Web Beans defined by the Web Beans specification. We can't use it for our own Web Beans, and we can't disable it.
de_de: Der Deployment-Typ <literal>@Standard</literal> wird nur für bestimmte, spezielle durch die Web Beans Spezifikation definierte Web Beans verwendet. Wir können ihn nicht für unsere eigenen Web Beans benutzen und wir können ihn nicht deaktivieren.
es_es: El tipo de despliegue <literal>@Standard</literal> es utilizado únicamente por algunos Web Beans especiales definidos por la especificación de Web Beans. No podemos utilizarlo para nuestros propios Web Beans ni inhabilitarlo.
it_it: Il tipo di deploy <literal>@Standard</literal> è usato soltanto per dei Web Bean speciali definiti nelle specifiche. Non è possibile utilizzarlo per i propri Web Bean, e non è possibile disabilitarlo.
ja_jp: <literal>@Standard</literal>デプロイメントタイプは、Web Beans仕様で定められた、ある特別なWeb Beanに対してのみ使用されます。開発者が作成したWeb Beanに対してこれを使用したり、デプロイメントタイプを無効にしたりすることはできません。
ko_kr: <literal>@Standard</literal> 배치 유형은 Web Beans 사양에 의해 정의된 특정 Web Beans에서만 사용됩니다. 자체적 Web Beans에는 이를 사용할 수 없으며 이를 비활성화할 수 없습니다.
zh_cn: <literal>@Standard</literal> 只是Web Beans规范中为特定的Web Bean使用的部署类型。我们无法在我们自己的Web Bean中使用它，并且我们不能关闭它。
zh_tw: <literal>@Standard</literal> 這個 deployment type 只會被用於 Web Bean 規格所定義的特定特殊 Web Bean。我們無法將它使用於我們自己的 Web Bean 上，並且我們無法將它停用。

source: The deployment type <literal>@Production</literal> is the default deployment type for Web Beans which don't explicitly declare a deployment type, and may be disabled.
de_de: Der Deployment-Typ <literal>@Production</literal> ist der standardmäßige Deployment-Typ für Web Beans, die keinen expliziten Deployment-Typ festlegen oder deaktiviert sind.
es_es: El tipo de despliegue <literal>@Production</literal> es el tipo de despliegue predeterminado para Web Beans que no declaran explícitamente un tipo de despliegue, y que se puede inhabilitar.
it_it: Il tipo di deploy <literal>@Production</literal> è quello predefinito per i Web Bean che non dichiarano esplicitamente un tipo di deploy, e può essere disabilitato.
ja_jp: <literal>@Production</literal>デプロイメントタイプは、明示的にデプロイメントタイプが宣言されないWeb Beanのデフォルトのデプロイメントタイプであり、無効にすることもできます。
ko_kr: <literal>@Production</literal> 배치 유형은 배치 유형을 명시하지 않은 Web Beans에 대한 기본값 배치 유형으로 비활성화될 수 있습니다.
zh_cn: <literal>@Production</literal> 是没有显式声明部署类型的Web Beans的默认部署类型，它可以被关闭。
zh_tw: <literal>@Production</literal> 這個 deployment type 屬於未明確定義 deployment type 的 Web Bean 的預設 deployment type，並且可被停用。

source: Deployment type precedence
de_de: Deployment-Typ Präzedenz
es_es: Prioridad de tipo de despliegue
it_it: Precedenza del tipo di deploy
ja_jp: デプロイメントタイプの優先度
ko_kr: 배치 유형 우선 순위
zh_cn: 部署类型优先级
zh_tw: Deployment type 優先權

source: If you've been paying attention, you're probably wondering how the Web Bean manager decides which implementation&#151;<literal>ExternalPaymentProcessor</literal> or <literal>MockPaymentProcessor</literal>&#151;to choose. Consider what happens when the manager encounters this injection point:
es_es: Si ha prestado atención, probablemente se estará preguntando cómo escoge Web Bean la aplicación&#151;<literal>ExternalPaymentProcessor</literal> o <literal>MockPaymentProcessor</literal>&#151;. Piense en lo que sucede cuando el administrador encuentra este punto de inyección:
it_it: Se avete prestato attenzione, vi state probabilmente chiedendo come il manager Web Bean decida quale implementatione&#151;<literal>ExternalPaymentProcessor</literal> o <literal>MockPaymentProcessor</literal>&#151;scegliere. Si consideri cosa succede quando il manager incontra questo punto di iniezione:
zh_tw: 若您有在細心注意的話，您應該會疑惑 Web Bean 管理員如何決定哪個實做&#151;<literal>ExternalPaymentProcessor</literal> 和 <literal>MockPaymentProcessor</literal>&#151;中選擇哪一個。請思考當管理員遇上了這個注入點時會如何：

source: There are now two Web Beans which satisfy the <literal>PaymentProcessor</literal> contract. Of course, we can't use a binding annotation to disambiguate, since binding annotations are hard-coded into the source at the injection point, and we want the manager to be able to decide at deployment time!
de_de: Es gibt jetzt zwei Web Beans, die den <literal>PaymentProcessor</literal>-Vertrag erfüllen. Natürlich können wir keine Binding-Annotation zur eindeutig Machung verwenden, da Binding-Annotationen in die Quelle am Einspeisungspunkt hardcodiert und wir wollen, dass der Manager zum Deployment-Zeotpunkt entscheiden können soll!
es_es: Ahora hay dos Web Beans que cumplen el contrato <literal>PaymentProcessor</literal>. Claro está que no podemos utilizar una anotación de enlace para explicar, porque las anotaciones de enlace están codificadas dentro de la fuente en el punto de inyección, y queremos que el administrador pueda decidir en el ¡momento de despliegue!
it_it: Vi sono ora due Web Bean che soddisfano l'interfaccia di <literal>PaymentProcessor</literal>. Naturalmente, non è possibile utilizzare una binding annotation per eliminare l'ambiguità, poiché le binding annotation sono cablate nel sorgente in corrispondenza al punto di iniezione, e noi vogliamo che il manager sia in grado di decidere a deployment time!
ja_jp: 今、<literal>PaymentProcessor</literal>の条件を充たす二つのWeb Beanが存在します。もちろん、曖昧さを排除するようなバインディングアノテーションを用いることはできません。なぜならば、そうするにはバインディングアノテーションをソースの注入箇所にハードコーディングする必要があり、我々が行いたいのはそうではなく、デプロイ時に、マネージャによって決定されるようにしたいからです。
ko_kr: <literal>PaymentProcessor</literal> 계약을 만족하는 두 개의 Web Beans가 있습니다. 삽입 지점에서 바인딩 어노테이션은 소스로 하드-코드화되어 있으므로, 명확하게 하기 위해 바인딩 어노테이션을 사용할 수 없으며, 관리자가 배치시 결정할 수 있게 하기를 원합니다!
zh_cn: 现在有两个Web Bean满足 <literal>PaymentProcessor</literal> 合约。当然，我们无法使用一个绑定注释来消除这个歧义，因为绑定注释在注入点被硬编码到了源代码中，并且我们希望管理器在部署时能够决定注入哪一个Web Bean！
zh_tw: 有兩個 Web Bean 可滿足 <literal>PaymentProcessor</literal> 合同。當然，我們無法使用綁定標記來消除語意上的含糊意義，因為綁定標記已寫死（hard-coded）在注入點的來源之中，而且我們希望管理員能夠在 deployment time 時作決定！
