Repository: 1tchy/core
Catalog: reference/*/injection.po
Languages: de_de, es_es, it_it, ja_jp, ko_kr, zh_cn, zh_tw

source: Dependency injection
de_de: Dependency-Einspeisung
es_es: Inyección de dependencia
ja_jp: 依存性注入
ko_kr: 의존성 삽입
zh_cn: 依赖注入
zh_tw: 依賴注入（Dependency injection）

source: Web Beans supports three primary mechanisms for dependency injection:
de_de: Web Beans unterstützt drei primäre Mechanismen für "Dependency"-Einspeisung:
es_es: Web Beans soporta tres mecanismos primarios para inyección de dependencia:
it_it: Web Beans supporta tre meccanismi primari per la dependency injection:
ja_jp: Web Beansは依存性注入のための3つの基本的な機構を持っています。
ko_kr: Web Beans는 의존성 삽입에 대한 세 가지 주요 메카니즘을 지원합니다:
zh_cn: Web Beans支持三种主要的依赖注入机制：
zh_tw: Web Bean 支援了三個主要的依賴注入機制：

source: Constructor parameter injection:
de_de: Konstruktorparameter-Einspeisung:
es_es: Constructor de inyección de parámetro:
it_it: Iniezione dei parametri del costruttore
ja_jp: コンストラクタの引数による注入、
ko_kr: 생성자 매개 변수 삽입:
zh_cn: 构造器参数注入：

source: <emphasis>Initializer</emphasis> method parameter injection:
de_de: <emphasis>Initializer</emphasis>-Methode Parameter-Einspeisung:
es_es: Inyección de parámetro del método <emphasis>Inicializador</emphasis>:
it_it: Iniezione dei parametri del <emphasis>metodo inizializzatore (initializer method)</emphasis>:
ja_jp: <emphasis>初期化</emphasis>メソッドの引数による注入、
ko_kr: <emphasis>초기화</emphasis> 방식 매개 변수 삽입:
zh_cn: <emphasis>初始化</emphasis> 方法参数注入：

source: And direct field injection:
de_de: Und direkte Feldeinspeisung:
es_es: E inyección directa de campo:
it_it: Iniezione diretta degli attributi
ja_jp: そして、フィールドへの直接的な注入です。
ko_kr: 직접적 영역 삽입:
zh_cn: 和直接的域注入：
zh_tw: 以及 direct field injection：

source: Dependency injection always occurs when the Web Bean instance is first instantiated.
de_de: Dependency-Einspeisung findet stets bei der ersten Instantiierung der Web Bean Instanz statt.
es_es: La inyección de dependencia siempre se presenta cuando la instancia de Web Bean es instanciada primero:
it_it: La dependency injection avviene sempre quando il Web Bean viene istanziato la prima volta.
ja_jp: 依存性注入は、Web Beanインスタンスが最初に生成される際に必ず行われます。
ko_kr: Web Bean 인스턴스가 먼저 인스턴스화되었을 경우 의존성 삽입이 발생합니다.
zh_cn: 当Web Bean实例被首次初始化时，依赖注入总是随之发生。
zh_tw: 每當 Web Bean 的 instance 第一次被例示時，依賴注入就會發生。

source: First, the Web Bean manager calls the Web Bean constructor, to obtain an instance of the Web Bean.
de_de: Zuerst ruft der Web Bean Manager den Web Bean Konstruktor auf, um eine Instanz des Web Beans zu erhalten.
es_es: Primero, el administrador de Web Bean llama al constructor de Web Bean, para obtener una instancia del Web Bean.
it_it: Innanzitutto, il Web Bean manager chiama il costruttore, per ottenere un'istanza del Web Bean.
ja_jp: 最初に、Web Beanマネージャは、Web Beanインスタンスを取得するために、Web Beanのコンストラクタを実行する
ko_kr: 먼저, Web Bean 관리자는 Web Bean 생성자를 호출하여 Web Bean 인스턴스를 획득합니다.
zh_cn: 首先，Web Bean管理器调用Web Bean构造器来获得一个Web Bean的实例。
zh_tw: 首先，Web Bean 管理員會調用 Web Bean constructor，並取得 Web Bean 的某個 instance。

source: Next, the Web Bean manager initializes the values of all injected fields of the Web Bean.
de_de: Als nächstes initialisiert der Web Bean Manager die Werte aller eingespeisten Felder des Web Beans.
es_es: Luego, el administrador de Web Bean inicializa los valores de los campos inyectados del Web Bean.
it_it: Quindi, il Web Bean manager inizializza i valori di tutti i campi del Web Bean soggetti ad iniezione.
ja_jp: 次に、Web Beanマネージャは、Web Beanの、注入すべきすべてのフィールド値を初期化する
ko_kr: 다음으로, Web Bean 관리자는 Web Bean의 삽입된 모든 영역의 값을 초기화합니다.
zh_cn: 接下来，Web Bean管理器初始化这个Web bean的所有注入域的值。
zh_tw: 接下來，Web Bean 管理員便會初始化 Web Bean 所有已注入欄位的值。

source: Next, the Web Bean manager calls all initializer methods of Web Bean.
de_de: Anschließend ruft der Web Bean Manager alle Initialisierermethoden des Web Beans auf.
es_es: Más tarde, el administrador de Web Bean llama a todos los métodos inicializadores del Web Bean.
it_it: Quindi, il Web Bean manager chiama tutti i metodi inizializzatori del Web Bean.
ja_jp: 次に、Web Beanマネージャは、Web Beanの、すべての初期化メソッドを実行する
ko_kr: 그 후, Web Bean 관리자는 Web Bean의 모든 초기화 방식을 호출합니다.
zh_cn: 然后，Web Bean管理器调用这个Web Bean的初始化方法。
zh_tw: 然後，Web Bean 管理員將會調用 Web Bean 的所有 initializer method。

source: Finally, the <literal>@PostConstruct</literal> method of the Web Bean, if any, is called.
de_de: Zuletzt wird die <literal>@PostConstruct</literal>-Methode des Web Bean, falls vorhanden, aufgerufen.
es_es: Por último, se llama al método de Web Bean <literal>@PostConstruct</literal>, si existe.
it_it: Infine, se ne esiste uno, viene chiamato il metodo del Web Bean annotato con <literal>@PostConstruct</literal>.
ja_jp: 最後に、もしあれば、Web Beanの<literal>@PostConstruct</literal>メソッドが呼ばれます。
ko_kr: 마지막으로 Web Bean의 <literal>@PostConstruct</literal> 방식이 호출됩니다.
zh_cn: 最后， 如果有 <literal>@PostConstruct</literal> 方法的话，调用这个方法。
zh_tw: 最後，（若存在的話）Web Bean 的 <literal>@PostConstruct</literal> method 將會被調用。

source: Constructor parameter injection is not supported for EJB beans, since the EJB is instantiated by the EJB container, not the Web Bean manager.
de_de: Die Einspeisung von Konstruktorparametern wird für EJB-Beans nicht unterstützt, da das EJB durch den EJB-Container und nicht den Web Bean Manager instantiiert wird.
es_es: La inyección de parámetro constructor no es admitida por beans de EJB, porque EJB es instanciado por el contenedor de EJB, no por el administrador de Web Bean.
it_it: L'iniezione dei parametri del costruttore non è supportata per gli EJB, poiché gli EJB sono istanziati dal container EJB, non dal manager Web Bean.
ja_jp: コンストラクタの引数による注入は、EJBには使用することができません。なぜならば、EJBはWeb Beanマネージャではなく、EJBコンテナによって初期化が行われるからです。
ko_kr: EJB가 Web Bean 관리자가 아닌 EJB 컨테이너에 의해 인스턴스화된 이래 생성자 매개변수 삽입은 EJB beans을 지원하지 않습니다.
zh_cn: EJB Beans不支持构造器参数注入，因为EJB是由EJB容器负责实例化，而不是Web Bean管理器负责。
zh_tw: EJB Bean 不支援 Constructor parameter injection，因為 EJB 是由 EJB container 來例示（instantiate）的，而不是以 Web Bean 管理員。

source: Parameters of constructors and initializer methods need not be explicitly annotated when the default binding type <literal>@Current</literal> applies. Injected fields, however, <emphasis>must</emphasis> specify a binding type, even when the default binding type applies. If the field does not specify a binding type, it will not be injected.
de_de: Parameter von Konstruktoren und Initialisierermethoden müssen nicht explizit annotiert werden, wenn der standardmäßige Binding-Typ <literal>@Current</literal> gilt.Eingespeiste Felder jedoch <emphasis>müssen</emphasis> einen Binding-Typ festlegen, selbst wenn der standardmäßige Binding-Typ gilt. Legt das Feld keinen standardmäßige Binding-Typ fest, so wird es nicht eingespeist.
es_es: Los parámetros de constructores y métodos de inicializador no necesitan ser anotados explícitamente cuando se aplique el tipo de enlace predeterminado <literal>@Current</literal>. Los campos inyectados, sin embargo, <emphasis>deben</emphasis> especificar un tipo de enlace, cuando se aplique el tipo de enlace predeterminado. Si el campo no especifica ningún tipo de enlace, no será inyectado.
it_it: I parametri dei costruttori e dei metodi di inizializzazione non devono essere annotati esplicitamente quando il tipo del binding è <literal>@Current</literal>, quello predefinito. I campi iniettati, comunque, <emphasis>devono</emphasis> specificare il tipo del binding, anche quando il tipo del binding è quello predefinito. Se il campo non specifica il tipo del binding, non verrà iniettato.
ja_jp: コンストラクタや初期化メソッドの引数で注入を行う場合には、デフォルトで<literal>@Current</literal>バインディングタイプが適用されるので、明示的なアノテーションは必要ありません。しかしながら、フィールドへの直接的な注入を行う場合には、デフォルトのバインディングタイプで良い場合でも、バインディングタイプを指定<emphasis>しなければなりません</emphasis>。バインディングタイプを指定しない場合は、注入は行われません。
ko_kr: 기본값 바인딩 유형 <literal>@Current</literal>가 적용되었을 경우 생성자의 매개 변수 및 초기화 방식에서는 명시적으로 어노테이션할 필요가 없습니다. 하지만 삽입된 영역에는 <emphasis>반드시</emphasis> 바인딩 유형을 지정해야 하며, 언제 기본값 바인딩 유형을 적용할 지도 지정해야 합니다. 영역에 바인딩 유형이 지정되어 있지 않을 경우, 이는 삽입되지 않게 됩니다.
zh_cn: 当应用默认绑定类型<literal>@Current</literal>时，构造器的参数和初始化方法需要显式地注释。然而，即使应用了默认的绑定类型，注入域 也<emphasis>必须</emphasis> 指定一个绑定类型。如果一个域没有指定绑定类型，这个域将不会有任何注入发生。
zh_tw: 當套用了預設的 <literal>@Current</literal> 綁定類型時，Constructor 和 initializer method 的參數不需要被明確地標記。不過，儘管套用了預設的綁定類型，被注入的欄位還是<emphasis>一定</emphasis>要指定綁定類型。若該欄位不指定綁定類型的話，它將不會被注入。

source: Producer methods also support parameter injection:
de_de: Producer-Methoden unterstützen Parametereinspeisung ebenfalls:
es_es: Los métodos de productor también admiten inyección de parámetro:
it_it: I metodi produttori supportano anche l'iniezione dei parametri:
ja_jp: プロデューサメソッドもまた、引数による注入を可能とします。
ko_kr: 생산자 방식은 매개 변수 삽입을 지원합니다:
zh_cn: 生产者方法也支持参数注入：
zh_tw: Producer method 也支援 parameter injection：

source: Finally, observer methods (which we'll meet in <xref linkend="events"/>), disposal methods and destructor methods all support parameter injection.
de_de: Observer-Methoden (auf die wir in <xref linkend="events"/> näher eingehen), "Disposal"-Methoden und "Destructor"-Methoden unterstützen allesamt die Parametereinspeisung.
es_es: Por último, los métodos de observador (que encontraremos en <xref linkend="events"/>), los métodos desechables y los métodos destructores, admiten inyección de parámetro.
it_it: Infine, i metodi observer (che vedremo in <xref linkend="events"/>), i metodi disposal e i metodi distruttori supportano tutti l'iniezione dei parametri.
ja_jp: 結局、オブザーバメソッド（<xref linkend="events"/>で紹介します）や、ディスポーザルメソッド、デストラクタでも引数による注入が可能です。
ko_kr: 마지막으로 옵저버 방식 (<xref linkend="events"/>에서 살펴보게됨), 폐지 방식 및 소멸자 방식 모두는 매개 변수 삽입을 지원합니다.
zh_cn: 最后，观察者方法（我们将在 <xref linkend="events"/>一章中讨论），清除（disposal）方法和解构（destructor）方法都只支持参数注入。
zh_tw: 最後，observer method（我們會在 <xref linkend="events"/> 中談到）、disposal method 以及 destructor method 全都支援 parameter injection。

source: The Web Beans specification defines a procedure, called the <emphasis>typesafe resolution algorithm</emphasis>, that the Web Bean manager follows when identifying the Web Bean to inject to an injection point. This algorithm looks complex at first, but once you understand it, it's really quite intuitive. Typesafe resolution is performed at system initialization time, which means that the manager will inform the user immediately if a Web Bean's dependencies cannot be satisfied, by throwing a <literal>UnsatisfiedDependencyException</literal> or <literal>AmbiguousDependencyException</literal>.
de_de: Die Web Beans Spezifikation definiert eine Prozedur namens <emphasis>typesicherer Auflösungsalgorithmus</emphasis> (sog. typesafe resolution algorithm), den der Web Bean Manager bei der Identifizierung des an einem Einspeisungspunkt einzuspeisenden Web Beans folgt. Dieser Algorithmus sieht auf den ersten Blick recht komplex aus, ist es aber nach kurzer Eingewöhnung nicht. Typensichere Auflösung wird zum Initialisierungszeitpunkt des Systems durchgeführt, was bedeutet, dass der Manager den Benutzer sofort darüber informiert, falls die Abhängigkeiten eines Web Beans nicht erfüllt werden können - dies erfolgt durch Meldung von <literal>UnsatisfiedDependencyException</literal> oder <literal>AmbiguousDependencyException</literal>.
es_es: La especificación de Web Beans define un procedimiento, llamado <emphasis>algoritmo de resolución de typesafe</emphasis> que el administrador de Web Bean sigue al identificar el Web Bean para inyectar a un punto de inyección. Este algoritmo parece complejo en un principio, pero una vez que lo entienda, es en realidad muy intuitivo. La resolución de Typesafe se realiza al inicializar el sistema, lo que significa que el administrador informará al usuario inmediatamente si se pueden cumplir las dependencias de un Web Bean, produciendo una <literal>UnsatisfiedDependencyException</literal> o una <literal>AmbiguousDependencyException</literal>.
it_it: Le specifiche Web Beans definiscono una procedura, chiamata <emphasis>typesafe resolution algorithm (algoritmo di risoluzione sicura rispetto ai tipi)</emphasis>, che il manager Web Bean segue quando deve identificare il Web Beanda iniettare in punto di iniezione. Questo algoritmo di primo acchito sembra complesso, ma una volta che lo si è compreso, in realtà, risulta piuttosto intuitivo. La risoluzione sicura dei tipi viene eseguita durante l'inizializzazione del sistema (system initialization time), il che significa che il manager Web Bean informerà immediatamente un utente se le dipendenze di un Web Bean non possono essere soddisfatte, lanciando una <literal>UnsatisfiedDependencyException</literal> o una <literal>AmbiguousDependencyException</literal>.
ja_jp: Web Beansの仕様では、<emphasis>タイプセーフ解決アルゴリズム</emphasis>が定義されており、Web Beanマネージャは、ある注入箇所への注入を行う際、これにのっとって、注入すべきWeb Beanを特定します。このアルゴリズムは最初は複雑に感じますが、一度理解してしまえば、とても直観的なものです。タイプセーフ解決アルゴリズムは、システムの初期化時に使われます。これは、もしWeb Beanの依存性が充たされない場合には、マネージャが<literal>UnsatisfiedDependencyException</literal>や<literal>AmbiguousDependencyException</literal>をスローすることによって、即座にそれをユーザに通知することを意味します。
ko_kr: Web Beans 사양은 <emphasis>타입 안정적 해상도 알고리즘</emphasis>이라는 절차를 정의하여, Web Bean 관리자가 삽입 지점에 삽입하기 위해 Web Bean을 인식할 때 이를 따르게 됩니다. 이러한 알고르짐은 처음에는 복잡하게 보이지만, 일단 이를 이해하면, 이는 다소 직관적입니다. 타입 안정적 해상도는 시스템 초기화시에 실행되어, 관리자는 사용자에 과한 정보를 즉각적으로 알게되며 Web Bean의 의존성에 만족하지 않을 경우, <literal>UnsatisfiedDependencyException</literal> 또는 <literal>AmbiguousDependencyException</literal>을 넘기게 됩니다.
zh_cn: Web Beans规范定义了一个称为 <emphasis>类型安全解析算法</emphasis>的过程，当在注入点识别所注入的Web Bean时，Web Bean管理器会遵循这个过程。这个算法初看起来非常复杂，然而你一旦理解了它，它就相当直观。类型安全解析在系统初始化的时候执行，这意味着如果Web Bean的依赖无法被满足的时候，管理器将立刻通知用户，抛出一个 <literal>UnsatisfiedDependencyException</literal> 异常或者 <literal>AmbiguousDependencyException</literal> 异常。
zh_tw: Web Bean 規格定義了一個流程，該流程稱為 <emphasis>typesafe resolution algorithm</emphasis>（typesafe 解析演算法），當 Web Bean 要注入至一個注入點時，Web Bean 管理員便會遵照該流程來進行。這個演算法乍看之下非常地複雜，不過當您理解它之後，您會發現它實際上並不複雜。Typesafe 解析會在系統初始化時進行，這也代表了若 Web Bean 的相依性無法被滿足的話，管理員會即刻透過回傳一個 <literal>UnsatisfiedDependencyException</literal> 或是 <literal>AmbiguousDependencyException</literal> 來通知用戶。

source: The purpose of this algorithm is to allow multiple Web Beans to implement the same API type and either:
de_de: Der Zweck dieses Algorithmus ist es, mehreren Web Beans die Einspeisung desselben API-Typs zu gestatten und entweder:
es_es: El propósito de este algoritmo es permitir a múltiples Web Beans implementar el mismo tipo API ya sea:
it_it: Lo scopo di questo algoritmo è di permettere a più Web Bean di implementare la stessa tipo definito dall'API e:
ja_jp: このアルゴリズムの目的は、複数のWeb Beanが同じAPIを実装できるようにすることであり、
ko_kr: 이러한 알고리즘은 여러 Web Beans를 허용하여 동일한 API 유형을 구현하기 위한 것입니다:
zh_cn: 这个算法的目的是允许多个Web Beans实现相同的API类型，并且：
zh_tw: 這個演算法就是為了要讓多重 Web Bean 實做相同的 API 類型以及：

source: allow the client to select which implementation it requires using <emphasis>binding annotations</emphasis>,
de_de: Dem Client mittels <emphasis>Binding-Annotationen</emphasis> zu gestatten auszuwählen, welche Implemetierung er benötigt,
es_es: permitiendo al cliente seleccionar la aplicación requerida mediante <emphasis>anotaciones de enlace</emphasis>,
it_it: permettere al client di selezionare l'implementazione richiesta usando le <emphasis>binding annotations</emphasis>,
ja_jp: <emphasis>バインディングアノテーション</emphasis>を使用することによって、クライアントが必要とする実装を選択できるようにする
ko_kr: 또는 클라이언트가 <emphasis>바인딩 어노테이션</emphasis>을 사용하여 필요한 구현 사항을 선택하게 합니다,
zh_cn: 允许客户通过 <emphasis>绑定注释</emphasis> 选择它需要的具体实现，
zh_tw: 讓客戶端藉由使用 <emphasis>binding annotations</emphasis> 來選擇需要的實做、

source: allow the application deployer to select which implementation is appropriate for a particular deployment, without changes to the client, by enabling or disabling <emphasis>deployment types</emphasis>, or
de_de: Dem Anwendungs-Deployer durch Aktivierung oder Deaktivierung von <emphasis>Deployment-Typen</emphasis> gestatten auszuwählen, welche Implementierung die passende für eine bestimmte Umgebung ist, ohne dass es zu Änderungen am Client kommt oder
es_es: permitiendo al desplegador de aplicación seleccionar la aplicación apropiada para una despliegue particular, sin cambios en el cliente, habilitando o inhabilitando los <emphasis>tipos de despliegue</emphasis>, o
it_it: permettere all'installatore dell'applicazione (deployer) di selezionare quale implementazione è appropriata per un particolare deploy, senza cambiamenti al client, abilitando o disabilitando <emphasis>i tipi di deploy</emphasis>, o
ja_jp: アプリケーションをデプロイする際に<emphasis>デプロイメントタイプ</emphasis>を有効にしたり無効にしたりすることによって、クライアントを変更することなく、特定の環境に対して適切な実装を選択できるようにする
ko_kr: 애플리케이션 개발자가 클라이언트로 변경하지 않고 <emphasis>배치 유형</emphasis>을 활성화 또는 비활성화하여 특정 시스템에 어떤 구헌이 적합할 지를 선택하게 합니다.
zh_cn: 允许应用部署者激活或者关闭 <emphasis>部署类型</emphasis> ，从而实现在特定的部署环境下选择适当的具体实现，而无需修改客户，或者
zh_tw: 讓應用程式建置人員在不改變客戶端的情況下藉由啟用或停用 <emphasis>deployment types</emphasis> 來選擇用於特定建置的適當實做，或是

source: allow one implementation of an API to override another implementation of the same API at deployment time, without changes to the client, using <emphasis>deployment type precedence</emphasis>.
de_de: Einer Implementierung eines API mittels <emphasis>Deployment-Typ Präzedenz</emphasis> ("Deployment Type Precedence") gestatten, zum Deployment-Zeitpunkt eine andere Implementerung desselben API außer Kraft zu setzen, ohne dass dies zu Änderungen am Client führt..
es_es: permitiendo que una implementación de una API remplace otra implementación de la misma API en el momento del despliegue, sin cambios al cliente, mediante <emphasis>prioridad de tipo de despliegue</emphasis>.
it_it: permette ad un'implementazione della API di fare l'override di un'altra implementazione della stessa API a deployment time, senza apportare modifiche al client, usando <emphasis>la precedenza fra tipi di deploy (deployment type precedence)</emphasis>.
ja_jp: <emphasis>デプロイメントタイプの優先度</emphasis>を使用することによって、クライアントを変更することなく、APIのとある実装が同じAPIの異なる実装を、デプロイメント時に上書きできるようにする
ko_kr: 하나의 API 구현이 클라이언트에 변경하지 않고 <emphasis>배치 유형 우선 순위</emphasis>를 사용하여 배치시 다른 동일한 API 구현을 덮어쓰기하게 합니다.
zh_cn: 使用<emphasis>部署类型优先级</emphasis> 来允许一个API的实现在部署时重载相同API的另一个实现，而无需修改客户。
zh_tw: 允許建置時透過使用 <emphasis>deployment type precedence</emphasis> 來讓某個 API 的一個實做能在不改變客戶端的情況下置換另一個相同 API 的實做。

source: Let's explore how the Web Beans manager determines a Web Bean to be injected.
de_de: Schauen wir uns jetzt näher an, wie der Web Beans Manager ein einzuspeisendes Web Bean bestimmt.
es_es: Exploremos cómo el administrador de Web Beans determina una Web Bean para ser inyectado.
it_it: Indaghiamo come il manager di Web Beans individua un Web Bean da iniettare.
ja_jp: それでは、Web Beanマネージャが注入すべきWeb Beanをどのように決定していくのかを見ていくことにしましょう。
ko_kr: Web Beans 관리자가 어떻게 Web Bean을 삽입할 지를 결정하는 방법에 대해 살펴봅시다.
zh_cn: 让我们看看Web Bean管理器如何决定注入哪个Web Bean。
zh_tw: 讓我們來探討 Web Bean 管理員如何判斷某個 Web Bean 要如何被注入。

source: Binding annotations
de_de: Binding-Annotationen
es_es: Anotaciones de Enlace
it_it: Annotazioni di binding
ja_jp: バインディングアノテーション
ko_kr: 바인딩 어노테이션
zh_cn: 绑定注释
zh_tw: 綁定標記

source: If we have more than one Web Bean that implements a particular API type, the injection point can specify exactly which Web Bean should be injected using a binding annotation. For example, there might be two implementations of <literal>PaymentProcessor</literal>:
de_de: Falls mehr als ein Web Bean existiert, das einen bestimmten API-Typ implementiert, so kann der Einspeisungspunkt genau festlegen welches Web Bean eingespeist wird mittels Binding-Annotation. Zum Beispiel können zwei Implementierungen von <literal>PaymentProcessor</literal> vorhanden sein:
es_es: Si tenemos más de un Web Bean que implemente un tipo determinado de API, el punto de inyección puede especificar el Web Bean que debe ser inyectado mediante una anotación de enlace. Por ejemplo, deberían haber dos aplicaciones del <literal>PaymentProcessor</literal>:
it_it: Se esiste più di un Web Bean che implementa un particolare tipo di API, il punto di iniezione può specificare esattamente quale Web Bean dovrebbe essere iniettato usando una binding annotation. Per esempio, ci potrebbero essere due implementazioni di <literal>PaymentProcessor</literal>:
ja_jp: もし一つより多いWeb Beanが特定のAPIを実装している場合、注入箇所では、バインディングアノテーションを使用することによって、どのWeb Beanが注入されるべきかということが正確に指定されます。例えば、ここに<literal>PaymentProcessor</literal>に対する二つの実装が存在するとします。
ko_kr: 특정 API 유형을 구현하는 하나 이상의 Web Bean이 있을 경우, 삽입 지점은 바인딩 어노테이션을 사용하여 어떤 Web Bean이 삽입되어야 할 지를 지정할 수 있습니다. 예를 들어, <literal>PaymentProcessor</literal>의 두 가지 구현이 있을 수 있습니다:
zh_cn: 如果我们拥有实现特定API类型的多个Web Bean，我们可以使用一个绑定注释来指定在注入点注入哪个Web Bean。例如，我们可能有两个 <literal>PaymentProcessor</literal> 的实现：
zh_tw: 若我們擁有超過一個實做特定 API 類型的 Web Bean，注入點可藉由使用綁定標記來確切地指定哪個 Web Bean 應該被注入。比方說，<literal>PaymentProcessor</literal> 的實做可能有兩個：

source: Where <literal>@PayByCheque</literal> and <literal>@PayByCreditCard</literal> are binding annotations:
de_de: Wo <literal>@PayByCheque</literal> und <literal>@PayByCreditCard</literal> Binding-Annotationen sind:
es_es: Donde <literal>@PayByCheque</literal> y <literal>@PayByCreditCard</literal> son anotaciones de enlace:
it_it: Dove <literal>@PayByCheque</literal> e <literal>@PayByCreditCard</literal> sono binding annotation:
ja_jp: ここで、<literal>@PayByCheque</literal>と<literal>@PayByCreditCard</literal>はバインディングアノテーションです。
ko_kr: 여기서 <literal>@PayByCheque</literal> 및 <literal>@PayByCreditCard</literal>는 바인딩 어노테이션입니다:
zh_cn: 其中 <literal>@PayByCheque</literal> 和 <literal>@PayByCreditCard</literal> 是绑定注释：
zh_tw: <literal>@PayByCheque</literal> 和 <literal>@PayByCreditCard</literal> 為綁定標記：

source: A client Web Bean developer uses the binding annotation to specify exactly which Web Bean should be injected.
de_de: Ein Client Web Bean Entwickler verwendet die Binding-Annotation um genau festzulegen, welches Web Bean eingespeist werden sollte.
es_es: Un desarrollador de cliente de Web Bean utiliza la anotación de enlace para especificar exactamente el Web Bean que debe inyectarse.
it_it: Lo sviluppatore di un Web Bean client usa la binding annotation per specificare esattamente quale Web Bean debba essere iniettato.
ja_jp: クライアントWeb Beanの開発者は、バインディングアノテーションを使用することによって、どのWeb Beanが注入されるべきかということを、正確に指定することができます。
ko_kr: 클라이언트 Web Bean 개발자는 바인딩 어노테이션을 사용하여 정확히 어떤 Web Bean이 삽입되어야 하는 지를 지정합니다.
zh_cn: 一个客户Web Bean开发者使用绑定注释来指定到底哪个Web Bean应该被注入。
zh_tw: 客戶端 Web Bean 開發人員會使用綁定標記來確切指定哪個 Web Bean 應被注入。

source: Using field injection:
de_de: Verwendung der Feldeinspeisung:
es_es: Uso de inyección de campo:
it_it: Utilizzando l'iniezione a livello di campo:
ja_jp: フィールドに注入することができます。
ko_kr: 영역 삽입 사용:
zh_cn: 使用域注入：
zh_tw: 使用 field injection：

source: Using initializer method injection:
de_de: Verwendung der Initialisierermethoden-Einspeisung:
es_es: Uso de inyección de método inicializador:
it_it: Utilizzando l'iniezione a livello di metodo inizializzatore:
ja_jp: 初期化メソッドを使用して注入することもできます。
ko_kr: 초기화 방식 삽입 사용:
zh_cn: 使用初始化方法注入：
zh_tw: 使用 initializer method injection：

source: Or using constructor injection:
de_de: Oder Verwendung der Konstruktoreinspeisung:
es_es: O uso de inyección de constructor:
it_it: O usando l'iniezione a livello di costruttore:
ja_jp: そして、コンストラクタを使用して注入することもできます。
ko_kr: 생성자 삽입 사용:
zh_cn: 或者使用构造器注入：
zh_tw: 或使用 constructor injection：

source: Binding annotations with members
de_de: Binding-Annotationen mit Mitgliedern
es_es: Anotaciones de enlace con miembros
it_it: Annotazioni di binding con membri
ja_jp: メンバー付きのバインディングアノテーション
ko_kr: 멤버와 바인딩 어노테이션
zh_cn: 成员绑定注释
zh_tw: member 和綁定標記

source: Binding annotations may have members:
de_de: Binding-Annotationen können Mitglieder besitzen:
es_es: Las anotaciones de enlace pueden tener miembros:
it_it: Le binding annotation possono avere dei membri:
ja_jp: バインディングアノテーションはメンバーを持つことができます。
ko_kr: 바인딩 어노테이션은 멤버를 갖을 수 있습니다:
zh_cn: 绑定注释可以拥有成员：
zh_tw: 綁定標記能夠有 member：

source: In which case, the member value is significant:
de_de: Wobei in diesem Fall der Mitgliederwert von Bedeutung ist:
es_es: En cuyo caso, el valor de miembro es importante:
it_it: Nel qual caso, il valore del membro è significativo:
ja_jp: このような場合には、メンバーの値が重要な意味を持ちます。
ko_kr: 이러한 경우, 멤버 값이 중요합니다:
zh_cn: 在这个例子，成员值是有意义的：
zh_tw: 在此情況下，member value 非常重要：
