Repository: 1tchy/core
Catalog: reference/*/injection.po
Languages: de_de, es_es, it_it, ja_jp, ko_kr, zh_cn, zh_tw

source: The solution to this problem is that each deployment type has a different <emphasis>precedence</emphasis>. The precedence of the deployment types is determined by the order in which they appear in <literal>web-beans.xml</literal>. In our example, <literal>@Mock</literal> appears later than <literal>@Production</literal> so it has a higher precedence.
de_de: Die Lösung dieses Problems ist, dass jeder Deployment-Typ eine andere <emphasis>Präzendenz</emphasis> besitzt. Die Präzendenz der Deployment-Typen wird durch die Reihenfolge, in der sie in <literal>web-beans.xml</literal> erscheinen, festgelegt. In unserem Beispiel erscheint <literal>@Mock</literal> später als <literal>@Production</literal>, so dass es eine höhere Präzendenz besitzt.
es_es: La solución a este problema es que cada tipo de despliegue tiene una <emphasis>prioridad</emphasis> diferente. La prioridad de los tipos de despliegue es determinada por el orden de aparición en <literal>web-beans.xml</literal>. En nuestro ejemplo, <literal>@Mock</literal> es posterior a <literal>@Production</literal> por lo tanto tiene mayor prioridad.
it_it: La soluzione a questo problema sta nel fatto che ciascun tipo di deploy ha una diversa <emphasis>precedenza</emphasis>. La precedenza dei tipi di deploy è determinata dall'ordine con cui appaiono in <literal>web-beans.xml</literal>. Nel nostro esempio, <literal>@Mock</literal> compare dopo <literal>@Production</literal> cosicché ha una precedenza più alta.
ja_jp: このような問題への解として、それぞれのデプロイメントタイプは異なる<emphasis>優先度</emphasis>を持ちます。デプロイメントタイプの優先度は、それらが<literal>web-beans.xml</literal>に現れる順番によって決まります。今回の例では、<literal>@Mock</literal>は<literal>@Production</literal>の後に現れるので、<literal>@Mock</literal>の方が高い優先度を持つことになります。
ko_kr: 이러한 문제의 해결책은 각각의 배치 유형이 다른 <emphasis>우선 순위</emphasis>를 갖게 하는 것입니다. 배치 유형의 우선 순위는 <literal>web-beans.xml</literal>에 나타나는 순서에 의해 결정됩니다. 예에서 <literal>@Mock</literal>는 <literal>@Production</literal> 보다 나중에 나타나므로 보다 높은 우선 순위를 갖습니다.
zh_cn: 这个问题的解决方案是每个不同的部署类型都拥有不同的 <emphasis>优先级</emphasis> 。部署类型的优先级由它们在 <literal>web-beans.xml</literal> 中出现的顺序决定。在我们这个例子中， <literal>@Mock</literal> 比 <literal>@Production</literal> 出现的晚，所以它拥有更高的优先级。
zh_tw: 這項問題的解決方式就是利用各個 deployment type 的不同<emphasis>優先權</emphasis>。Deployment type 的優先權是透過它們出現在 <literal>web-beans.xml</literal> 中的順序來決定的。在我們的範例中，<literal>@Mock</literal> 出現的順序在 <literal>@Production</literal> 之後，因此它會有較高的優先權。

source: Whenever the manager discovers that more than one Web Bean could satisfy the contract (API type plus binding annotations) specified by an injection point, it considers the relative precedence of the Web Beans. If one has a higher precedence than the others, it chooses the higher precedence Web Bean to inject. So, in our example, the Web Bean manager will inject <literal>MockPaymentProcessor</literal> when executing in our integration testing environment (which is exactly what we want).
de_de: Findet der Manager mehr als ein Web Bean, das den von einem Einspeisungspunkt festgelegten Vertrag erfüllt (API-Typ plus Binding-Annotationen), so gilt die relative Präzedenz der Web Beans. Besitzt eines eine höhere Präzedenz als andere, so wird es für die Einspeisung gewählt. In unserem Beispiel speist der Web Bean Manager also <literal>MockPaymentProcessor</literal> bei der Ausführung unserer Integrationstestumgebung aus (und das ist es auch, was wir möchten).
es_es: Cada vez que el administrador descubre que más de un Web Bean cumple el contrato (tipo API más anotaciones de enlace) especificado por un punto de inyección, considera la prioridad relativa de los Web Beans. Se escoge el Web Bean que tiene prioridad respecto de los otros para inyectar. Por lo tanto, en nuestro ejemplo, el administrador de Web Bean inyectará <literal>MockPaymentProcessor</literal> al ejecutar en nuestro entorno de prueba de integración (que es precisamente lo que queremos).
it_it: Ogni volta che il manager scopre che più di un Web Bean potrebbe soddisfare il contratto (interfaccia più binding annotation) specificato da un punto di iniezione, passa a considerare la precedenza relativa dei Web Bean. Se uno ha una precedenza superiore a quella degli altri, questo viene scelto per essere iniettato. Così, nel nostro esempio, il manager Web Bean inietterà <literal>MockPaymentProcessor</literal> quando viene eseguito nel nostro ambiente di test (che è esattamente ciò che vogliamo).
ja_jp: マネージャは、ある注入箇所によって指定される条件（APIタイプやバインディングアノテーション）を充たしうるWeb Beanが一つより多く存在することを発見した場合、Web Beanの相対的な優先度を考慮します。もし、あるWeb Beanが他より高い優先度をもっているならば、そのWeb Beanが選択され、注入されます。今回の例では、結合テスト環境で実行する場合に、Web Beanマネージャは<literal>MockPaymentProcessor</literal>を注入することになります（これが、まさに望みどおりの動作です）。
ko_kr: 하나 이상의 Web Bean이 삽입 지점에 의해 지정된 계약 (API 유형 및 바인딩 어노테이션)에 만족할 수 있음을 관리자가 발견할 때 마다, 이는 Web Beans의 관련된 우선 순위를 고려합니다. 하나의 Web Bean이 다른 것 보다 높은 우선 순위를 갖을 경우, 삽입될 보다 높은 우선 순위의 Web Bean을 선택합니다. 예에서, 통합 테스트 환경 (실제적으로 원하는 환경)에서 실행할 때 Web Bean 관리자는 <literal>MockPaymentProcessor</literal>를 삽입하게 됩니다.
zh_cn: 无论何时管理器发现有多个Web Bean能够满足一个注入点指定的合约（API类型加上绑定注释），它都会考虑Web Beans的相对优先级。它将注入拥有更高优先级的Web Bean。在我们这个例子中，当系统运行在整合测试环境中（这是我们想要的），Web Bean管理器将注入 <literal>MockPaymentProcessor</literal> 对象。
zh_tw: 每當管理員發現了多於一個 Web Bean 可滿足由某個注入點所指定的合同（API 類型加上綁定標記）時，它會考量到 Web Bean 的相關優先權。若有一方的優先權較高，它便會選擇優先權較高的那個 Web Bean 來注入。因此，在我們的範例中，當 Web Bean 管理員執行於我們的整合測試環境中的時候（這正是我們想要的），它將會注入 <literal>MockPaymentProcessor</literal>。

source: It's interesting to compare this facility to today's popular manager architectures. Various "lightweight" containers also allow conditional deployment of classes that exist in the classpath, but the classes that are to be deployed must be explicity, individually, listed in configuration code or in some XML configuration file. Web Beans does support Web Bean definition and configuration via XML, but in the common case where no complex configuration is required, deployment types allow a whole set of Web Beans to be enabled with a single line of XML. Meanwhile, a developer browsing the code can easily identify what deployment scenarios the Web Bean will be used in.
de_de: Es ist interessant dies mit den heutzutage beliebten Manager Architekturen zu vergleichen. Verschiedene "leichtgewichtige" Container gestatten uns auch das bedingte Deployment von im Klassenpfad existierenden Klassen, aber Klassen, die deployt werden sollen müssen explizit, individuell im Konfigurationscode oder einer XML-Konfigurationsdatei aufgeführt sein. Web Beans unterstützt die Web Bean Definition und Konfiguration via XML, aber im gängigen Fall, in dem keine komplexe Konfiguration erforderlich ist, gestatten Deployment-Types die Aktivierung eines gesamten Satzes von Web Beans mittels einer einzigen XML-Zeile. Währenddessen kann ein den Code durchsehender Entwickler leicht einsehen, in welchen Deployment-Szenarien das Web Bean eingesetzt wird.
es_es: Es interesante comparar esta facilidad con las arquitecturas populares del administrador de hoy. Varios contenedores "ligeros" también permiten el despliegue condicional de clases existentes en el classpath, pero las clases que van a ser desplegadas deben ser explícitamente, listadas de modo individual en el código de configuración o en algún archivo de configuración XML. Web Beans no admite definición de Web Bean ni configuración vía XML, pero en el común de los casos donde no se requiere una configuración compleja, los tipos de despliegue permiten habilitar un conjunto completo de Web Beans con una sóla línea de XML. Mientras tanto, un desarrollador que esté navegando el código puede fácilmente identificar en qué escenarios de despliegue se utilizará el Web Bean.
it_it: E' interessante confrontare questa funzionalità con le architetture di gestone oggi in voga. Vari container "lightweight" permettono il deploy condizionale di classi che esistono nel classpath, ma le classi che devono essere installate devono essere elencate esplicitamente ed individualmente nel codice di configurazione o in qualche file XML di configurazione. Web Beans supporta certo la definizione e configurazione dei Web Bean attraverso l'XML, ma nei casi comuni in cui non si renda necessaria una configurazione complicata, i tipi di deploy permettono di abilitare un insieme completo di Web Bean con una sola linea di XML. Al contempo, uno sviluppatore che esamini il codice, potrà facilmente identificare gli scenari di deploy in cui il Web Bean sarà utilizzato.
ja_jp: このような仕組みを、最近の人気のあるマネージャのアーキテクチャと比較すると面白いでしょう。様々な、いわゆる"軽量"コンテナにおいて、クラスパスに存在するクラスを条件つきでデプロイすることは可能です。しかし、それらは、設定のためのコードやXMLの設定ファイルに設定を列挙することよって、あくまで明示的に、そして個別に行わなければなりません。WebnBeansでは、Web Beanの設定をXMLを通じて定義することもできますが、複雑な設定が必要ない通常の場合においては、デプロイメントタイプによってすべてのWeb Beanの集合をXML中の一行で有効にすることができます。と同時に、開発者はコードを見るだけで、簡単に、そのWeb Beanがどのシナリオにおいて使用されるのかということをつきとめることができます。
ko_kr: 이러한 기능을 오늘날의 관리자 구조와 비교하는 것은 흥미로운 일입니다. 다양한 "경량"의 컨테이너는 classpath에 있는 클래스의 조건부 배치를 허용하지만, 배치될 클래스는 명시적, 개별적이어하며, 설정 코드나 일부 XML 설정 파일에 나열되어 있어야 합니다. Web Beans는 XML을 통한 Web Bean 정의 및 설정을 지원하지만 복잡한 설정을 필요로 하지 않는 대부분의 경우, 배치 유형은 전체 Web Beans 설정이 단일 XML 행으로 활성화되게 합니다. 동시에, 코드를 검색하는 개발자는 어떤 배치 시나리오를 Web Bean이 사용할 지를 쉽게 인식할 수 있습니다.
zh_cn: 将其和当今流行的管理器体系比较是很有意思的。各种 "轻量级"的容器也许也可以支持条件化部署在类路径中的类，但是这些需要部署的类必须显式地，逐个地列在配置代码或某个XML配置文件中。Web Bean当然支持通过XML来定义和配置Web Bean，但是多数情况下，只要不需要复杂的配置，部署类型可以使用一行XML就能配置一整套Web Beans。同时，浏览代码的开发者可以很容易识别这些Web Bean应该部署在哪些场景中。
zh_tw: 和現今多人使用的管理員架構相較之下，這個功能相當地有趣。各種「lightweight」的 container 都允許存在 classpath 中的 class 的條件性建置，不過要被建置的 class 必須要明確、各別地列在配置程式碼或是一些 XML 配置檔案中。Web Bean 不支援透過 XML 的 Web Bean 定義與配置，不過在一般情況下當不需要複雜的配置時，deployment type 允許一整組 Web Bean 能夠透過 XML 中的一個單獨行列來被啟用。其間，瀏覽程式碼的開發人員能夠輕易地分辨出 Web Bean 將會使用哪種建置方案（deployment scenario）。

source: Example deployment types
de_de: Beispiel Deployment-Typen
es_es: Ejemplo de tipos de despliegue
it_it: Esempio dei tipi di deploy
ja_jp: デプロイメントタイプの例
ko_kr: 배치 유형 예시
zh_cn: 部署类型样例
zh_tw: 範例 deployment type

source: Deployment types are useful for all kinds of things, here's some examples:
de_de: Deployment-Typen sind hilfreich für allerlei Dinge, hier sind ein paar Beispiele:
es_es: Los tipos de despliegue son útiles para toda clase de cosas, algunos ejemplos a continuación:
it_it: I tipi di deploy sono utili in molte situazioni. Di seguito riportiamo alcuni esempi:
ja_jp: デプロイメントタイプは様々な用途に使用できます。以下に例を示します。
ko_kr: 배치 유형은 모든 종류가 유용합니다, 다음에는 일부 예시가 있습니다:
zh_cn: 部署类型对所有事情都很有用，这是一些例子：
zh_tw: Deployment type 針對於許多情況都相當便於使用，以下為一些範例：

source: <literal>@Mock</literal> and <literal>@Staging</literal> deployment types for testing
de_de: <literal>@Mock</literal> und <literal>@Staging</literal> Deployment-Typen zu Testzwecken
es_es: Tipos de despliegue <literal>@Mock</literal> y <literal>@Staging</literal> para pruebas
it_it: i tipi di deploy individuati da <literal>@Mock</literal> e <literal>@Staging</literal> per i test
ja_jp: テスト作業における<literal>@Mock</literal>や<literal>@Staging</literal>の使用
ko_kr: 테스트 용 <literal>@Mock</literal> 및 <literal>@Staging</literal> 배치 유형
zh_cn: <literal>@Mock</literal> 和 <literal>@Staging</literal> 是为测试准备的部署类型
zh_tw: 用來測試的 <literal>@Mock</literal> 和 <literal>@Staging</literal> deployment type

source: <literal>@AustralianTaxLaw</literal> for site-specific Web Beans
de_de: <literal>@AustralianTaxLaw</literal> für site-spezifische Web Beans
es_es: <literal>@AustralianTaxLaw</literal> para Web Beans de sitio específico
it_it: il tipo di deploy <literal>@AustralianTaxLaw</literal> per i Web Bean di un'applicazione specifica
ja_jp: 特定のサイトに依存するWeb Beanにおける<literal>@AustralianTaxLaw</literal>の使用
ko_kr: 특정 사이트 Web Beans 용 <literal>@AustralianTaxLaw</literal>
zh_cn: <literal>@AustralianTaxLaw</literal> 是为特殊站点的Web Beans提供的部署类型
zh_tw: <literal>@AustralianTaxLaw</literal> 可用於網站特屬的 Web Bean

source: <literal>@SeamFramework</literal>, <literal>@Guice</literal> for third-party frameworks which build on Web Beans
de_de: <literal>@SeamFramework</literal>, <literal>@Guice</literal> für Frameworks Dritter, die auf Web Beans bauen
es_es: <literal>@SeamFramework</literal>, <literal>@Guice</literal> para marcos de terceras partes generados en Web Beans
it_it: i tipi di deploy <literal>@SeamFramework</literal> e <literal>@Guice</literal> per framework di terze parti basati su Web Beans
ja_jp: Web Beansの上に構築されたサードパーティのフレームワークにおける<literal>@SeamFramework</literal>や<literal>@Guice</literal>の使用
ko_kr: Web Beans에서 작성되는 제삼자 프레임워크 용 <literal>@SeamFramework</literal>, <literal>@Guice</literal>
zh_cn: <literal>@SeamFramework</literal>, <literal>@Guice</literal> 是为构建在Web Bean之上的第三方框架提供的部署类型
zh_tw: <literal>@SeamFramework</literal>、<literal>@Guice</literal> 可用於建立在 Web Bean 上的第三方 framework

source: <literal>@Standard</literal> for standard Web Beans defined by the Web Beans specification
de_de: <literal>@Standard</literal> für standardmäßige, durch die Web Beans Spezifikation definierte Web Beans
es_es: <literal>@Standard</literal>para Web Beans estándar definidos por la especificación Web Beans
it_it: <literal>@Standard</literal> per Web Bean standard definiti dalle specifiche di Web Beans
ja_jp: Web Beans仕様によって定義された標準Web Beanにおける<literal>@Standard</literal>の使用
ko_kr: Web Beans 사양에 의해 정의된 표준 Web Beans 용 <literal>@Standard</literal>
zh_cn: <literal>@Standard</literal> 是为Web Bean规范定义的标准Web Bean提供的部署类型
zh_tw: <literal>@Standard</literal> 可用於以 Web Bean 規格所定義的標準 Web Bean

source: I'm sure you can think of more applications...
de_de: Ihnen fallen sicher noch andere Anwendungen ein...
es_es: Estamos seguros que puede pensar en más aplicaciones...
it_it: Sono sicuro che siate in grado di escogitare altre applicazioni...
ja_jp: 他にも色々な使用方法が考えられるかと思います。
ko_kr: 더 많은 애플리케이션을 생각하실 수 있을 것입니다...
zh_cn: 我确信你可以想到更多的应用...
zh_tw: 我們相信您還能夠聯想到更多應用程式...

source: Fixing unsatisfied dependencies
de_de: Unbefriedigende Abhängigkeiten beheben
es_es: Corregir dependencias insatisfechas
it_it: Risoluzione di dipendenze non soddisfatte
ja_jp: 依存性を充たすように修正する
ko_kr: 불만족스러운 의존성 수정
zh_cn: 修正没有满足条件的依赖
zh_tw: 修正相依性不足（unsatisfied dependencies）的問題

source: The typesafe resolution algorithm fails when, after considering the binding annotations and and deployment types of all Web Beans that implement the API type of an injection point, the Web Bean manager is unable to identify exactly one Web Bean to inject.
de_de: Der typensichere Auflösungsalgorithmus schlägt fehl, wenn - nach Betrachtung der Binding-Annotationen und der Deployment-Typen aller den API-Typ implementierender Web Beans eines Einspeisungspunktes - der Web Bean Manager nicht dazu in der Lage ist, ein einzuspeisendes Web Bean zu identifizieren.
es_es: El algoritmo de resolución typesafe falla cuando, después de considerar las anotaciones de enlace y los tipos de despliegue de todos los Web Beans que implementan el tipo API de un punto de inyección, el administrador de Web Bean no puede identificar con precisión un Web Bean para inyectar.
it_it: L'algoritmo di risoluzione sicura rispetto ai tipi fallisce quando, dopo avere considerato le binding annotation e i tipi di deploy di tutti i Web Bean che implementano il tipo di un punto di iniezione, il manager Web Bean non è in grado di identificare esattamente uno ed un solo Web Bean da iniettare.
ja_jp: 注入箇所のAPIタイプを実装したすべてのWeb Beanのバインディングアノテーションやデプロイメントタイプを考慮した結果、Web Beanマネージャが注入すべきWeb Beanを一つに絞りきれない場合、タイプセーフな解決アルゴリズムは失敗します。
zh_cn: 考虑到所有实现一个注入点API类型的Web Bean的绑定注释和部署类型类型，如果解析算法失败，那么Web Bean管理器无法识别究竟应该注入哪个Web Bean。
zh_tw: 就所有實做某個注入點的 API 類型的 Web Bean 綁定標記和 deployment type 來講，若 Web Bean 管理員無法辨識出正好一個需被注入的 Web Bean 為何，那麼 typesafe 解析演算法便會失敗。

source: It's usually easy to fix an <literal>UnsatisfiedDependencyException</literal> or <literal>AmbiguousDependencyException</literal>.
de_de: Es ist in der Regel einfach, Probleme mit einer <literal>UnsatisfiedDependencyException</literal> oder <literal>AmbiguousDependencyException</literal> zu beheben.
es_es: Por lo general es fácil corregir una <literal>UnsatisfiedDependencyException</literal> o una <literal>AmbiguousDependencyException</literal>.
it_it: Di solito è semplice porre rimedio a un'eccezione <literal>UnsatisfiedDependencyException</literal> o <literal>AmbiguousDependencyException</literal>.
ja_jp: 通常、<literal>UnsatisfiedDependencyException</literal>や<literal>AmbiguousDependencyException</literal>を修正することは簡単です。
ko_kr: <literal>UnsatisfiedDependencyException</literal> 또는 <literal>AmbiguousDependencyException</literal>을 수정하기가 쉽습니다.
zh_cn: 通常我们很容易修正一个<literal>UnsatisfiedDependencyException</literal> 或者 <literal>AmbiguousDependencyException</literal>。
zh_tw: 要修正一個 <literal>UnsatisfiedDependencyException</literal> 或 <literal>AmbiguousDependencyException</literal> 通常相當容易。

source: To fix an <literal>UnsatisfiedDependencyException</literal>, simply provide a Web Bean which implements the API type and has the binding types of the injection point&#151;or enable the deployment type of a Web Bean that already implements the API type and has the binding types.
es_es: Para corregir una <literal>UnsatisfiedDependencyException</literal>, basta con proporcionar un Web Bean que implemente el tipo API y tenga los tipos de enlace del punto de inyección&#151;o permita el tipo de despliegue de un Web Bean que ya implemente el tipo API y tenga los tipos de enlace.
it_it: Per rimediare ad una <literal>UnsatisfiedDependencyException</literal>, si deve semplicemente fornire un Web Bean che implementi il tipo dell'API in uso e abbia gli stessi tipi di binding del punto di iniezione#151;o si deve abilitare il tipo di deploy di un Web Bean che già implementa il tipo dell'API in uso e possiede i tipi di binding in esame.
zh_tw: 若要修正一項 <literal>UnsatisfiedDependencyException</literal>，只要提供一個實做 API 類型並且擁有注入點的綁定類型的 Web Bean 即可&#151;或是啟用一個已實做 API 類型並且擁有綁定類型的 Web Bean 的 deployment type 即可。

source: To fix an <literal>AmbiguousDependencyException</literal>, introduce a binding type to distinguish between the two implementations of the API type, or change the deployment type of one of the implementations so that the Web Bean manager can use deployment type precedence to choose between them. An <literal>AmbiguousDependencyException</literal> can only occur if two Web Beans share a binding type and have exactly the same deployment type.
de_de: Um eine <literal>AmbiguousDependencyException</literal> zu beheben, führen Sie einen Binding-Typ ein, um zwischen den beiden Implementierungen des API-Typs zu unterscheiden oder ändern Sie den Deployment-Typ einer der Implementierungen damit der Web Bean Manager Deployment-Typ Präzedenz zur Auswahl zwischen den beiden verwenden kann. Eine <literal>AmbiguousDependencyException</literal> kann nur vorkommen, wenn zwei Web Beans sich einen Binding-Typ teilen und genau denselben Deployment-Typ besitzen.
es_es: Para corregir una <literal>AmbiguousDependencyException</literal>, introduzca un tipo de enlace para distinguir entre las dos implementaciones del tipo de API o cambie el tipo de despliegue de una de las implementaciones con el fin de que el administrador de Web Bean pueda utilizar la prioridad de tipo de despliegue para escoger entre ellas. Una <literal>AmbiguousDependencyException</literal> sólo puede presentarse si dos Web Beans comparten un tipo de enlace y tienen exactamente el mismo tipo de despliegue.
it_it: Per porre rimedio a una <literal>AmbiguousDependencyException</literal>, si deve introdurre un tipo di binding per distinguere tra le due implementazioni del tipo delle API, o si deve cambiare il tipo di deploy di una delle implementazione in modo che il manager Web Bean possa usare la precedenza dei tipi di deploy per scegliere fra di essi. Una <literal>AmbiguousDependencyException</literal> può verificarsi soltanto se due Web Bean condividono il tipo di binding e hanno esattamente lo stesso tipo di deploy.
ja_jp: <literal>AmbiguousDependencyException</literal>を修正するには、APIタイプを実装する二つのWeb Beanを区別することができるバインディングタイプを導入するか、もしくは、片方のWeb Beanのデプロイメントタイプを変更し、Web Beanマネージャがデプロイメントタイプの優先度によってどちらかを選択できるようにします。<literal>AmbiguousDependencyException</literal>は、二つのWeb Beanがバインディングタイプを共有し、全く同じデプロイメントタイプを持つときにのみ、起こり得ます。
ko_kr: <literal>AmbiguousDependencyException</literal>을 수정하려면, 두 개의 API 유형 구현 사이에서 구별하기 위해 바인딩 유형을 소개하거나 구현 중 하나의 배치 유형을 변경하여 Web Bean 관리자가 이들 사이에서 선택하기 위해 배치 유형 우선 순위를 사용할 수 있습니다. <literal>AmbiguousDependencyException</literal>은 두 개의 Web Beans가 바인딩 유형을 공유하여 동일한 배치 유형을 갖고 있을 때에만 발생할 수 있습니다.
zh_cn: 要修正一个 <literal>AmbiguousDependencyException</literal>，我们需要引入一个绑定类型来区分API类型的两个不同的实现，或者改变其中一个实现的部署类型以便Web Bean管理器可以使用部署类型优先级来决定究竟部署哪一个实现。只有两个Web Bean共享一个绑定类型并且拥有相同部署类型的时候才会抛出 <literal>AmbiguousDependencyException</literal> 。
zh_tw: 若要修正一項 <literal>AmbiguousDependencyException</literal>，您可加入一個綁定類型來在兩個 API 類型的實做之間進行分辨，或是更改其中一個實做的 deployment type，這樣一來 Web Bean 管理員便可透過使用 deployment type 優先權來在它們之間作選擇。<literal>AmbiguousDependencyException</literal> 只會在有兩個 Web Bean 共享一個綁定類型並擁有相同 deployment type 的情況下才會發生。

source: There's one more issue you need to be aware of when using dependency injection in Web Beans.
de_de: Es gibt eine weitere Sache, derer man sich bei der Verwendung von "Dependency"-Einspeisung in Web Beans gewahr sein sollte.
es_es: Hay algo más que necesita saber cuando utilice inyección de dependencia en Web Beans.
it_it: Vi è un ulteriore questione di cui occorre essere a conoscenza quando si usa la dependency injection in Web Beans.
ja_jp: Web Beansにおける依存性注入を行う際に気をつけるべきことが、もう少しあります。
ko_kr: Web Beans에서 의존성 삽입을 사용할 때 유의하셔야 할 사항이 한 가지 더 있습니다.
zh_cn: 使用Web Bean依赖注入的时候还需要注意一个问题。
zh_tw: 當您在 Web Bean 中使用依賴注入時，您還需要注意一個問題。

source: Client proxies
es_es: Los proxy de cliente
it_it: Client proxy
ja_jp: クライアントプロキシ
ko_kr: 클라이언트 프록시
zh_cn: 客户代理
zh_tw: 客戶端代理伺服器（Client proxies）

source: Clients of an injected Web Bean do not usually hold a direct reference to a Web Bean instance.
de_de: Clients eines eingespeisten Web Beans enthalten in der Regel keinen direkten Verweis an eine Web Bean Instanz.
es_es: Los clientes de un Web Bean inyectado no suelen mantener una referencia directa a una instancia de Web Bean.
it_it: I client di un Web Bean che sono stati iniettati solitamente non hanno un riferimento diretto all'istanza del Web Bean.
ja_jp: 注入されたWeb Beanのクライアントは、通常、Web Beanインスタンスに対する直接的な参照を持ちません。
ko_kr: 삽입된 Web Bean 클라이언트는 Web Bean 인스턴스에 직접적인 참조를 유지하지 않습니다.
zh_cn: 注入的Web Bean的客户通常不会直接拥有这个Web bean实例的引用。
zh_tw: 一個已注入的 Web Bean 的客戶端通常不會持有一個 Web Bean instance 的直接參照。
