Repository: 1tchy/core
Catalog: reference/*/interceptors.po
Languages: de_de

source: Interceptors
de_de: Interzeptoren

source: Web Beans re-uses the basic interceptor architecture of EJB 3.0, extending the functionality in two directions:
de_de: Web Beans verwenden die grundlegende Interzeptor-Architektur von EJB 3.0, wobei die Funktionalität in zwei Richtungen erweitert wird:

source: Any Web Bean may have interceptors, not just session beans.
de_de: Jedes Web Bean kann Interzeptoren besitzen, nicht nur Session Beans.

source: Web Beans features a more sophisticated annotation-based approach to binding interceptors to Web Beans.
de_de: Web Beans bieten eine fortgeschrittenere auf Annotationen basierende Vorgehensweise bei der Bindung von Interzeptoren an Web Beans.

source: The EJB specification defines two kinds of interception points:
de_de: Die EJB-Spezifikation definiert zwei Arten von Abfangpunkten (sog. "Interception Points"):

source: business method interception, and
de_de: Business Methoden Interception und

source: lifecycle callback interception.
de_de: Lebenszyklus-Callback Interception.

source: A <emphasis>business method interceptor</emphasis> applies to invocations of methods of the Web Bean by clients of the Web Bean:
de_de: Ein <emphasis>Business Methoden Interzeptor</emphasis> gilt für Aufrufe von Methoden des Web Beans durch Clients des Web Beans:

source: A <emphasis>lifecycle callback interceptor</emphasis> applies to invocations of lifecycle callbacks by the container:
de_de: Ein <emphasis>Lebenszyklus Callback-Interzeptor</emphasis> gilt für Aufrufe von Lebenszyklus Callbacks durch den Container:

source: An interceptor class may intercept both lifecycle callbacks and business methods.
de_de: Eine Interzeptorklasse kann sowohl Lebenszyklus-Callbacks als auch Business-Methoden abfangen.

source: Interceptor bindings
de_de: Interzeptor-Bindings

source: Suppose we want to declare that some of our Web Beans are transactional. The first thing we need is an <emphasis>interceptor binding annotation</emphasis> to specify exactly which Web Beans we're interested in:
de_de: Nehmen wir an, wir wollten deklarieren, dass einige unserer Web Beans transaktional sind. Das erste, was wir benötigen ist eine <emphasis>Interzeptor bindende Annotation</emphasis>, um festzulegen, für welches Web Bean wir uns interessieren:

source: Now we can easily specify that our <literal>ShoppingCart</literal> is a transactional object:
de_de: Jetzt können wir ganz leicht unser <literal>ShoppingCart</literal> als ein transaktionales Objekt festlegen:

source: Or, if we prefer, we can specify that just one method is transactional:
de_de: Oder, falls uns das lieber ist, können wir festlegen, dass nur eine Methode transaktional ist:

source: Implementing interceptors
de_de: Implementierung von Interzeptoren

source: That's great, but somewhere along the line we're going to have to actually implement the interceptor that provides this transaction management aspect. All we need to do is create a standard EJB interceptor, and annotate it <literal>@Interceptor</literal> and <literal>@Transactional</literal>.
de_de: Das ist toll, aber irgendwann müssen wir den den Managementaspekt dieser Transaktion liefert, implementieren. Wir müssen nur einen standardmäßigen EJB-Interzeptor erstellen und ihn mit <literal>@Interceptor</literal> und <literal>@Transactional</literal> annotieren.

source: All Web Beans interceptors are simple Web Beans, and can take advantage of dependency injection and contextual lifecycle management.
de_de: Bei allen Web Beans Interzeptoren handelt es sich um einfache Web Beans und sie können "Dependency"-Einspeisung und kontextuelles Lebenszyklus-Management nutzen.

source: Multiple interceptors may use the same interceptor binding type.
de_de: Mehrere Interzeptoren können denselben Interzeptor Binding-Typ verwenden.

source: Enabling interceptors
de_de: Interzeptoren aktivieren

source: Finally, we need to <emphasis>enable</emphasis> our interceptor in <literal>web-beans.xml</literal>.
de_de: Schließlich müssen wir unseren Interzeptor in <literal>web-beans.xml</literal> <emphasis>aktivieren</emphasis>.

source: Whoah! Why the angle bracket stew?
de_de: Puh! Warum diese Suppe an Klammern?

source: Well, the XML declaration solves two problems:
de_de: Nun, die XML-Deklaration löst zwei Probleme:

source: it enables us to specify a total ordering for all the interceptors in our system, ensuring deterministic behavior, and
de_de: Sie ermöglicht es uns, eine totale Reihenfolge für alle Interzeptoren in unserem System festzulegen, wodurch deterministisches Verhalten festgelegt wird und

source: it lets us enable or disable interceptor classes at deployment time.
de_de: Interzeptor-Klassen zum Zeitpunkt des Deployments aktiviert oder deaktiviert werden können.

source: For example, we could specify that our security interceptor runs before our <literal>TransactionInterceptor</literal>.
de_de: Zum Beispiel könnten wir festlegen, dass unser Sicherheitsinterzeptor vor unserem <literal>TransactionInterceptor</literal> ausgeführt wird.

source: Or we could turn them both off in our test environment!
de_de: Oder wir könnten sie beide in unserer Testumgebung abschalten!

source: Interceptor bindings with members
de_de: Interzeptor-Bindings mit Mitgliedern

source: Suppose we want to add some extra information to our <literal>@Transactional</literal> annotation:
de_de: Nehmen wir an, wir wollten unserer <literal>@Transactional</literal>-Annotation weitere Informationen hinzufügen:

source: Web Beans will use the value of <literal>requiresNew</literal> to choose between two different interceptors, <literal>TransactionInterceptor</literal> and <literal>RequiresNewTransactionInterceptor</literal>.
de_de: Web Beans verwendet den Wert von <literal>requiresNew</literal> zur Auswahl zwischen zwei verschiedenen Interzeptoren <literal>TransactionInterceptor</literal> und <literal>RequiresNewTransactionInterceptor</literal> auszuwählen.

source: Now we can use <literal>RequiresNewTransactionInterceptor</literal> like this:
de_de: Jetzt können wir <literal>RequiresNewTransactionInterceptor</literal> wie folgt verwenden:

source: But what if we only have one interceptor and we want the manager to ignore the value of <literal>requiresNew</literal> when binding interceptors? We can use the <literal>@NonBinding</literal> annotation:
de_de: Was aber, wenn wir über nur einen Interzeptor verfügen und wir wollen, dass der Manager bei der Bindung der Interzeptoren den Wert von <literal>requiresNew</literal> ignoriert? Wir können die <literal>@NonBinding</literal>-Annotation verwenden:

source: Multiple interceptor binding annotations
de_de: Multiple Interzeptor bindende Annotationen

source: Usually we use combinations of interceptor bindings types to bind multiple interceptors to a Web Bean. For example, the following declaration would be used to bind <literal>TransactionInterceptor</literal> and <literal>SecurityInterceptor</literal> to the same Web Bean:
de_de: In der Regel verwenden wir Kombinationen von Interzeptor-Binding-Typen, um mehrere Interzeptoren an ein Web Bean zu binden. Folgende Deklaration etwa würde verwendet, um <literal>TransactionInterceptor</literal> und <literal>SecurityInterceptor</literal> an dasselbe Web Bean zu binden:

source: However, in very complex cases, an interceptor itself may specify some combination of interceptor binding types:
de_de: In sehr komplexen Fällen aber kann ein Interzeptor selbst eine Kombination von Interzeptor-Binding-Typen festlegen:

source: Then this interceptor could be bound to the <literal>checkout()</literal> method using any one of the following combinations:
de_de: Dann könnte dieser Interzeptor an die <literal>checkout()</literal>-Methode gebunden werden, indem eine der folgenden Kombinationen verwendet wird:

source: Interceptor binding type inheritance
de_de: Vererbung von Interzeptor-Binding-Typen

source: One limitation of the Java language support for annotations is the lack of annotation inheritance. Really, annotations should have reuse built in, to allow this kind of thing to work:
de_de: Eine Einschränkung des Java Sprach-Supports für Annotationen ist das Fehlen von Annotationsvererbung. Eigentlich sollten Annotationen eine eingebaute Wiederverwendung besitzen, damit diese Art von Sache funktioniert:

source: Well, fortunately, Web Beans works around this missing feature of Java. We may annotate one interceptor binding type with other interceptor binding types. The interceptor bindings are transitive &#151; any Web Bean with the first interceptor binding inherits the interceptor bindings declared as meta-annotations.
de_de: Nun, zum Glück umgeht Web Beans dieses fehlende Feature von Java. Wir können einen Interzeptor Binding-Typ mit anderen Interzeptor Binding-Typen annotieren. Die Interzeptor-Bindings sind transitive &#151; jedes Web Bean mit demselben Interzeptor-Binding erbt die als Meta-Annotationen deklarierten Interzeptor-Bindings.

source: Any Web Bean annotated <literal>@Action</literal> will be bound to both <literal>TransactionInterceptor</literal> and <literal>SecurityInterceptor</literal>. (And even <literal>TransactionalSecureInterceptor</literal>, if it exists.)
de_de: Jedes mit <literal>@Action</literal> annotierte Web Bean wird sowohl an <literal>TransactionInterceptor</literal> als auch <literal>SecurityInterceptor</literal> gebunden. (Und sogar an <literal>TransactionalSecureInterceptor</literal>, falls es existiert).

source: Use of <literal>@Interceptors</literal>
de_de: Verwendung von <literal>@Interceptors</literal>

source: The <literal>@Interceptors</literal> annotation defined by the EJB specification is supported for both enterprise and simple Web Beans, for example:
de_de: Die durch die EJB-Spezifikation definierte <literal>@Interceptors</literal>-Annotation wird sowohl für Enterprise als auch einfache Web Beans unterstützt, zum Beispiel:

source: However, this approach suffers the following drawbacks:
de_de: Allerdings besitzt diese Vorgehensweise folgende Nachteile:

source: the interceptor implementation is hardcoded in business code,
de_de: Die Interzeptorimplementierung ist im Business Code hardkodiert,

source: interceptors may not be easily disabled at deployment time, and
de_de: Interzeptoren können zum Deployment-Zeitpunkt nicht einfach deaktiviert werden und

source: the interceptor ordering is non-global &#151; it is determined by the order in which interceptors are listed at the class level.
de_de: Die Interzeptorreihenfolge ist nicht allgemeingültig &#151; sie wird durch die Reihenfolge, in der Interzeptoren auf Klassenebene aufgeführt sind, festgelegt.

source: Therefore, we recommend the use of Web Beans-style interceptor bindings.
de_de: Daher empfehlen wir die Verwendung von Interzeptor-Bindings im Web Beans Stil.
