Repository: 1tchy/core
Catalog: reference/*/intro.po
Languages: de_de, it_it, ja_jp

source: A Web Bean comprises:
de_de: Ein Web Bean besteht aus:
it_it: Un Web Bean comprende:
ja_jp: Web Bean は以下の要素から構成されます:

source: A (nonempty) set of API types
de_de: Einem (nicht leeren) Satz von API-Typen
it_it: Un set (non vuoto) di tipi di API
ja_jp: (空ではない) API タイプのセット

source: A (nonempty) set of binding annotation types
de_de: Einem (nicht leeren) Satz von bindenden Annotationstypen
it_it: Un set (non vuoto) di tipi di annotazione di binding
ja_jp: (空ではない) バインディングアノテーションタイプのセット

source: A scope
de_de: Einem Geltungsbereich
it_it: Uno scope
ja_jp: スコープ

source: A deployment type
de_de: Einem Deployment-Typ
it_it: Un tipo di deploy
ja_jp: デプロイメントタイプ

source: Optionally, a Web Bean name
de_de: Optional einem Web Bean Namen
it_it: Opzionalmente un nome Web Bean
ja_jp: (オプションの) Web Bean 名

source: A set of interceptor binding types
de_de: Ein Satz Interzeptor Binding-Typen
it_it: Un set di tipi di interceptor binding
ja_jp: インタセプタのバインディングタイプのセット

source: A Web Bean implementation
de_de: Einer Web Bean Implementierung
it_it: Un implementazione Web Bean
ja_jp: Web Bean インプリメンテーション

source: Let's see what some of these terms mean, to the Web Bean developer.
de_de: Sehen wir uns jetzt genauer an, was diese Begriffe für einen Entwickler von Web Beans bedeuten.
it_it: Vediamo cosa significano alcuni di questi termini per lo sviluppatore Web Bean.
ja_jp: Web Bean 開発者にとって、これらの用語が何を意味するのか確認しましょう。

source: API types, binding types and dependency injection
de_de: API-Typen, Binding-Typen und Dependency-Einspeisung
it_it: Tipi di API, tipi di binding e dependency injection
ja_jp: API タイプとバインディングタイプと依存性注入

source: Web Beans usually acquire references to other Web Beans via dependency injection. Any injected attribute specifies a "contract" that must be satisfied by the Web Bean to be injected. The contract is:
de_de: Web Beans erhalten Verweise auf andere Web Beans in der Regel via "Dependency"-Einspeisung. Jedes eingespeiste Attribut legt einen "Vertrag" fest, der vom einzuspeisenden Web Bean erfüllt sein muss. Der Vertrag lautet:
it_it: I Web Bean solitamente acquisiscono riferimenti ad altri Web Bean tramite la dependency injection. Ogni attributo iniettato specifica un "contratto" che deve essere soddisfatto dal Web Bean per essere iniettato. Il contratto è:
ja_jp: Web Beans は、通常は依存性注入によって他の Web Beans への参照を獲得します。注入されるどの属性も、注入される Web Bean が条件を満たさなければならない「契約」を指定します。契約は以下の通りです:

source: an API type, together with
de_de: ein API-Typ, zusammen mit
it_it: un tipo di API, assieme a
ja_jp: API タイプ

source: a set of binding types.
de_de: einem Satz von Binding-Typen.
it_it: un set di tipi di binding.
ja_jp: バインディングタイプのセット

source: An API is a user-defined class or interface. (If the Web Bean is an EJB session bean, the API type is the <literal>@Local</literal> interface or bean-class local view). A binding type represents some client-visible semantic that is satisfied by some implementations of the API and not by others.
de_de: Bei einem API handelt es sich um eine benutzerdefinierte Klasse oder Interface. (Falls es sich bei dem Web Bean um ein EJB Session Bean handelt, so ist der API-Typ das <literal>@Local</literal>-Interface oder Bean-Klasse lokale Ansicht). Ein Binding-Typ repräsentiert Client-sichtbare Semantik, die von einigen Implementierungen des API erfüllt wird, von anderen wiederum nicht.
it_it: Un API è una classe o interfaccia definita dall'utente. (Se il Web Bean è un session bean EJB, il tipo di API è l'interfaccia <literal>@Local</literal> o la vista locale della classe-bean). Un tipo di binding rappresenta un semantica del client che è soddisfatta da certe implementazioni dell'API e non da altre.
ja_jp: API は、ユーザ定義のクラスあるいはインタフェースです。(もし Web Bean が EJB セッション Bean ならば、API タイプは <literal>@Local</literal> インターフェースか bean クラスのローカルビューです)。バインディングタイプは、API のある実装によっては満たされ他のものでは満足されない、クライアントに見えるセマンティックを表します。

source: Binding types are represented by user-defined annotations that are themselves annotated <literal>@BindingType</literal>. For example, the following injection point has API type <literal>PaymentProcessor</literal> and binding type <literal>@CreditCard</literal>:
de_de: Binding-Typen werden durch benutzerdefinierte Annotationen repräsentiert, die ihrerseits mit <literal>@BindingType</literal> annotiert sind. Zum Beispiel besitzt der folgende Einspeisungspunkt den API-Typ <literal>PaymentProcessor</literal> und Binding-Typ <literal>@CreditCard</literal>:
it_it: I tipi di binding sono rappresentati da annotazioni definite dall'utente che sono loro stesse annotate con <literal>@BindingType</literal>. Per esempio, il seguente punto di iniezione ha un tipo di API <literal>PaymentProcessor</literal> ed un tipo di binding <literal>@CreditCard</literal>:
ja_jp: バインディングタイプは、それ自身が <literal>@BindingType</literal> アノテーションを付与されたユーザ定義のアノテーションによって表されます。例えば、以下のインジェクションポイントは、API タイプ <literal>PaymentProcessor</literal> とバインディングタイプ <literal>@CreditCard</literal> を持っています:

source: If no binding type is explicitly specified at an injection point, the default binding type <literal>@Current</literal> is assumed.
de_de: Wird an einem Einspeisungspunkt kein Binding-Typ explizit festgelegt, so wird vom standardmäßigen Binding-Typ <literal>@Current</literal> ausgegangen.
it_it: Se nessun tipo di binding viene specificato in modo esplicito ad un punto di iniezione, il tipo di binding di default si assume essere <literal>@Current</literal>.
ja_jp: もしどのバインディングタイプもインジェクションポイントで明示的に指定されなければ、デフォルトのバインディングタイプ <literal>@Current</literal> が想定されます。

source: For each injection point, the Web Bean manager searches for a Web Bean which satisfies the contract (implements the API, and has all the binding types), and injects that Web Bean.
de_de: Für jeden Einspeisungspunkt sucht der Web Bean Manager nach einem Web Bean, das den Vertrag erfüllt (das API implementiert und alle Binding-Typen besitzt) und speist dieses Web Bean ein.
it_it: Per ogni punto di iniezione, il manager Web Bean cerca un Web Bean che soddisfi il contratto (che implementi la API, e che abbia tutti i tipi di binding), ed inietta tale Web Bean.
ja_jp: 各々のインジェクションポイントに対して、Web Bean マネージャは、契約(API の実装、すべてのバインディングタイプの所持)の条件を満たす Web Bean を探し、その Web Bean を注入します。

source: The following Web Bean has the binding type <literal>@CreditCard</literal> and implements the API type <literal>PaymentProcessor</literal>. It could therefore be injected to the example injection point:
de_de: Das folgende Web Bean besitzt den Binding-Typ <literal>@CreditCard</literal> und implementiert den API-Typ <literal>PaymentProcessor</literal>. Es könnte daher am Beispiel-Einspeisungspunkt eingespeist werden:
it_it: Il seguente Web Bean ha il tipo binding <literal>@CreditCard</literal> e implementa il tipo API <literal>PaymentProcessor</literal>. Può quindi essere iniettato nel punto di iniezione d'esempio:
ja_jp: 以下の Web Bean は、バインディングタイプ <literal>@CreditCard</literal> を持ち、API タイプ <literal>PaymentProcessor</literal> を実装しています。それゆえ、サンプルのインジェクションポイントに注入することができます:

source: If a Web Bean does not explicitly specify a set of binding types, it has exactly one binding type: the default binding type <literal>@Current</literal>.
de_de: Falls ein Web Bean nicht explizit einen Satz von Binding-Typen festlegt, so besitzt es genau einen Binding-Typ: den standardmäßigen Binding-Typ <literal>@Current</literal>.
it_it: Se un Web Bean non specifica esplicitamente un set di tipi di binding, ha esattamente un solo tipo di binding: il tipo di binding di default <literal>@Current</literal>.
ja_jp: もし Web Bean が明示的にバインディングタイプのセットを指定しなければ、それは１つのバインディングタイプ : デフォルトのバインディングタイプ<literal>@Current</literal> を持つことになります。

source: Web Beans defines a sophisticated but intuitive <emphasis>resolution algorithm</emphasis> that helps the container decide what to do if there is more than one Web Bean that satisfies a particular contract. We'll get into the details in <xref linkend="injection"/>.
de_de: Web Beans definiert einen fortgeschrittenen aber intuitiven <emphasis>Auflösungsalgorithmus</emphasis>, der dem Container dabei hilft zu entscheiden was geschehen soll, wenn mehr als ein Web Bean einen bestimmten Vertrag erfüllt. Wir gehen in <xref linkend="injection"/> näher darauf ein.
it_it: Web Beans definisce un <emphasis>algoritmo di risoluzione</emphasis> sofisticato ma intuitivo che aiuta il container a decidere cosa fare se più di un Web Bean soddisfa un particolare contratto. Vedremo i dettagli in <xref linkend="injection"/>.
ja_jp: Web Beans は、もし特定の契約と満たす１つ以上の Web Bean があったときに、コンテナが何をすべきかを決定するのを助ける洗練されたしかも直観的な <emphasis>解決アルゴリズム</emphasis> を定義します。その詳細は <xref linkend="injection"/> で説明します。

source: Deployment types
de_de: Deployment-Typen
it_it: Tipi di deploy
ja_jp: デプロイメントタイプ

source: <emphasis>Deployment types</emphasis> let us classify our Web Beans by deployment scenario. A deployment type is an annotation that represents a particular deployment scenario, for example <literal>@Mock</literal>, <literal>@Staging</literal> or <literal>@AustralianTaxLaw</literal>. We apply the annotation to Web Beans which should be deployed in that scenario. A deployment type allows a whole set of Web Beans to be conditionally deployed, with a just single line of configuration.
de_de: <emphasis>Deployment-Typen</emphasis> gestatten die Klassifizierung unserer Web Beans mittels Deployment Szenario. Ein Deployment-Typ ist eine Annotation, die ein bestimmtes Deployment-Szenario repräsentiert, etwa <literal>@Mock</literal>, <literal>@Staging</literal> oder <literal>@AustralianTaxLaw</literal>. Wir setzen die Annotation bei Web Beans ein, die in diesem Szenario deployt werden sollten. Ein Deployment-Typ gestattet mit nur einer einzelnen Konfigurationszeile einem ganzen Satz von Web Beans unter Vorbehalt in diesem Szenario deployt zu werden.
it_it: <emphasis>I tipi di deploy</emphasis> consentono di classificare i Web Bean secondo uno scenario di deploy. Un tipo di deploy è un'annotazione che rappresenta un particolare scenario di deploy, per esempio <literal>@Mock</literal>, <literal>@Staging</literal> oppure <literal>@AustralianTaxLaw</literal>. Si applica l'annotazione ai Web Bean che dovrebbero essere deployati in tale scenario. Un tipo di deploy consente ad un intero set di Web Bean di essere deployati in modo condizionato, con una sola linea di configurazione.
ja_jp: <emphasis>デプロイメントタイプ</emphasis> は、デプロイメントシナリオによって Web Beans を分類させます。デプロイメントタイプは、特定のデプロイメントシナリオを表すアノテーション、例えば <literal>@Mock</literal> や <literal>@Staging</literal>、<literal>@AustralianTaxLaw</literal> です。そのシナリオでデプロイされるべき Web Beans にアノテーションを適用します。デプロイメントタイプは、単一の構成で１セットの Web Beans すべてを条件つきでデプロイすることを可能にします。

source: Many Web Beans just use the default deployment type <literal>@Production</literal>, in which case no deployment type need be explicitly specified. All three Web Bean in our example have the deployment type <literal>@Production</literal>.
de_de: Viele Web Beans verwenden nur den standardmäßigen Deployment-Typ <literal>@Production</literal>, in welchem Fall kein Deployment-Typ explizit festgelegt werden muss. Alle drei Web Beans in unserem Beispiel besitzen den Deployment-Typ <literal>@Production</literal>.
it_it: Molti Web Bean usano soltanto il tipo di deploy di default <literal>@Production</literal>, ed in questo caso non occorre specificare esplicitamente nessun tipo di deploy. Tutti e tre i Web Bean d'esempio hanno ul tipo di deploy <literal>@Production</literal>.
ja_jp: 多くの Web Beans は、どのデプロイメントタイプも明示的に指定されていない場合、単にデフォルトのデプロイメントタイプ <literal>@Production</literal> を使用します。サンプルで使用する３つの Web Bean すべては、デプロイメントタイプ <literal>@Production</literal> を持っています。

source: In a testing environment, we might want to replace the <literal>SentenceTranslator</literal> Web Bean with a "mock object":
de_de: In einer Testumgebung können wir das <literal>SentenceTranslator</literal> Web Bean durch ein "mock object" ersetzen:
it_it: In un ambiente di test è possibile sostituire il Web Bean <literal>SentenceTranslator</literal> con un "oggetto mock":
ja_jp: テスト環境では、<literal>SentenceTranslator</literal> Web Bean を「モックオブジェクト」で置き換えたいでしょう:

source: We would enable the deployment type <literal>@Mock</literal> in our testing environment, to indicate that <literal>MockSentenceTranslator</literal> and any other Web Bean annotated <literal>@Mock</literal> should be used.
de_de: Wir würden den Deployment-Typ <literal>@Mock</literal> in unserer Testumgebung aktivieren, um anzuzeigen, dass <literal>MockSentenceTranslator</literal> und ein beliebiges anderes mit <literal>@Mock</literal> annotiertes Web Bean verwendet werden sollen.
it_it: In ambiente di test si dovrebbe abilitare il tipo di deploy <literal>@Mock</literal> per indicare che l'uso di <literal>MockSentenceTranslator</literal> ed ogni altro Web Bean annotato con <literal>@Mock</literal>.
ja_jp: <literal>MockSentenceTranslator</literal> と <literal>@Mock</literal> アノテーションが付与されたその他の Web Bean を使用することを指定するために、テスト環境ではデプロイメントタイプ <literal>@Mock</literal> を有効にします。

source: We'll talk more about this unique and powerful feature in <xref linkend="deploymenttypes"/>.
de_de: In <xref linkend="deploymenttypes"/> gehen wir näher auf dieses einzigartige und leistungsfähige Feature ein.
it_it: Si discuterà questa potente funzionalità con maggior dettaglio in <xref linkend="deploymenttypes"/>."
ja_jp: この独特で強力な機能については <xref linkend="deploymenttypes"/> で説明します。

source: Scope
de_de: Geltungsbereich
ja_jp: スコープ

source: The <emphasis>scope</emphasis> defines the lifecycle and visibility of instances of the Web Bean. The Web Beans context model is extensible, accommodating arbitrary scopes. However, certain important scopes are built-in to the specification, and provided by the Web Bean manager. A scope is represented by an annotation type.
de_de: Der <emphasis>Geltungsbereich</emphasis> definiert den Lebenszyklus und die Sichtbarkeit von Instanzen des Web Beans. Das Web Beans Kontextmodell ist erweiterbar, um arbiträre Geltungsbereiche zu ermöglichen. Jedoch sind bestimmte wichtige Geltungsbereiche in die Spezifikation eingebaut und werden vom Web Bean bereitgestellt. Ein Geltungsbereich wird durch einen Annotationstyp repräsentiert.
it_it: Lo <emphasis>scope</emphasis> definisce il ciclo di vita e la visibilità delle istanze di Web Bean. Il modello di contesto Web Bean è estensibile e facilita gli scope arbitrari. Comunque alcuni importanti scope sono predefiniti all'internodella specifica e vengono forniti dal manager Web Bean. Uno scope è rapresentato da un tipo di annotazione.
ja_jp: <emphasis>スコープ</emphasis> は Web Bean のインスタンスのライフサイクルと可視性を定義します。Web Beans のコンテキストモデルは拡張可能で、任意のスコープを収容できます。しかし、非常に重要なスコープは仕様に組み込まれ、Web Bean マネージャー によって提供されています。スコープはアノテーションタイプによって表されます。

source: For example, any web application may have <emphasis>session scoped</emphasis> Web Beans:
de_de: Web-Anwendungen können zum Beispiel <emphasis>Session-begrenzte</emphasis> Web Beans besitzen:
it_it: Per esempio un'applicazione web può avere Web Bean con <emphasis>scope di sessione</emphasis>
ja_jp: 例えば、どんな Web アプリケーションも <emphasis>セッションスコープ</emphasis> の Web Beansを持っています:

source: An instance of a session scoped Web Bean is bound to a user session and is shared by all requests that execute in the context of that session.
de_de: Eine Instanz eines sessionbegrenzten Web Beans wird an eine Benutzer-Session gebunden und wird von allen im Kontext dieser Session ausführenden Anfragen geteilt.
it_it: Un'istanza di un Web Bean con scope sessione è legato ad una sessione utente ed è condivisa da tutte le richieste che si eseguono nel contesto di tale sessione.
ja_jp: セッションスコープの Web Bean のインスタンスはユーザセッションにバインドされて、そのセッションのコンテキストで実行されるすべてのリクエストによって共有されます。

source: By default, Web Beans belong to a special scope called the <emphasis>dependent pseudo-scope</emphasis>. Web Beans with this scope are pure dependent objects of the object into which they are injected, and their lifecycle is bound to the lifecycle of that object.
de_de: Standardmäßig gehören Web Beans zu einem bestimmten Geltungsbereich namens <emphasis>abhängiger Pseudo-Geltungsbereich</emphasis> (sog. "dependent pseudo-scope"). Web Beans mit diesem Geltungsbereich sind reine abhängige Objekte von demjenigen Objekt, in das sie eingespeist werden und ihr Lebenszyklus ist an den Lebenszyklus eben dieses Objekts gebunden.
it_it: Di default i Web Bean appartengono ad uno speciale scope chiamato <emphasis>pseudo-scope dipendente</emphasis>. Web Bean con questo scope sono oggetti puri dipendenti dall'oggetto nel quale vengono iniettati ed il loro ciclo di vita è legato al ciclo di vita di tale oggetto.
ja_jp: デフォルトでは、Web Beans は <emphasis>依存擬似スコープ</emphasis> と呼ばれる特別なスコープに属します。このスコープをもつ Web Beans は、注入したオブジェクトに純粋に依存するオブジェクトで、ライフサイクルは注入したオブジェクトのライフサイクルに括り付けられます。

source: We'll talk more about scopes in <xref linkend="scopescontexts"/>.
de_de: In <xref linkend="scopescontexts"/> gehen wir näher auf Geltungsbereiche ein.
it_it: Approfondiremo gli scope in <xref linkend="scopescontexts"/>.
ja_jp: スコープの詳細については <xref linkend="scopescontexts"/>で説明します。

source: Web Bean names and Unified EL
de_de: Web Bean Namen und Unified EL
it_it: Nomi Web Bean e Unified EL
ja_jp: Web Bean 名とユニファイド EL

source: A Web Bean may have a <emphasis>name</emphasis>, allowing it to be used in Unified EL expressions. It's easy to specify the name of a Web Bean:
de_de: Ein Web Bean kann einen <emphasis>Namen</emphasis> besitzen, wodurch es möglich ist, dieses in Unified EL Ausdrücken einzusetzen. Das Festlegen eines Namens für ein Web Bean ist ganz einfach:
it_it: Un Web Bean può avere un <emphasis>nome</emphasis> che gli consente di essere usato in un'espressione Unified EL. E' facile specificare il nome del Web Bean:
ja_jp: Web Bean は <emphasis>名前</emphasis> を持ちます。これによりユニファイド EL 式で使用することが可能になります。Web Bean の名前を指定するのは簡単です:

source: Now we can easily use the Web Bean in any JSF or JSP page:
de_de: Jetzt können wir das Web Bean einfach in einer beliebigen JSF- oder JSP-Seite verwenden:
it_it: Ora si può facilmente utilizzare il Web Bean in ogni pagina JSF o JSP:
ja_jp: これで JSF あるいは JSP ページで Web Bean を簡単に使用することができます:

source: It's even easier to just let the name be defaulted by the Web Bean manager:
de_de: Es ist sogar noch einfacher den Name vom Web Bean Manager standardisieren zu lassen:
it_it: Si può anche lasciare assegnare al manager Web Bean il nome di default:
ja_jp: Web Bean マネージャによって名前は単純にデフォルトを使用させることは一層簡単です:

source: In this case, the name defaults to <literal>shoppingCart</literal> &#151; the unqualified class name, with the first character changed to lowercase.
de_de: In diesem Fall wird der Name standardmäßig zu <literal>shoppingCart</literal> &#151; dem nicht vollständigen Klassennamen, wobei der erste Buchstabe klein geschrieben wird.
it_it: In questo caso il nome di default è <literal>shoppingCart</literal> &#151; il nome della classe non qualificata, con il primo carattere messo in minuscolo.
ja_jp: この場合、デフォルトで名前は <literal>shoppingCart</literal> になります&#151; 最初の文字を小文字に変換した無資格のクラス名になります。

source: Interceptor binding types
de_de: Interzeptor Binding-Typen
it_it: Tipi di interceptor binding
ja_jp: インタセプタバインディングタイプ

source: Web Beans supports the interceptor functionality defined by EJB 3, not only for EJB beans, but also for plain Java classes. In addition, Web Beans provides a new approach to binding interceptors to EJB beans and other Web Beans.
de_de: Web Beans unterstützt die von EJB 3 definierte Interzeptor-Funktionalität nicht nur für EJB-Beans, sondern auch für einfache Java-Klassen. Desweiteren bietet Web Beans eine neue Herangehensweise bei der Bindung von Interzeptoren an EJB-Beans und andere Web-Beans.
it_it: Web Beans supporta la funzionalità di interceptor definita da EJB 3, non solo per i bean EJB, ma anche per classi Java semplici (plain). In aggiunta, Web Beans fornisce un nuovo approccio al binding di interceptor nei confronti di bean EJB e di altri Web Beans.
ja_jp: Web Beans は、 EJB beans のためにだけではなく、単純な Java クラスのためにも、EJB 3 で定義されたインタセプタ機能を提供します。さらに、Web Beans は、EJB beans と他の Web Beans へのバインディングインタセプタに新しいアプローチを提供します。

source: It remains possible to directly specify the interceptor class via use of the <literal>@Interceptors</literal> annotation:
de_de: Es bleibt weiterhin möglich, die Interzeptorklasse mittels Verwendung der <literal>@Interceptors</literal>-Annotation direkt festzulegen:
it_it: Rimane la possibilità di specificare direttamente la classe interceptor tramite l'uso dell'annotazione <literal>@Interceptors</literal>.
ja_jp: それは、<literal>@Interceptors</literal> アノテーションを使用することによりインタセプタクラスを直接指定することを可能にします:

source: However, it is more elegant, and better practice, to indirect the interceptor binding through an <emphasis>interceptor binding type</emphasis>:
de_de: Es ist aber eleganter und generell besser das Interzeptor-Binding durch einen <emphasis>Interzeptor-Binding-Typ</emphasis> umzuleiten:
it_it: Comunque è più elegante ed è considerata una pratica migliore quella di giungere indirettamente ad un interceptor binding tramite un <emphasis>tipo di interceptor binding</emphasis>:
ja_jp: しかし、<emphasis>インタセプタバインディングタイプ</emphasis> によりインタセプタバインディングを間接化することは、よりエレガントでより良い手法です:

source: We'll discuss Web Beans interceptors and decorators in <xref linkend="interceptors"/> and <xref linkend="decorators"/>.
de_de: Wir gehen in <xref linkend="interceptors"/> and <xref linkend="decorators"/> näher auf Web Beans Interzeptoren und Dekoratoren ein.
it_it: Si discuteranno gli interceptor e i decoratori di Web BEans in <xref linkend="interceptors"/> e <xref linkend="decorators"/>.
ja_jp: Web Beans インタセプタとデコレータは <xref linkend="interceptors"/> と <xref linkend="decorators"/> で説明します。

source: What kinds of objects can be Web Beans?
de_de: Welche Art von Objekten können Web Beans sein?
it_it: Quali tipi di oggetti possono essere Web Beans?
ja_jp: どの種類のオブジェクトが Web Beans になることができるのか

source: We've already seen that JavaBeans, EJBs and some other Java classes can be Web Beans. But exactly what kinds of objects are Web Beans?
de_de: Wir haben bereits gesehen, dass JavaBeans, EJBs und einige andere Java-Klassen Web Beans sein können. Aber um was für Objekte genau handelt es sich bei Web Beans?
it_it: Si è già visto che JavaBeans, EJB ed altri tipi di classi Java possono essere Web Bean. Ma esattamente quali tipi di oggetti sono Web Beans?
ja_jp: すでに JavaBean や EJB、その他のいくつかの Javaクラス が Web Beans になることを見てきました。しかし、まさにどの種類のオブジェクトが Web Beans になることができるのでしょうか。

source: Simple Web Beans
de_de: Einfache Web Beans
it_it: Web Beans Semplici
ja_jp: 単純な Web Beans

source: The Web Beans specification says that a concrete Java class is a <emphasis>simple</emphasis> Web Bean if:
de_de: Die Web Beans Spezifikation besagt, dass eine konkrete Java-Klasse ein <emphasis>einfaches</emphasis> Web Bean ist, wenn:
it_it: La specifica Web Beans dice che una classe concreta Java è un Web Bean <emphasis>semplice</emphasis> se:
ja_jp: Web Beans 仕様では、以下の条件を満たすときに、コンクリートな Javaクラスが <emphasis>単純な</emphasis> Web Bean になります:

source: it is not an EE container-managed component, like an EJB, a Servlet or a JPA entity,
de_de: Es es sich nicht um eine EE Container-gemanagte Komponente wie ein EJB, ein Servlet oder eine JPA-Entity handelt,
it_it: Non è un componente gestito da un container EE, come EJB, un Servlet o un entity JPA,
ja_jp: EJB やサーブレット、JPA エンティティのように EE コンテナで管理されたコンポーネントではないもの

source: it is not a non-static static inner class,
de_de: es sich nicht um eine nicht-statische statische innere Klasse handelt,
it_it: non è una classe interna statica/non statica,
ja_jp: 静的でないインナークラスではないもの

source: it is not a parameterized type, and
de_de: es sich nicht um einen parametisierten Typ handelt und
it_it: non è un tipo parametrizzato, e
ja_jp: パラメータ化されたタイプではないもの
