Repository: 1tchy/core
Catalog: reference/*/intro.po
Languages: de_de, it_it, ja_jp

source: it has a constructor with no parameters, or a constructor annotated <literal>@Initializer</literal>.
de_de: ein Konstruktor ohne Parameter oder ein mit <literal>@Initializer</literal> annotierter Konstruktor vorhanden ist.
it_it: ha un costruttore senza parametro, o un costruttore annotato con <literal>@Initializer</literal>.
ja_jp: パラメータなしのコンストラクタを持つか、あるいは <literal>@Initializer</literal> アノテーションが付与されたコンストラクタを持つもの

source: Thus, almost every JavaBean is a simple Web Bean.
de_de: Daher handelt es sich bei fast jedem JavaBean um ein einfaches Web Bean.
it_it: Quindi quasi ogni JavaBean è un Web Bean semplice.
ja_jp: これにより、ほとんどすべての JavaBean は単純な Web Bean です。

source: Every interface implemented directly or indirectly by a simple Web Bean is an API type of the simple Web Bean. The class and its superclasses are also API types.
de_de: Jedes direkt oder indirekt durch ein einfaches Web Bean implementierte Interface ist ein API-Typ des einfachen Web Beans. Die Klasse und deren Superklassen sind ebenfalls API-Typen.
it_it: Ogni interfaccia implementata direttamente o indirettamente da un Web Bean semplice è un tipo di API di un Web Bean semplice. La classe e le sue superclassi sono anch'essere tipi di API.
ja_jp: 単純な Web Bean によって直接的にまたは間接的にに実装されるすべてのインタフェースは、単純な Web Bean の API タイプです。クラスとそのクラスのスーパークラスもまた API タイプです。

source: Enterprise Web Beans
it_it: Web Bean Enterprise
ja_jp: エンタープライズ Web Beans

source: The specification says that all EJB 3-style session and singleton beans are <emphasis>enterprise</emphasis> Web Beans. Message driven beans are not Web Beans &#151; since they are not intended to be injected into other objects &#151; but they can take advantage of most of the functionality of Web Beans, including dependency injection and interceptors.
de_de: Die Spezifikation besagt, dass alle EJB 3-style Session und Singleton Beans <emphasis>Enterprise</emphasis> Web Beans sind. Message-driven Beans sind keine Web Beans &#151; da sie nicht zur Einspeisung in andere Objekte vorgesehen sind &#151; aber sie können den größten Teil der Funktionalität von Web Beans nutzen, darunter auch "Dependency"-Einspeisung und Interzeptoren.
it_it: La specifica dice che tutti i bean di sessione stile EJB3 e quelli singleton sono Web Bean <emphasis>enterprise</emphasis>. I bean message driven non sono Web Bean &#151; poiché non sono intesi per essere iniettati in altri oggetti &#151; ma possono sfruttare la maggior parte della funzionalità dei Web Bean, inclusi dependency injection e interceptor.
ja_jp: 仕様によれば、すべての EJB 3 スタイルのセッション Bean とシングルトン Bean は <emphasis>エンタープライズ</emphasis> Web Beans です。メッセージ駆動 Bean は Web Beans ではないのでしょうか。&#151;それらは他のオブジェクトへ注入されることを意図していないのですが&#151; 依存性注入とインタセプタを含む Web Beans のほとんどの機能を利用することができます。

source: Every local interface of an enterprise Web Bean that does not have a wildcard type parameter or type variable, and every one of its superinterfaces, is an API type of the enterprise Web Bean. If the EJB bean has a bean class local view, the bean class, and every one of its superclasses, is also an API type.
de_de: Jedes lokale Interface eines Enterprise Web Beans und jedes seiner Super-Interfaces, das keinen Platzhaltertyp-Parameter oder eine Typenvariable besitzt, ist ein API-Typ des Enterprise Web Beans. Falls das EJB-Bean eine lokale Ansicht der Bean-Klasse besitzt, so handelt es sich auch bei der Bean-Klasse und jede von deren Super-Klassen um einen API-Typ.
it_it: Ogni interfaccia locale di un Web Bean enterprise che non ha un parametro tipo wildcard o variabile tipo, e ciascuna delle sue superinterfacce, è un tipo di API del Web Bean enterprise. Se il bean EJB ha una vista locale di classe bean, la classe bean e ogni sua superclasse è anch'essa un tipo di API.
ja_jp: ワイルドカードタイプのパラメータまたはタイプ変数を持たないエンタープライズ Web Bean の ローカルインタフェースと、そのスーパーインタフェースのすべてが、エンタープライズ Web Bean のAPI タイプです。もし EJB Bean が ローカルビューの Bean クラスを持っていれば、Beanクラスとそのすべてのスーパークラスも APIタイプです。

source: Stateful session beans should declare a remove method with no parameters or a remove method annotated <literal>@Destructor</literal>. The Web Bean manager calls this method to destroy the stateful session bean instance at the end of its lifecycle. This method is called the <emphasis>destructor</emphasis> method of the enterprise Web Bean.
de_de: Stateful Session Beans sollten eine Entfernungsmethode ("remove method") ohne Parameter oder eine Entfernungsmethode mit der Annotation <literal>@Destructor</literal> deklarieren. Der Web Bean Manager ruft diese Methode auf, um die Instanz des stateful Session Beans am Ende von deren Lebenszyklus zu löschen. Diese Methode nennt sich <emphasis>Destructor</emphasis>-Methode des Enterprise Web Beans.
it_it: I session bean stateful dovrebbero dichiarare un metodo remoto senza parametri od un metodo annotato con <literal>@Destructor</literal>. Il manager Web Bean chiama questo metodo per distruggere l'istanza del session bean statefull alla fine del suo ciclo di vita. Questo metodo è chiamato metodo <emphasis>distruttore</emphasis> del Web Bean enterprise.
ja_jp: ステートフルなセッション beans は、パラメータのない remove メソッドまたは <literal>@Destructor</literal> アノテーションを付与された remove メソッドを宣言すべきです。Web Bean マネージャは、そのライフサイクルの終わりでステートフルセッション Bean のインスタンスを破棄するために、このメソッドを呼び出します。このメソッドは、エンタープライズ Web Bean の <emphasis>destructor</emphasis> メソッドと呼ばれます。

source: So when should we use an enterprise Web Bean instead of a simple Web Bean? Well, whenever we need the advanced enterprise services offered by EJB, such as:
de_de: Sollten wir also ein Enterprise Web Bean statt eines einfachen Web Beans verwenden? Nun, wenn wir ausgefeilte, durch EJB bereitgestellte Enterprise-Dienste benötigen, wie etwa:
it_it: Ma allora quando occorre usare un Web Bean enterprise invece di un Web Bean semplice? Quando occorrono servizi enterprise avanzati offerti da EJB, quali:
ja_jp: それでは、いつ単純な Web Bean でなくエンタープライズ Web Bean を使用すべきでしょうか。EJB によって提供される高度なエンタープライズサービスを必要とする場合に使用します。例えば:

source: method-level transaction management and security,
de_de: Transaktionsmanagement und Sicherheit auf Methodenebene,
it_it: gestione delle transazioni a livello di metodo e sicurezza,
ja_jp: メソッドレベルのトランザクション管理とセキュリティ

source: concurrency management,
de_de: Nebenläufigkeits-Management,
it_it: gestione della concorrenza,
ja_jp: 並行性管理

source: instance-level passivation for stateful session beans and instance-pooling for stateless session beans,
de_de: Passivation für stateful Session Beans und Instance-Pooling für stateless Session Beans auf Instanzebene
it_it: passivazione a livello di istanza per session bean stateful e pooling di istanze per session bean stateless,
ja_jp: ステートフルセッション Bean のためのインスタンスレベルの非活性化とステートレスセッション Bean のためのインスタンスプーリング

source: remote and web service invocation, and
de_de: Remote und Web-Service Aufruf und
it_it: invocazione remota e web service, e
ja_jp: リモートサービスと Web サービスの呼び出し

source: timers and asynchronous methods,
de_de: Timer und asynchrone Methoden,
it_it: timer e metodi asincroni,
ja_jp: タイマーと非同期メソッド

source: we should use an enterprise Web Bean. When we don't need any of these things, a simple Web Bean will serve just fine.
de_de: so sollten wir ein Enterprise Web Bean verwenden. Wenn wir nichts von alledem brauchen, so reicht ein einfaches Web Bean vollkommen aus.
it_it: si dovrebbe usare un Web Bean enterprise. Quando non occorrono queste cose, va bene utilizzare un Web Bean semplice.
ja_jp: エンタープライズ Web Bean を使用すべきです。これらのエンタープライズサービスのいずれもが必要ではないときには、単純な Web Bean がちょうど見事に役立つでしょう。

source: Many Web Beans (including any session or application scoped Web Bean) are available for concurrent access. Therefore, the concurrency management provided by EJB 3.1 is especially useful. Most session and application scoped Web Beans should be EJBs.
de_de: Viele Web Beans (einschließlich session- oder anwendungsbegrenzte Web Beans) sind für nebenläufigen Zugriff verfügbar. Daher ist das durch EJB 3.1 bereitgestellte Nebenläufigkeits-Management besonders nützlich. Die meisten session- oder anwendungsbegrenzten Web Beans sollten EJBs sein.
it_it: Molti Web Bean (inclusi Web Bean con scope di sessione o applicazione) sono disponibili per accessi concorrenti. Quindi la gestione della concorrenza fornita da EJB3.1 è molto utile. La maggior parte dei Web Bean con scope sessione e applicazione dovrebbero essere EJB.
ja_jp: 多くの Web Beans(どんなセッションスコープあるいはアプリケーションスコープのWeb Beanも含む)は、並行アクセスが可能です。それゆえに、EJB 3.1 によって提供された並行性管理は特に役に立ちます。ほとんどのセッションスコープとアプリケーションスコープの Web Beans は EJB であるべきです。

source: Web Beans which hold references to heavy-weight resources, or hold a lot of internal state benefit from the advanced container-managed lifecycle defined by the EJB <literal>@Stateless</literal>/<literal>@Stateful</literal>/<literal>@Singleton</literal> model, with its support for passivation and instance pooling.
de_de: Web Beans, die Verweise auf schwergewichtige Ressourcen oder eine Menge internen Status besitzen, haben Vorteile durch den fortgeschrittenen, Container-gemanagten, durch das EJB <literal>@Stateless</literal>/<literal>@Stateful</literal>/<literal>@Singleton</literal>-Modell definierten Lebenszyklus und dessen Support von Passivation und Instanz-Pooling.
it_it: Web Bean che mantengono riferimenti alle risorse pesanti o mantengono molti benefici dello stato interno dal ciclo di vita avanzato, gestito dal container, definito dal modello EJB <literal>@Stateless</literal>/<literal>@Stateful</literal>/<literal>@Singleton</literal>", con supporto alla passivazione e pooling delle istanze.
ja_jp: ヘビー級のリソースへの参照を保持あるいは多くの内部状態を保持する Web Beans は、EJB <literal>@Stateless</literal>/<literal>@Stateful</literal>/<literal>@Singleton</literal> モデル によって定義された高度なコンテナで管理されたライフサイクルから恩恵を受け、非活性化とインスタンスプーリングに対するサポートも利用できます。

source: Finally, it's usually obvious when method-level transaction management, method-level security, timers, remote methods or asynchronous methods are needed.
de_de: Schließlich ist es offenkundig, wenn Transaktions-Management auf Methodenebene, Sicherheit auf Methodenebene, Timer, Remote-Methoden oder asynchrone Methoden benötigt werden.
it_it: Infine è ovvio quando occorre usare la gestione delle transazioni a livello di metodo, la sicurezza a livello di metoto, i timer, i metodi remoti o i metodi asincroni.
ja_jp: 最後に、メソッドレベルのトランザクション管理、メソッドレベルのセキュリティ、タイマー、リモートメソッドあるいは非同期メソッドが必要とされる場合はたいてい明らかです。

source: It's usually easy to start with simple Web Bean, and then turn it into an EJB, just by adding an annotation: <literal>@Stateless</literal>, <literal>@Stateful</literal> or <literal>@Singleton</literal>.
de_de: Es ist in der Regel leicht, mit einem einfachen Web Bean zu beginnen und es dann zu einem EJB zu machen, indem man eine Annotation: <literal>@Stateless</literal>, <literal>@Stateful</literal> oder <literal>@Singleton</literal> hinzufügt.
it_it: E' facile iniziare con un Web Bean semplice e poi volgere a EJB semplicemente aggiungendo l'annotazione: <literal>@Stateless</literal>, <literal>@Stateful</literal> o <literal>@Singleton</literal>.
ja_jp: 通常は単純な Web Bean で始めるのが簡単です。それから、単に <literal>@Stateless</literal> や <literal>@Stateful</literal>、<literal>@Singleton</literal> アノテーションを付け加えることによって、それらをEJBに変えてください。

source: Producer methods
de_de: Producer-Methoden
it_it: Metodi produttori
ja_jp: プロデューサ (producer) メソッド

source: A <emphasis>producer method</emphasis> is a method that is called by the Web Bean manager to obtain an instance of the Web Bean when no instance exists in the current context. A producer method lets the application take full control of the instantiation process, instead of leaving instantiation to the Web Bean manager. For example:
de_de: Eine <emphasis>Producer-Methode</emphasis> ist eine Methode, die vom Web Bean Manager aufgerufen wird, um eine Instanz des Web Beans zu erhalten, wenn im aktuellen Kontext keine existiert. Eine Producer-Methodübernehmen, statt die Instantiierung dem Web Bean Manager zu überlassen. Zum Beispiel:
it_it: Un <emphasis>metodo produttore</emphasis> è un metodo che viene chiamato dal manager Web Bean per ottenere un'istanza di un Web Bean quando non esiste alcuna istanza nel contesto corrente. Un metodo produttore lascia all'applicazione il pieno controllo del processo di istanziamento, invece di lasciare l'istanziamento al manager Web Bean. Per esempio:
ja_jp: <emphasis>プロデューサメソッド</emphasis> は、現在のコンテキストにインスタンスが存在しないときに、Web Bean のインスタンスを得るために Web Bean マネージャ によって呼ばれるメソッドです。プロデューサメソッドは、インスタンス化を Web Bean マネージャに委ねるのではなく、アプリケーションにインスタンス化プロセスの完全な管理をさせます。例えば:

source: The result of a producer method is injected just like any other Web Bean.
de_de: Einspeisung des Ergebnisses einer Producer-Methode erfolgt wie bei einem regulären Web Bean.
it_it: Il risultato del metodo produttore è iniettato come qualsiasi altro Web Bean.
ja_jp: プロデューサメソッドの結果は、ちょうど他のWeb Beanのように注入されます。

source: The method return type and all interfaces it extends/implements directly or indirectly are API types of the producer method. If the return type is a class, all superclasses are also API types.
de_de: Der Methodenwiedergabetyp ("Method Return Type") und alle Interfaces, die er direkt oder indirekt erweitert/implementiert sind API-Typen der Producer-Methode. Handelt es sich beim Wiedergabetyp um eine Klasse, so sind alle Superklassen ebenfalls API-Typen.
it_it: Il tipo di ritorno del metodo e tutte le interfacce che estende/implementa direttamente o indirettamente sono tipi di API del metodo produttore. Se il tipo di ritorno è una classe, tutte le superclassi sono anch'esse tipi di API.
ja_jp: メソッドの戻りタイプとそれが直接的にあるいは間接的に拡張する/実装するすべてのインタフェースはプロデューサメソッドの API タイプです。もし戻りのタイプがクラスならは、すべてのスーパークラスもAPI タイプです。

source: Some producer methods return objects that require explicit destruction:
de_de: Einige Producer-Methoden geben Objekte wieder, die explizite Löschung erfordern:
it_it: Alcuni metodi produttori restituiscono oggetti che richiedono una distruzione esplicita:
ja_jp: プロデューサメソッドは、明示的な破棄を必要とするオブジェクトを返すものもあります:

source: These producer methods may define matching <emphasis>disposal methods</emphasis>:
de_de: Diese Producer-Methoden können übereinstimmende <emphasis>Disposal Methods</emphasis> (Entsorgungsmethoden) definieren:
it_it: Questi metodi produttori possono definire corrispondenti <emphasis>metodi distruttori</emphasis>:"
ja_jp: これらのプロデューサメソッドは、適合する <emphasis> ディスポーザルメソッド</emphasis> を定義するかもしれません:

source: This disposal method is called automatically by the Web Bean manager at the end of the request.
de_de: Diese Entsorgungsmethode wird am Ende der Anfrage automatisch vom Web Bean Manager aufgerufen.
it_it: Il metodo distruttore è chiamato direttamente dal manager Web Bean alla fine della richiesta.
ja_jp: このディスポーザルメソッドは、リクエストの終わりに Web Bean マネージャ によって自動的に呼び出されます。

source: We'll talk much more about producer methods in <xref linkend="producermethods"/>.
de_de: In <xref linkend="producermethods"/> erfahren Sie mehr über Producer-Methoden.
it_it: Si parlerà in maggior dettaglio dei metodi produttori in <xref linkend="producermethods"/>.
ja_jp: プロデューサメソッドについての詳細は <xref linkend="producermethods"/> で説明します。

source: JMS endpoints
de_de: JMS-Endpunkte
it_it: Endpoint JMS
ja_jp: JMS エンドポイント

source: Finally, a JMS queue or topic can be a Web Bean. Web Beans relieves the developer from the tedium of managing the lifecycles of all the various JMS objects required to send messages to queues and topics. We'll discuss JMS endpoints in <xref linkend="jms"/>.
de_de: Auch eine JMS-Warteschlange oder ein Topic können Web Beans sein. Web Beans nimmt dem Entwickler die Arbeit des Management der Lebenszyklen aller verschiedener JMS-Objekte ab, die zum Senden von Nachrichten an Warteschlangen und Topics erforderlich sind. Wir gehen in <xref linkend="jms"/> auf JMS-Endpunkte ein.
it_it: Infine una coda od un topic JMS possono essere Web Bean. Web Beans solleva lo sviluppatore dalla noia della gestione dei cicli di vita di tutti i vari oggetti JMS richiesto per inviare messaggi a code o topic. Si discuteranno gli endpoint JMS in <xref linkend="jms"/>.
ja_jp: 最後に、JMS キューまたはトピックは、Web Bean になることができます。Web Beans は、キューとトピックにメッセージを送るために必要となる、すべての様々な JMS オブジェクトのライフサイクルを管理する退屈から開発者を開放します。JMS エンドポイントは <xref linkend="jms"/> で説明します。
