Repository: 1tchy/core
Catalog: reference/*/intro.po
Languages: de_de, it_it, ja_jp

source: Getting started with Web Beans
de_de: Erste Schritte mit Web Beans
it_it: Iniziare con Web Beans
ja_jp: Web Beans を始めよう

source: So you're already keen to get started writing your first Web Bean? Or perhaps you're skeptical, wondering what kinds of hoops the Web Beans specification will make you jump through! The good news is that you've probably already written and used hundreds, perhaps thousands of Web Beans. You might not even remember the first Web Bean you wrote.
de_de: Können Sie es jetzt kaum erwarten Ihr erstes Web Bean zu schreiben? Oder sind Sie etwas skeptisch und fragen sich, welche Hürden Ihnen bei der Web Beans Spezifikation bevorstehen? Die gute Nachricht ist, dass Sie wahrscheinlich schon hunderte, wenn nicht tausende von Web Beans geschrieben haben. Vielleicht erinnern Sie sich nicht einmal an das erste Web Bean, das Sie je geschrieben haben.
it_it: Non vedi l'ora di iniziare a scrivere il primo Web Beans? O forse sei un pò scettico e ti domandi quali virtuosismi ti farà fare la specifica Web Beans! La buona notizia è che probabilmente hai già scritto e usato centinaia, forse migliaia di Web Beans. Potresti addirittura non ricordare il primo Web Bean scritto.
ja_jp: あなたは、すでに最初の Web Bean を書き始めることに夢中ですか。あるいは、たぶん Web Beans 仕様によって、どのような種類のフープを跳ぶことができるのかを不思議に思って疑い深くなっているのかもしれません。朗報なことは、すでにあなたはおそらく数百、もしかすると数千の Web Beans を書いて使用しているかもしれないということです。あなたは最初の書いた Web Bean を思い出すことさえできないかもしれません。

source: Your first Web Bean
de_de: Ihr erstes Web Bean
it_it: Il primo Web Bean
ja_jp: 初めての Web Bean

source: With certain, very special exceptions, every Java class with a constructor that accepts no parameters is a Web Bean. That includes every JavaBean. Furthermore, every EJB 3-style session bean is a Web Bean. Sure, the JavaBeans and EJBs you've been writing every day have not been able to take advantage of the new services defined by the Web Beans specification, but you'll be able to use every one of them as Web Beans &#151; injecting them into other Web Beans, configuring them via the Web Beans XML configuration facility, even adding interceptors and decorators to them &#151; without touching your existing code.
de_de: Mit bestimmten, ganz besonderen Ausnahmen ist jede Java-Klasse mit einem Konstruktor, die keine Parameter akzeptiert ein Web Bean. Das beinhaltet jedes JavaBean. Desweiteren ist jedes EJB 3-artige Session Bean ein Web Bean. Sicher, die von Ihnen täglich geschriebenen JavaBeans und EJBs konnten die neuen, in der Web Beans Spezifikation definierten Dienste nicht nutzen, aber Sie werden diese allesamt benutzen können können, das Web Beans &#151; diese in andere Web Beans einspeisen, diese via der Web Beans XML-Konfigurationseinrichtung konfigurieren und diesen sogar Interzeptoren und Dekoratoren hinzufügen, ohne den bestehenden Code anzurühren.
it_it: Con alcune eccezioni molto particolari, ogni classe Java con un costruttore che non accetta parametri è un Web Bean. Questo include ogni JavaBean. Inoltre, ogni session bean di stile EJB3 è un Web Bean. Sicuramente i JavaBean e gli EJB3 che si sono sempre scritti non erano in grado di sfruttare i nuovi servizi definiti dalla specifica Web Beans, ma si sarà presto in grado di usare ciascuno di essi come Web Bean &#151; iniettandoli in altri Web Beans, configurandoli tramite strumenti di configurazione XML Web Bean, e perfino aggiungendo a loro interceptor e decoratori &#151; senza toccare il codice esistente.
ja_jp: ある特定のとても特別な例外を除いて、パラメータなしのコンストラクタを持つすべての Java クラスは、Web Bean です。それはすべての JavaBean を含みます。さらに、すべての EJB 3 仕様のセッション Bean も、Web Bean です。確かに、毎日書いている JavaBean と EJB は、Web Beans 仕様によって定義された新しいサービスを利用することができていません。しかし、それらすべての各々は、&#151; Web Beans の XML 構成機能によって構成し、そしてそれらにインタセプタとデコレータを加えることによって &#151;、現存するコードに触れることなく、Web Beans として使用することができるでしょう。

source: Suppose that we have two existing Java classes, that we've been using for years in various applications. The first class parses a string into a list of sentences:
de_de: Nehmen wir an, Sie besitzen zwei bestehende Java Klassen, die bis dato in verschiedenen Anwendungen verwendet wurden. Die erste Klasse parst einen String in eine Liste von Sätzen:
it_it: Si supponga di avere due classi Java esistenti, usate da anni in varie applicazioni. La prima classe esegue il parsing di una stringa in una lista di frasi:
ja_jp: 様々なアプリケーションで何年間も使っている２つの既存の Java クラスがあると仮定します。１つ目のクラスは、文のリストへ文字列に構文解析します:

source: The second existing class is a stateless session bean front-end for an external system that is able to translate sentences from one language to another:
de_de: Bei der zweiten bestehenden Klasse handelt es sich um das Front-End eines "stateless Session Beans" für ein externes System, das in der Lage ist Sätze von einer Sprache in eine andere zu übersetzen:
it_it: La seconda classe è un session bean stateless front-end per un sistema esterno capace di tradurre le frasi da una lingua ad un altra:
ja_jp: ２つ目の現存するクラスは、１つの言語からもう１つの言語への文を翻訳することができる外部システムのフロントエンドとなるステートレスセッション Bean です:

source: Where <literal>Translator</literal> is the local interface:
de_de: Wo <literal>Translator</literal> das lokale Interface ist:
it_it: Dove <literal>Translator</literal> è l'interfaccia locale:
ja_jp: ここで <literal>Translator</literal> はローカルインターフェースです:

source: Unfortunately, we don't have a preexisting class that translates whole text documents. So let's write a Web Bean that does this job:
de_de: Leider besitzen wir keine bereits bestehende Klasse die ganze Textdokumente übersetzt. Schreiben wir also ein Web Bean, das diesen Job übernimmt:
it_it: Sfortunatamente non ci sono classi preesistenti che traducano l'intero testo dei documenti. Quindi occorre scrivere un Web Bean che faccia questo lavoro:
ja_jp: 運悪く、すべてのテキストドキュメントを翻訳する既存のクラスはありません。そこでこの仕事をする Web Bean を書きましょう:

source: We may obtain an instance of <literal>TextTranslator</literal> by injecting it into a Web Bean, Servlet or EJB:
de_de: Wir erhalten eine Instanz von <literal>TextTranslator</literal> durch dessen Einspeisung in ein Web Bean, Servlet oder EJB:
it_it: Si può ottenere un'istanza di <literal>TextTranslator</literal> iniettandolo in un Web Bean, Servlet o EJB:
ja_jp: Web Bean、サーブレットあるいは EJB へ注入することによって <literal>TextTranslator</literal> のインスタンスを取得することができます:

source: Alternatively, we may obtain an instance by directly calling a method of the Web Bean manager:
de_de: Alternativ erhalten wir eine Instanz durch direkten Aufruf einer Methode des Web Bean Managers:
it_it: In alternativa si può ottenere un'istanza chiamando direttamente un metodo del manager Web Bean:
ja_jp: もう１つの方法として、Web Bean マネージャのメソッドを直接に呼ぶことによってインスタンスを取得することもできます:

source: But wait: <literal>TextTranslator</literal> does not have a constructor with no parameters! Is it still a Web Bean? Well, a class that does not have a constructor with no parameters can still be a Web Bean if it has a constructor annotated <literal>@Initializer</literal>.
de_de: Aber warten Sie: <literal>TextTranslator</literal> besitzt keinen Konstruktor ohne Parameter! Handelt es sich noch um ein Web Bean? Nun, eine Klasse, die keinen Konstruktor ohne Parameter besitzt, kann nach wie vor Web Bean sein, falls es einen mit <literal>@Initializer</literal> annotierten Konstruktor besitzt.
it_it: Ma <literal>TextTranslator</literal> non ha un costruttore con nessun parametro! E' ancora un Web Bean? Una classe che non ha un costruttore senza parametri può essere un Web Bean se il suo costruttore è annotato con <literal>@Initializer</literal>.
ja_jp: しかし待ってください: <literal>TextTranslator</literal> はパラメータなしのコンストラクタがありません。それはまだ Web Bean ですか。まあ、<literal>@Initializer</literal> アノテーションを付けたコンストラクタがあれば、パラメータなしのコンストラクタを持たないクラスもまだ Web Bean であることができます。

source: As you've guessed, the <literal>@Initializer</literal> annotation has something to do with dependency injection! <literal>@Initializer</literal> may be applied to a constructor or method of a Web Bean, and tells the Web Bean manager to call that constructor or method when instantiating the Web Bean. The Web Bean manager will inject other Web Beans to the parameters of the constructor or method.
de_de: Wie Sie wahrscheinlich bereits erraten haben, hat die <literal>@Initializer</literal>-Annotation etwas mit Dependency-Einspeisung zu tun! <literal>@Initializer</literal> kann am Konstruktor oder der Methode eines Web Beans angewendet werden und teilt dem Web Bean Manager mit, diesen Konstruktor oder diese Methode bei Instantiierung des Web Beans aufzurufen. Der Web Bean Manager speist andere Web Beans in die Parameter des Konstruktors oder der Methode ein.
it_it: Come hai indovinato, l'annotazione <literal>@Initializer</literal> ha qualcosa che fare con la dependency injection! <literal>@Initializer</literal> può essere applicato ad un costruttore od un metodo di un Web Bean, e dice al manager Web Bean di chiamare quel costruttore o metodo quando si istanzia il Web Bean. Il manager Web Bean inietterà altri Web Bean nei parametri del costruttore o del metodo.
ja_jp: あなたが推測しているように、 <literal>@Initializer</literal> ノテーションは依存性注入と関係があります。<literal>@Initializer</literal> は、Web Bean のコンストラクタあるいはメソッドに適用することができ、Web Bean をインスタンス化するときに Web Bean マネージャにそのコンストラクタあるいはメソッドを呼ぶ出すように伝えます。Web Beanマネージャは、コンストラクタあるいはメソッドのパラメータに他の Web Beans を注入します。

source: At system initialization time, the Web Bean manager must validate that exactly one Web Bean exists which satisfies each injection point. In our example, if no implementation of <literal>Translator</literal> available &#151; if the <literal>SentenceTranslator</literal> EJB was not deployed &#151; the Web Bean manager would throw an <literal>UnsatisfiedDependencyException</literal>. If more than one implementation of <literal>Translator</literal> was available, the Web Bean manager would throw an <literal>AmbiguousDependencyException</literal>.
de_de: Zum Zeitpunkt der Systeminitialisierung muss der Web Bean Manager validieren, dass genau ein Web Bean existiert, das jedem Einspeisungspunkt gerecht wird. Für unser Beispiel bedeutet das, wenn keine Implementierung von <literal>Translator</literal> verfügbar ist &#151; wenn der <literal>SentenceTranslator</literal> EJB nicht deployt wurde &#151; dass der Web Bean Manager eine <literal>UnsatisfiedDependencyException</literal> melden würde. Wäre mehr als eine Implementierung von <literal>Translator</literal> verfügbar, so würde der Web Bean Manager eine <literal>AmbiguousDependencyException</literal> melden.
it_it: In fase di inizializzazione del sistema, il manager Web Bean deve convalidare che esattamente un solo Web Bean esista e soddisfi ciascun punto di iniezione. Nell'esempio, se nessuna implementazione di <literal>Translator</literal> fosse disponibile &#151; se l'EJB <literal>SentenceTranslator</literal> non venisse deployato &#151; il manager Web Bean lancerebbe una <literal>UnsatisfiedDependencyException</literal>. Se più di un'implementazione di <literal>Translator</literal> fosse disponibile, il manager Web Bean lancerebbe una <literal>AmbiguousDependencyException</literal>.
ja_jp: システムの初期化時に、Web Bean マネージャはそれぞれのインジェクションポイントの条件を満たすまさに１つの Web Bean が存在することを検証しなければなりません。サンプルで、もし利用可能な <literal>Translator</literal> の実装がなければ&#151;、あるいは <literal>SentenceTranslator</literal> EJB がデプロイされていなければ&#151;、Web Bean マネージャーは、<literal>UnsatisfiedDependencyException</literal> をスローします。もし１つ以上の <literal>Translator</literal> の実装が利用可能であれば、Web Beanマネージャは、<literal>AmbiguousDependencyException</literal> をスローします。

source: What is a Web Bean?
de_de: Was ist ein Web Bean?
it_it: Cosa è un Web Bean?
ja_jp: Web Bean とは何か?

source: So what, <emphasis>exactly</emphasis>, is a Web Bean?
de_de: Was also <emphasis>genau</emphasis> ist ein Web Bean?
it_it: Ma cosa è <emphasis>esattamente</emphasis> un Web Bean?
ja_jp: それでは、Web Bean とは、<emphasis> 一体</emphasis> 何か。

source: A Web Bean is an application class that contains business logic. A Web Bean may be called directly from Java code, or it may be invoked via Unified EL. A Web Bean may access transactional resources. Dependencies between Web Beans are managed automatically by the Web Bean manager. Most Web Beans are <emphasis>stateful</emphasis> and <emphasis>contextual</emphasis>. The lifecycle of a Web Bean is always managed by the Web Bean manager.
de_de: Bei einem Web Bean handelt es sich um eine Anwendungsklasse, die Business Logik enthält. Ein Web Bean kann direkt von Java Code oder via Unified EL aufgerufen werden. Ein Web Bean kann auf transaktionale Ressourcen zugreifen. Abhängigkeiten zwischen Web Beans werden automatisch durch den Web Bean Manager verwaltet. Die meisten Web Beans sind <emphasis>stateful</emphasis> und <emphasis>kontextbezogen</emphasis>. Der Lebenszyklus eines Web Beans wird immer durch den Web Bean Manager verwaltet.
it_it: Un Web Bean è una classe di un'applicazione che contiene della logica di business. Può essere chiamato direttamente da codice Java, o può essere invocato via Unified EL. Un Web Bean può accedere a risorse transazionali. Le dipendenze tra Web Beans sono gestite automaticamente dal manager Web Bean. La maggior parte dei Web Beans sono <emphasis>stateful</emphasis> e <emphasis>contestuali</emphasis>. Il ciclo di vita di un Web Bean è sempre gestito da un manager Web Bean.
ja_jp: Web Bean は、ビジネスロジックを含むアプリケーションクラスです。Web Bean は、直接 Java コードから呼び出すこともでき、あるいはユニファイド EL から呼び出すこともできます。Web Bean は、トランザクションのリソースにアクセスすることもできます。Web Beans 間での依存関係は、Web Bean マネージャによって自動的に管理されます。 ほとんどのWeb Beansは <emphasis>ステートフル</emphasis> で <emphasis>コンテキスト依存</emphasis> です。Web Bean のライフサイクルは Web Bean マネージャによっていつも管理されます。

source: Let's back up a second. What does it really mean to be "contextual"? Since Web Beans may be stateful, it matters <emphasis>which</emphasis> bean instance I have. Unlike a stateless component model (for example, stateless session beans) or a singleton component model (such as servlets, or singleton beans), different clients of a Web Bean see the Web Bean in different states. The client-visible state depends upon which instance of the Web Bean the client has a reference to.
de_de: Erinnern wir uns. Was genau bedeutet es, "kontextuell" zu sein? Da Web Beans "stateful" sein können, ist es relevant <emphasis>welche</emphasis> Bean-Instanz ich besitze. Anders als ein Komponentenmodell, das "stateless" ist (etwas "stateless" Session Beans) oder ein Singleton Komponentenmodell (wie Servlets oder Singleton Beans), sehen verschiedene Clients eines Web Beans das Web Bean in unterschiedlichen Stati. Der Client-sichtbare Status ist abhängig davon, auf welche Instanz des Web Beans der Client verweist (eine Referenz besitzt).
it_it: Torniamo indietro un attimo. Cosa significa veramente essere "contestuale"? Poiché Web Beans può essere stateful, è importante <emphasis>quale</emphasis> istanza di bean si ha. Diversamente da un modello a componenti stateless (per esempio, i session bean stateless) o un modello a componenti singleton (come i servlet o i bean singleton) i client di un Web Bean vedono il Web Bean in stati differenti. Lo stato del client visibile dipende dall'istanza del Web Bean alla quale il client ha il riferimento.
ja_jp: 少しの間ゆっくり考えてみましょう。「コンテキスト依存である」ということは、本当に何を意味するのでしょうか。Web Beans はステートフルですので、 <emphasis>どの</emphasis> Bean インスタンスを持っているかが重要です。ステートレスなコンポーネントモデル(例えば、ステートレスセッション bean)あるいはシングルトンコンポーネントモデル(例えばサーブレット、あるいはシングルトン bean)と違って、Web Bean の異なるクライアントは、異なる状態で Web Bean を参照します。クライアントに見える状態は、Web Bean のどちらのインスタンスへのリファレンスをクライアントが持っているかによります。

source: However, like a stateless or singleton model, but <emphasis>unlike</emphasis> stateful session beans, the client does not control the lifecycle of the instance by explicitly creating and destroying it. Instead, the <emphasis>scope</emphasis> of the Web Bean determines:
de_de: Wie beim "stateless" oder "singleton" Modell <emphasis>anders</emphasis> jedoch als bei "stateful" Session Beans, steuert der Client den Lebenszyklus der Instanz nicht durch expliziertes Erstellen und Löschen. Stattdessen bestimmt der <emphasis>Geltungsbereich</emphasis> des Web Beans:
it_it: Comunque, in modo simile ad un modello stateless o singleton, ma <emphasis>non come</emphasis> i session bean stateful, il client non ha il controllo sul ciclo di vita dell'istanza, creandola e distruggendola esplicitamente. Invece, lo <emphasis>scope</emphasis> del Web Bean determina:
ja_jp: しかし、しかしステートフルなセッション bean とは <emphasis>違って</emphasis>、クライアントは、ステートレスあるいはシングルトンモデルと同じように、明示的にインスタンスの生成と破棄を行ってインスタンスのライフサイクルを制御はしません。その代わりに、Web Bean の <emphasis>スコープ</emphasis> は以下で決定されます:

source: the lifecycle of each instance of the Web Bean and
de_de: der Lebenszyklus jeder Instanz des Web Beans und
it_it: il ciclo di vita di ogni istanza del Web Bean e
ja_jp: Web Bean のそれぞれのインスタンスのライフサイクル

source: which clients share a reference to a particular instance of the Web Bean.
de_de: Welche Clients teilen sich eine Referenz zu einer bestimmten Instanz des Web Beans.
it_it: quali client condividono una referenza con una particolare istanza del Web Bean.
ja_jp: Web Bean のある特定のリファレンスをどのクライアントが共用しているか

source: For a given thread in a Web Beans application, there may be an <emphasis>active context</emphasis> associated with the scope of the Web Bean. This context may be unique to the thread (for example, if the Web Bean is request scoped), or it may be shared with certain other threads (for example, if the Web Bean is session scoped) or even all other threads (if it is application scoped).
de_de: Für einen bestimmten Thread in einer Web Beans Anwendung kann ein <emphasis>aktiver Kontext</emphasis> mit dem Geltungsbereich des Web Beans assoziiert sein. Dieser Kontext kann eindeutig für den Thread sein (etwa wenn für die Web Bean Anfrage ein Geltungsbereich gilt) oder aber kann mit anderen Threads (etwa wenn für die Web Bean ein Session-Geltungsbereich gilt) oder gar allen Threads (falls ein Anwendungs-Geltungsbereich gilt) geteilt werden.
it_it: Per un dato thread in un'applicazione Web Beans, ci può essere un <emphasis>contesto attivo</emphasis> associato allo scope del Web Bean. Questo contesto può essere univoco nel thread (per esempio, se il Web Bean è con scope di richesta), o può essere condiviso con alcuni altri thread (per esempio, se il Web Bean è con scope di sessione) od anche tutti gli altri thread (se è scope di applicazione).
ja_jp: Web Beans アプリケーションに与えられたスレッドには、Web Bean のスコープに関連付けられた <emphasis>アクティブコンテキスト</emphasis> があります。このコンテキストは、そのスレッドに固有かもしれません(例えば、Web Bean がリクエストスコープの場合)。あるいは、それはその他のスレッド間で共用されるかもしれません(例えば、Web Bean がセッションスコープの場合)。あるいは、それはすべてのスレッドで共用されるかもしれません(アプリケーションスコープの場合)。

source: Clients (for example, other Web Beans) executing in the same context will see the same instance of the Web Bean. But clients in a different context will see a different instance.
de_de: Clients (etwa andere Web Beans), die in demselben Kontext ausführen sehen dieselbe Instanz des Web Beans. Clients in einem anderen Kontext aber sehen eine andere Instanz.
it_it: I client (per esempio, altri Web Beans) che sono in esecuzione nello stesso contesto vedranno la stessa istanza del Web Bean. Ma i client in un contesto diverso vedranno un istanza diversa.
ja_jp: 同じコンテキストで実行しているクライアント(例えば、他の Web Beans)は、同じインスタンスの Web Bean を参照するでしょう。しかし、異なるコンテキストのクライアントは、異なるインスタンスを参照します。

source: One great advantage of the contextual model is that it allows stateful Web Beans to be treated like services! The client need not concern itself with managing the lifecycle of the Web Bean it is using, <emphasis>nor does it even need to know what that lifecyle is.</emphasis> Web Beans interact by passing messages, and the Web Bean implementations define the lifecycle of their own state. The Web Beans are loosely coupled because:
de_de: Ein großer Vorteil des kontextuellen Modells ist es, dass es uns gestattet, stateful Web Beans wie Dienste zu behandeln! Der Client muss sich keine Gedanken um das Management des Lebenszyklus des verwendeten Web Beans machen und <emphasis>muss nicht einmal wissen was der Lebenszyklus ist.</emphasis> Web Beans interagieren durch Weitergabe von Nachrichten und die Web Bean Implementierungen definieren den Lebenszyklus ihres eigenen Status. Die Web Beans sind lose gepaart, weil:
it_it: Un grande vantaggio del modello contestuale è che consente ai Web Beans stateful di essere trattati come servizi! Il client non deve preoccuparsi di gestire il ciclo di vita del Web Bean che sta utilizzando, <emphasis>e neppure deve sapere quale sia il ciclo di vita.</emphasis> Web Beans interagisce passando i messaggi, e le implementazioni Web Bean definiscono il ciclo di vita del proprio stato. I Web Beans sono debolmente disaccoppiati (loosely coupled) poiché:
ja_jp: コンテキスト依存モデルのすばらしい利点の１つには、ステートフルな Web Beans をサービスのように取り扱うことを可能にすることがあります。クライアントは、使用している Web Bean のライフサイクルの管理に関与する必要はありません。 <emphasis>またさらにライフサイクルが何であるかも知っている必要はありません。</emphasis> Web Beansは、メッセージを送信することによって相互に作用し、 Web Bean の実装が自分自身の状態のライフサイクルを定義します。Web Beans が疎結合なのは以下の理由からです:

source: they interact via well-defined public APIs
de_de: sie interagieren über gut definierte öffentliche APIs
it_it: interagiscono tramite delle API pubblica ben-definita
ja_jp: 明確に定義されたパブリックなAPI経由で相互に作用する

source: their lifecycles are completely decoupled
de_de: ihre Lebenszyklen sind vollständig abgekuppelt
it_it: il loro ciclo di vita è completamente disaccoppiato
ja_jp: ライフサイクルは完全に切り離されている

source: We can replace one Web Bean with a different Web Bean that implements the same API and has a different lifecycle (a different scope) without affecting the other Web Bean implementation. In fact, Web Beans defines a sophisticated facility for overriding Web Bean implementations at deployment time, as we will see in <xref linkend="deploymenttypes"/>.
de_de: Wir können ein Web Bean durch ein anderes Web Bean ersetzen, das dasselbe API und einen anderen Lebenszyklus (einen anderen Geltungsbereich) besitzt, ohne dass die übrige Web Bean Implementierung hiervon betroffen ist. Genau genommen definieren Web Beans eine raffinierte Einrichtung zur Außerkraftsetzung von Web Bean Implementierungen zum Zeitpunkt des Deployment wie wir in <xref linkend="deploymenttypes"/> noch sehen werden.
it_it: Si può sostituire un Web Bean con un diverso Web Bean che implementa la stessa API ed ha un diverso ciclo di vita (un diverso scope) senza alterare l'implementazione dell'altro Web Bean. Infatti Web Beans definisce un meccanismo sofisticato per fare l'override delle implementazioni Web Bean al momento del deploy, come visto in <xref linkend="deploymenttypes"/>.
ja_jp: １つの Web Bean は、その他の Web Bean の実装には影響せずに、同じAPIを実装した異なるライフサイクル(異なるスコープ)を持つ別の Web Bean に置き換えることができます。<xref linkend="deploymenttypes"/> で説明するように、実際 Web Beansは、デプロイメント時に Web Bean の実装をオーバーライドするための洗練された機構を定義します。

source: Note that not all clients of a Web Bean are Web Beans. Other objects such as Servlets or Message-Driven Beans &#151; which are by nature not injectable, contextual objects &#151; may also obtain references to Web Beans by injection.
de_de: Beachten Sie, dass es sich nicht bei allen Clients eines Web Beans um Web Beans handelt. Andere Objekte wie Servlets oder Message-Driven Beans &#151; die ihrem Wesen nach nicht einspeisbar sind, kontextuelle Objekte &#151; können durch Einspeisung ebenfalls Verweise auf ein Web Beans erhalten.
it_it: Si noti che non tutti i client dei un Web Bean sono Web Bean. Altri oggetti come Servlet o Message-Driven Beans &#151; che sono per natura non iniettabili, oggetti contestuali &#151; possono pure ottenere riferimenti a Web Bean tramite iniezione.
ja_jp: すべての Web Bean のクライアントが必ずしも Web Beans ではないことに注意してください。サーブレットまたはメッセージ駆動 Bean といった他のオブジェクト&#151;生まれつき注入可能でなく、コンテキスト依存ではいオブジェクト&#151; が注入によって Web Beans へのリファレンスを取得することもあります。

source: Enough hand-waving. More formally, according to the spec:
de_de: Formeller gilt, gemäß der Spezifikation:
it_it: Più formalmente, secondo la specifica:
ja_jp: より正式には、仕様は次の通りです:
