Repository: 1tchy/core
Catalog: reference/*/part1.po
Languages: de_de, es_es, it_it, ja_jp, pt_br, zh_cn, zh_tw

source: The Web Beans (JSR-299) specification defines a set of services for the Java EE environment that makes applications much easier to develop. Web Beans layers an enhanced lifecycle and interaction model over existing Java component types including JavaBeans and Enterprise Java Beans. As a complement to the traditional Java EE programming model, the Web Beans services provide:
de_de: Die Web Beans (JSR-299) Speziifikation definiert einen Satz von Diensten für die Java EE Umgebung, der die Entwicklung von Anwendungen maßgeblich vereinfacht. Web Beans schichtet ein verbessertes Lebenszyklus- und Interaktionsmodell über bestehende Java-Komponententypen, einschließlich JavaBeans und Enterprise Java Beans. Zur Vervollständigung des traditionellen Java EE Programmiermodells bieten Web Beans Dienste:
es_es: La especificación de Web Beans (JSR-299) define una serie de servicios para el entorno EE de Java que facilitan el desarrollo de aplicaciones. Web Beans entrecruza un ciclo de vida mejorado y un modelo de interacción en tipos de componentes existentes de Java incluyendo los componentes JavaBeans y los Enterprise Java Beans. Como complemento para el modelo tradicional de programación EE de Java, el servicio de Web Beans proporciona servicios:
it_it: La specifica Web Beans (JSR-299) definisce un insieme di servizi per l'ambiente Java EE che rende molto più facile lo sviluppo di applicazioni. Web Beans sovrappone un più ricco modello di interazione e di gestione del ciclo di vita ai tipi di componenti java esistenti, Java Beans and Enterprise Java Beans inclusi. A complemento del tradizionale modello di programmazione Java EE, i servizi Web Beans forniscono:
ja_jp: Web Beans (JSR-299) 仕様は、アプリケーションの開発をより簡単にする Java EE 環境の向けのサービスセットを定義します。Web Beans は、JavaBeans とエンタープライズ Java Beans を含む現存する Java コンポーネントのタイプをまたがった拡張ライフサイクルと相互作用モデルの層を提供します。伝統的な Java EE プログラミングモデルを補足するものとして、Web Beans は以下のサービスを提供します:
pt_br: A especificação Web Beans (JSR-299) define um conjunto de serviços para o ambiente Java EE que torna o desenvolvimento muito simples. Camadas Web Beans
zh_cn: The Web Beans (JSR-299)规范为Java EE环境定义了一套服务以便开发者能够更轻松地开发应用。Web Beans在现有的包括JavaBeans和企业JavaBeans在内的Java组件类型之上增强了生命周期和交互的模型层。作为传统的Java EE编程模型的补充，Web Beans服务提供了：
zh_tw: Web Beans（JSR-299）規格為 Java EE 環境定義了一組簡化應用程式開發的服務。Web Bean 針對於現有的 Java 元件類型（包含 JavaBeans 以及 Enterprise Java Beans）提供了增強的生命週期與互動模型（interaction model）。為了補充傳統的 Java EE 程式撰寫模型（Programming Model），Web Bean 服務提供了：

source: an improved lifecycle for stateful components, bound to well-defined <emphasis>contexts</emphasis>,
de_de: einen verbesserten Lebenszyklus für stateful Komponenten, die an gut definierte <emphasis>Kontexte</emphasis> gebunden sind,
es_es: un ciclo de vida mejorada para componentes con estado, vinculados a los <emphasis>contextos</emphasis> bien definidos,
it_it: una migliore gestione del ciclo di vita dei componenti stateful, associata a <emphasis>contesti</emphasis> ben definiti
ja_jp: 明確な <emphasis>コンテキスト (context)</emphasis> に括り付けられる、ステートフルコンポーネントのための改善されたライフサイクル
pt_br: um ciclo de vida melhorado para componentes stateful, vinculados a <emphasis>contextos</emphasis> bem definidos
zh_cn: 一个为有状态组件而改良的并且绑定到定义明确的 <emphasis>上下文</emphasis>上的生命周期，
zh_tw: 狀態元件上的生命週期改善，並綁定至明確定義的 <emphasis>contexts</emphasis>、

source: a typesafe approach to <emphasis>dependency injection</emphasis>,
de_de: eine typensichere Herangehensweise an <emphasis>Dpendency-Einspeisung</emphasis>,
es_es: un método typesafe para <emphasis>inyección de dependencia</emphasis>,
it_it: un approccio typesafe alla <emphasis>dependency injection</emphasis>,
ja_jp: タイプセーフなアプローチによる <emphasis> 依存性注入 (dependency injection: DI)</emphasis>
pt_br: uma apordagem typesafe para <emphasis>injeção de dependência</emphasis>,
zh_cn: 一个类型安全的<emphasis>依赖注入</emphasis>方法,
zh_tw: 一個用來進行 <emphasis>dependency injection</emphasis>（相依性注入）的 typesafe（類型安全列舉）方式、

source: interaction via an <emphasis>event notification</emphasis> facility, and
de_de: Interaktion über eine <emphasis>Ereignisbenachrichtigungs</emphasis>-Facility und
es_es: interacción a través de un servicio de <emphasis>notificación de eventos</emphasis>, y
it_it: interazioni basate su una struttura per <emphasis>la notifica degli eventi</emphasis>, e
ja_jp: <emphasis>イベント通知 (event notification)</emphasis> による相互作用
pt_br: interação via <emphasis>notificação de eventos (event notification)</emphasis>, e
zh_cn: 通过 <emphasis>事件通知</emphasis> 机制实现的交互，并且
zh_tw: 透過 <emphasis>event notification</emphasis>（事件通知）功能來進行的互動，以及

source: a better approach to binding <emphasis>interceptors</emphasis> to components, along with a new kind of interceptor, called a <emphasis>decorator</emphasis>, that is more appropriate for use in solving business problems.
de_de: eine bessere Vorgehensweise bei der Bindung von <emphasis>Interzeptoren</emphasis> an Komponenten sowie eine neue Art von Interzeptor namens <emphasis>Dekorator</emphasis>, der für die Lösung von Business Problemen geeigneter ist.
es_es: un mejor método para vincular <emphasis>interceptores</emphasis> a componentes, junto con una nueva clase de interceptor, llamado un <emphasis>decorador</emphasis>, el cual es más apropiado para resolver problemas de negocios.
it_it: un migliore approccio nell'associazione degli <emphasis>interceptors</emphasis> ai componenti, unitamente all'introduzione di un nuovo tipo di interceptor, chiamato <emphasis>decoratore</emphasis>, più adatto ad essere utilizzato nella soluzione di problemi legati alla business logic.
ja_jp: コンポーネントへの <emphasis>インタセプタ (interceptor) </emphasis> のバインディングにおけるより良い手法と <emphasis>デコレータ (decorator)</emphasis> と呼ばれる新しい種類のインタセプタの導入、これによりビジネス上の問題を解決する際に使用するのがより適したものになります
pt_br: uma melhor abordagem para associar <emphasis>interceptadores (interceptors)</emphasis> para componentes, juntamente com um novo tipo de interceptador (interceptor), chamado de <emphasis>decorador (decorator)</emphasis>, que é mais adequado para utilização na resolução de problemas de negócio.
zh_cn: 一个更好的将<emphasis>拦截器</emphasis>绑定到组件上的方法，同时提供了一个名为<emphasis>装饰器(decorator)</emphasis>的新型拦截器，这种拦截器更加适合解决业务问题。
zh_tw: 一個將 <emphasis>interceptors</emphasis>（攔截器）綁定至元件的較佳方式，以及一個稱為 <emphasis>decorator</emphasis>（裝飾器）的新型攔截器，它適用於解決商業上的相關問題。

source: Dependency injection, together with contextual lifecycle management, saves the user of an unfamiliar API from having to ask and answer the following questions:
de_de: Dependency-Einspeisung sowie kontextuelles Lebenszyklus-Management erspart dem Benutzer eines unbekannten API das Stellen und die Beantwortung folgender Fragen:
es_es: Inyección de dependencia, junto con la administración de ciclo de vida contextual, ahorra al usuario de un API desconocido el tener que hacer y contestar las siguientes preguntas:
it_it: La dependency injection, insieme alla gestione contestuale del ciclo di vita dei componenti, risparmia a chi utilizza un API con cui non ha familiarità la necessità di dover formulare le risposte relative alle seguenti domande:
ja_jp: コンテキスト依存ライフサイクル管理を利用した依存性注入は、ユーザがよく知らない API を使用する際に以下のような質問をしたりそれに答えたりする手間を省きます:
pt_br: Injeção de dependências (Dependency injection), junto com o gerenciamento de estados contextual (contextual lifecycle management), livra o usuário de uma API desconhecida e ter de perguntar e reponders as seguintes questões:
zh_cn: 依赖注入和具备上下文的生命周期管理节省了开发者出于对接口的不熟悉而不得不处理下列问题所浪费时间：
zh_tw: 相依性注入和 contextual 生命週期管理這兩者組合起來可讓一個不熟悉的 API 的用戶無須過問下列問題：

source: what is the lifecycle of this object?
de_de: was ist der Lebenszyklus dieses Objekts?
es_es: ¿cuál es el ciclo de vida de este objeto?
it_it: qual è il ciclo di vita di questo oggetto?
ja_jp: このオブジェクトのライフサイクルは何ですか?
pt_br: qual o ciclo de vida desse objeto?
zh_cn: 这个对象的生命周期是什么？
zh_tw: 這個物件的生命週期為何？

source: how many simultaneous clients can it have?
de_de: wieviele simultane Clients kann es besitzen?
es_es: ¿cuántos clientes simultáneos puede tener?
it_it: quanti client può simultaneamente avere?
ja_jp: 同時にいくつのクライアントがアクセスできますか?
pt_br: quantos clientes simultâneos eu posso ter?
zh_cn: 它能够有多少个并发的客户端
zh_tw: 它一次能同時有幾個客戶端？

source: is it multithreaded?
de_de: ist es multithreaded?
es_es: ¿es multihilos?
it_it: è multithreaded?
ja_jp: マルチスレッド対応ですか?
pt_br: é multithreaded?
zh_cn: 它是多线程的么？
zh_tw: 它是否為多執行緒（multithread）？

source: where can I get one from?
de_de: wo kann ich eines bekommen?
es_es: ¿en dónde puedo obtener uno?
it_it: da dove posso ottenerne uno?
ja_jp: どこから取得することができますか?
pt_br: onde posso obter um de?
zh_cn: 我能从哪里得到一个对象？
zh_tw: 我能從哪裡取得呢？

source: do I need to explicitly destroy it?
de_de: muss ich es explizit löschen?
es_es: ¿necesito destruirlo explícitamente?
it_it: devo distruggerlo esplicitamente?
ja_jp: 明示的に破棄する必要がありますか?
pt_br: eu preciso explicitamente destruí-lo?
zh_cn: 我需要显式地销毁它么？
zh_tw: 我是否需要明確地將它毀掉呢？

source: where should I keep my reference to it when I'm not using it directly?
de_de: wo sollte ich meinen Verweis darauf aufbewahren, wenn ich es nicht direkt verwende?
es_es: ¿dónde debo mantener mi referencia a éste cuando no lo estoy usando directamente?
it_it: dove dovrei tenerne il riferimento quando non lo sto usando direttamente?
ja_jp: 直接的に使用していないときに、それへのリファレンスはどこに保持すべきですか?
pt_br: onde devo manter minha referência quando não estou usando-o diretamente?
zh_cn: 当我不再直接使用它的时候，我需要将它的引用保存到哪里？
zh_tw: 當我沒有在直接使用它時，我應該將它的參照保留在哪裡呢？

source: how can I add an indirection layer, so that the implementation of this object can vary at deployment time?
de_de: wie kann ich ein Indirection-Layer hinzufügen, damit die Implementierung dieses Objekts zum Zeitpunkt des Deployment variieren kann?
es_es: ¿cómo puedo agregar una capa de direccionamiento indirecto, para que la implementación de este objeto pueda variar en el momento de despliegue?
it_it: come posso aggiungere un livello di indirezione, in modo che l'implementazione di tale oggetto possa variare a deployment time?
ja_jp: このオブジェクトのインプリメンテーションをデプロイ時に変えることができるようにするために、間接的なレイヤをどのように追加することができますか?
pt_br: como posso adicionar uma camada de indireção (indirection layer), de modo que a implementação desse objeto possa variar em tempo de publicação (deployment time)?
zh_cn: 我如何才能添加一个间接层，以便在部署的时候可以更换这个对象的不同实现？
zh_tw: 我該如何新增一個 indirection layer 來使這個物件在建置時的實做可呈多樣化？

source: how should I go about sharing this object between other objects?
de_de: wie kann ich dieses Objekt mit anderen Objekten teilen?
es_es: ¿cómo hago para compartir este objeto con otros objetos?
it_it: cosa dovrei fare per condividere questo oggetto con altri oggetti?
ja_jp: どのようにこのオブジェクトを他のオブジェクトとの間で共有すべきですか?
pt_br: como compartilhar esse objeto entre outros objetos?
zh_cn: 我应该如何在其他对象中共享这个对象？
zh_tw: 我該如何在其它物件之間共享這個物件？

source: A Web Bean specifies only the type and semantics of other Web Beans it depends upon. It need not be aware of the actual lifecycle, concrete implementation, threading model or other clients of any Web Bean it depends upon. Even better, the concrete implementation, lifecycle and threading model of a Web Bean it depends upon may vary according to the deployment scenario, without affecting any client.
de_de: Ein Web Bean legt nur Typ und Semantik anderer Web Beans fest, von denen es abhängt. Es benötigt keine Informationen zum tatsächlichen Lebenszyklus, konkreter Implementierung, dem Threading-Modell oder anderen Clients eines Web Beans von dem es abhängt. Besser noch - die konkrete Implementierung, der Lebenszyklus und das Threading-Modell eines Web Beans von dem es abhängt können je nach Deployment-Szenario variieren, ohne dass dies Auswirkungen auf irgendeinen Client hätte.
es_es: Un Web Bean especifica únicamente el tipo y la semántica de otros Web Beans de los que depende. No se necesita estar consciente del ciclo de vida real, la implementación concreta, el modelo de hilos u otros clientes de cualquier Web Bean a la que dependa. Mejor aún, la implementación concreta, el ciclo de vida y el modelo de hilos de un Web Bean al que éste depende pueden variar según el escenario de despliegue, sin afectar a ningún cliente.
it_it: Un Web Bean specifica soltanto il tipo e la semantica degli altri Web Beans da cui dipende. Non ha bisogno di essere a conoscenza del reale ciclo di vita, della implementazione, del modello di threading o degli altri client dei Web Bean da cui dipende. Ancor meglio, l'implementazione, il ciclo di vita e il modello di threading di un Web Bean da cui dipende possono variare a seconda dello scenario di deployment, senza avere effetti su nessun client.
ja_jp: Web Bean は、それが依存する他の Web Bean のタイプとセマンティックスだけを指定します。依存する Web Bean の実際のライフサイクル、具体的なインプリメンテーション、スレッディングモデルあるいはその他のクライアントについては知っている必要はありません。さらに優れたことに、依存する Web Bean の実際のライフサイクル、具体的なインプリメンテーション、スレッディングモデルは、いかなる他のクライアントにも影響せずに、デプロイメントシナリオによって入れ替えることができます。
pt_br: Um Web Bean apenas especifica o tipo e a semântica de outros Web Beans que ele depende. Ele não precisa estar consciente do próprio ciclo de vida, implementação concreta, modelo de threading ou outros clientes de qualquer Web Bean que ele dependa. Ainda melhor, a implementação concreta, ciclo de vida e o modelo de threading do Web Bean que ele depende pode variar de acordo com o cenário de deployment, sem afetar qualquer cliente.
zh_cn: 一个Web Bean仅仅需要指定它所依赖的其他Web Bean的类型和语义。它不需要知道他所依赖的任何Web Bean的实际生命周期，具体的实现，线程模型或者这个Web Bean的其他客户端。更棒的是，它所依赖的Web Bean的具体实现和生命周期，线程模型可以根据部署场景而更改，却丝毫不影响任何客户端。
zh_tw: Web Bean 只會指定它所依賴的 Web Bean 的類型和語意。它無須知道實際的生命週期、具體的實做、執行緒模型，或是任何它所依賴的 Web Bean 的其它客戶端。更好的是，它所依賴的 Web Bean 的具體實做、生命週期和執行緒模型可根據建置的情況來改變，並且不影響到任何的客戶端。

source: Events, interceptors and decorators enhance the <emphasis>loose-coupling</emphasis> that is inherent in this model:
de_de: Ereignisse, Interzeptoren und Dekoratoren verbessern die <emphasis>lose Paarung</emphasis>, die diesem Modell innewohnt:
es_es: Los eventos, los interceptores y los decoradores mejoran el <emphasis>acoplamiento-flexible</emphasis>inherente en este modelo:
it_it: Eventi, interceptor e decoratori potenziano l'<emphasis>accoppiamento debole</emphasis> (loose-coupling) inerente a questo modello:
ja_jp: イベントとインタセプタ、デコレータは、このモデルの生まれながらの性質である <emphasis>疎結合 (loose-coupling)</emphasis> を強化します:
pt_br: Eventos, interceptadores e decoradores XXX o <emphasis>fraco acoplamento</emphasis> que é XXX nesse modelo:
zh_cn: 事件，拦截器和装饰器增强了这个模型固有的<emphasis>松耦合</emphasis>特性：
zh_tw: 事件、攔截器以及裝飾器可增強在此模型中所繼承的 <emphasis>loose-coupling</emphasis>（鬆散結合性）：

source: <emphasis>event notifications</emphasis> decouple event producers from event consumers,
de_de: <emphasis>Ereignisbenachrictigungen</emphasis> entkoppeln Ereignis-Producer von Ereignis-Consumern,
es_es: La <emphasis>notificación de eventos</emphasis> separa a los productores de eventos de los consumidores,
it_it: le <emphasis>notifiche degli eventi</emphasis> disaccoppiano i produttori di eventi dai consumatori,
ja_jp: <emphasis>イベント通知 (event notification)</emphasis> は イベント消費者 (producer プロデューサ) からイベント生産者 (consumer コンシューマ) を切り離します
pt_br: <emphasis>notificadores de eventos</emphasis> desacoplam os produtores de eventos dos consumidores dos eventos,
zh_cn: <emphasis>事件通知</emphasis>将事件的消费者和事件的产生者解耦，
zh_tw: <emphasis>event notifications</emphasis>（事件通知）會 decouple producer 和 event consumer（事件用戶），

source: <emphasis>interceptors</emphasis> decouple technical concerns from business logic, and
de_de: <emphasis>Interzeptoren</emphasis> entkoppeln technische Probleme von Business-Logik und
es_es: los <emphasis>interceptores</emphasis> separan las cuestiones técnicas de la lógica de negocios, y
it_it: gli <emphasis>interceptor</emphasis> disaccoppiano i problemi tecnici dalla business logic, e
ja_jp: <emphasis>インタセプタ (interceptor)</emphasis> ビジネスロジックから技術的な関心事を切り離します
pt_br: <emphasis>interceptadores (interceptors)</emphasis> desacoplam (decouple) preocupações técnicas (technical concerns) da lógica de negócios (business logic), e
zh_cn: <emphasis>拦截器</emphasis>将技术关注点从业务逻辑中解耦，并且
zh_tw: <emphasis>interceptors</emphasis>（攔截器）可由商業邏輯去 decouple 技術問題，並且

source: <emphasis>decorators</emphasis> allow business concerns to be compartmentalized.
de_de: <emphasis>Dekoratoren</emphasis> erlauben die Kompartmentalisierung von Business Problemen.
es_es: los <emphasis>decoradores</emphasis> permiten la compartimentación de las cuestiones de negocios.
it_it: i <emphasis>decoratori</emphasis> permettono di compartimentare i problemi di business logic.
ja_jp: <emphasis>デコレータ (decorator)</emphasis> ビジネス関心事を細分化することを可能にします
pt_br: <emphasis>decoradores (decorators)</emphasis> permitem que preocupações de negócios (business concerns) sejam compartimentadas
zh_cn: <emphasis>装饰器</emphasis>允许开发者划分业务关注点。
zh_tw: <emphasis>decorators</emphasis>（裝飾器）可將商業問題分為若干部分。

source: Most importantly, Web Beans provides all these facilities in a <emphasis>typesafe</emphasis> way. Web Beans never uses string-based identifiers to determine how collaborating objects fit together. And XML, though it remains an option, is rarely used. Instead, Web Beans uses the typing information that is already available in the Java object model, together with a new pattern, called <emphasis>binding annotations</emphasis>, to wire together Web Beans, their dependencies, their interceptors and decorators and their event consumers.
de_de: Und das Wichtigste - Web Beans bieten all diese Facilities auf <emphasis>typensichere</emphasis> Weise. Web Beans verwenden nie string-basierte Bezeichner, um zu bestimmen, wie zusammenarbeitende Objekte zusammenpassen. Und XML wird - obwohl es nach wie vor eine Option bleibt - wird selten verwendet. Stattdessen verwenden Web Beans die bereits im Java-Objektmodell verfügbaren Typinformationen gemeinsam mit einem neuen Muster namens <emphasis>Binding-Annotationen</emphasis>, um Web Beans, deren Abhängigkeiten, deren Interzeptoren und Dekoratoren sowie deren Ereignis-Consumer zu verbinden.
es_es: Más importante, Web Beans ofrece todos los servicios en forma<emphasis>typesafe</emphasis>. Web Beans nunca utiliza identificadores de cadena para determinar cómo los objetos de colaboración se ajustan entre sí. Además aunque XML sigue siendo una opción, muy rara vez se utiliza. En su lugar, Web Beans usa la información de teclado disponible en el modelo de objeto Java junto con un nuevo patrón, llamado <emphasis>anotaciones de enlace</emphasis>, para conectar a Web Beans, las dependencias, los interceptores y decoradores y sus consumidores de evento.
it_it: Soprattutto, Web Beans fornisce tutti questi strumenti in un modo <emphasis>typesafe</emphasis>. Web Beans non usa mai identificatori di tipo stringa per determinare come interagiscono oggetti che collaborano fra di loro. Sebbene resti un'opzione, il linguaggio XML è usato raramente. Invece Web Beans utilizza l'informazione di tipo già presente nel modello a oggetti di Java, insieme ad un nuovo pattern, chiamato <emphasis>binding annotations</emphasis>, per assemblare i Web Beans, le loro dipendenze, i loro interceptor e decoratori e i loro consumatori di eventi.
ja_jp: 最も重要なことは、これらすべての機能を Web Beans は <emphasis>タイプセーフ (typesafe)</emphasis> な方法で提供することです。Web Beans は、どのオブジェクトが共同して動作するのに適合しているのかを決定するために、文字列 (String) ベースの識別子を一切使用しません。さらに、オプションとしては残っていますが、XML ファイルもほとんど使用されません。その代わりに Web Beans は、既存の Java オブジェクトモデルで利用可能なタイプ情報と、<emphasis>バインディングアノテーション (binding annotation)</emphasis> と呼ばれる新しいパターンを一緒に使用します。これにより、Web Beans とその依存関係にあるもの、インタセプタ、デコレータ、イベント消費者とが結び付けられます。
pt_br: Mais importante, Web Beans oferece todas essas facilidades de uma maneira <emphasis>typesafe</emphasis>. Web Beans nunca utiliza identificadores baseados em strings para determinar o modo como objetos se relacionam. XML, continua a ser uma opção, mas raramente é utilizado. Em vez disso, a Web Beans utiliza a informação de tipo que já está disponível no modelo de objeto Java, juntamente com um novo padrão, chamado <emphasis>anotações de ligação (binding annotations)</emphasis>, para interconectar Web Beans, suas dependências, seus interceptadores (interceptors) e decoradores (decorators) e seus consumidores de eventos (event consumers).
zh_cn: 最重要的是，Web Beans以一种<emphasis>类型安全</emphasis>的方式提供所有的特性。Web Beans从来不使用基于字符串的标识符来决定交互的对象如何关联在一起。至于XML, 虽然它仍旧是一个选项，但也可以几乎不使用。取而代之，Web Bean使用Java对象模型的类型信息和一种新的<emphasis>绑定注释</emphasis>模式将Web Beans和它们的依赖以及拦截器，装饰器和事件消费者关联在一起。
zh_tw: 最重要的是，Web Bean 以一種 <emphasis>typesafe</emphasis> 的方式來提供了所有的這些功能。Web Bean 從不使用基於字串的識別符號（identifier）來斷定共同協作的物件如何相輔相成。雖然 XML 也是選項之一不過卻很少被使用到。取而代之，Web Bean 使用了 Java 物件模型中可使用的 typing 資訊並統合了一個稱為 <emphasis>binding annotations（綁定標記）</emphasis>的新格式，它可將 Web Bean、它們的相依性、它們的攔截器和裝飾器以及它們的事件用戶聯繫在一起。

source: The Web Beans services are general and apply to the following types of components that exist in the Java EE environment:
de_de: Die Web Beans Dienste sind allgemein und wenden folgende Komponententypen an, die in der Java EE Umgebung existieren:
es_es: Los servicios Web Beans son generales y se aplican a los siguiente tipos de componentes que existen en el entorno EE de Java.
it_it: I servizi di Web Beans sono generali e applicabili ai seguenti tipi di componenti che esistono in ambiente Java EE:
ja_jp: Web Beans サービスは汎用的なので、Java EE 環境にある以下のタイプのコンポーネントに適用できます:
pt_br: Os serviços do Web Beans são genéricos e aplicados aos seguintes tipo de componentes existentes no ambiente Java EE:
zh_cn: Web Beans服务是相当普遍的，可以应用在下列Java EE环境中的组件类型中：
zh_tw: Web Bean 服務為通用的並且適用於下列位於 Java EE 環境中的元件類型：

source: all JavaBeans,
de_de: alle JavaBeans,
es_es: todos los JavaBeans,
it_it: tutti i JavaBeans,
ja_jp: すべてのJavaBeans
pt_br: todos JavaBeans,
zh_cn: 所有的JavaBeans,
zh_tw: 所有 JavaBean、

source: all EJBs, and
de_de: alle EJBs und
es_es: todos los EJB, y
it_it: tutti gli EJB, e
ja_jp: すべてのEJB
pt_br: todos EJBs, e
zh_cn: 所有的EJB, 和
zh_tw: 所有 EJB，以及

source: all Servlets.
de_de: alle Servlets.
es_es: todos los Servlets.
it_it: tutti i Servlets.
ja_jp: すべてのサーブレット
pt_br: todos os Servlets.
zh_cn: 所有的Servlet。
zh_tw: 所有 Servlet。

source: Web Beans even provides the necessary integration points so that other kinds of components defined by future Java EE specifications or by non-standard frameworks may be cleanly integrated with Web Beans, take advantage of the Web Beans services, and interact with any other kind of Web Bean.
de_de: Web Beans bieten sogar die nötigen Integrationspunkte, so dass andere Arten von Komponenten, die durch zukünftige Java EE Spezifikationen oder nicht standardmäßige Frameworks definiert werden, sauber mit Web Beans integriert werden sowie die Web Beans Dienste nutzen und mit anderen Arten von Web Beans interagieren können.
es_es: Web Beans incluso proporciona los puntos de integración necesarios para que otras clases de componentes definidos por especificaciones EE de Java futuras, hagan uso de los servicios de Web Beans e interactúen con otra clase de Web Bean.
it_it: Web Beans fornisce anche i necessari punti di integrazione in modo che altri tipi di componenti definiti da future specifiche Java EE o da framework non standard possano essere integrati in modo trasparente con Web Beans, avvantaggiarsi dei suoi servizi, e interagire con qualunque altro tipo di Web Bean.
ja_jp: さらに Web Beans は、他との連携の際に必要となるインテグレーションポイントを提供します。それゆえ将来の Java EE 仕様あるいは標準ではないフレームワークによって定義された他のコンポーネントが Web Beans ときれいに統合でき、Web Beans サービスを利用し、そして他のどんな種類の Web Beans とでも相互に連携することができます。
pt_br: Web Beans prevê ainda pontos de integração necessários para que outros tipos de componentes definidos pelas futuras especificações Java EE ou por frameworks não-padrão possam ser transparentemente integrados com a Web Beans, tirando proveito dos serviços da Web Beans, e interagindo com qualquer outro tipo de Web Bean.
zh_cn: Web Beans甚至提供了必要的整合点，以便未来的Java EE规范或者其他非标准的框架中的不同组件能够和Web Beans轻松整合，使用Web Beans服务以及和任何其他类型的Web Bean交互。
zh_tw: Web Bean 甚至提供了必要的整合點來讓未來 Java EE 規格或是非標準架構所定義的其它類型元件能夠利落地與 Web Bean 整合、有效利用 Web Bean 服務，並與任何其它類型的 Web Bean 進行互動。
