Repository: 1tchy/core
Catalog: reference/*/part2.po
Languages: de_de, es_es, it_it, pt_br, zh_cn, zh_tw

source: The first major theme of Web Beans is <emphasis>loose coupling</emphasis>. We've already seen three means of achieving loose coupling:
de_de: Das erste wichtige Thema von Web Beans ist <emphasis>Loose Coupling</emphasis> (lose Paarung). Wir haben bereits drei Wege gesehen, diese lose Paarung zu erreichen:
es_es: El primer tema importante de Web Beans es el <emphasis>acoplamiento flexible</emphasis>. Ya hemos visto tres medios para lograr dicho acoplamiento:
it_it: Il primo tema saliente di Web Beans è l'<emphasis>accoppiamento debole (loose coupling)</emphasis>. Abbiamo già visto tre modi per realizzarlo:
pt_br: O primeiro grande tema da Web Beans é <emphasis>fraco acoplamento (loose coupling)</emphasis>. Já vimos três meios de alcançar o fraco acoplamento (loose coupling):
zh_cn: Web Bean的首要宗旨就是<emphasis>松耦合</emphasis>。我们已经看到三种实现松耦合的方法：
zh_tw: Web Bean 的第一個重點就是 <emphasis>loose coupling（鬆散結合性）</emphasis>。我們已經看過了三種 loose coupling 的方式：

source: <emphasis>deployment types</emphasis> enable deployment time polymorphism,
de_de: <emphasis>Deployment-Typen</emphasis> aktivieren Polymorphie zum Zeitpunkt des Deployment,
es_es: Los <emphasis>tipos de despliegue</emphasis> habilitan el polimorfismo del tiempo de despliegue,
it_it: i <emphasis>tipi di deployment</emphasis> rendono possibile il polimorfismo a deployment time,
pt_br: <emphasis>tipo de publicadores (deployment types)</emphasis> habilitam o polimorfismo em tempo de publicação (deployment time polymorphism),
zh_cn: <emphasis>部署类型</emphasis>能够实现部署时多态性
zh_tw: <emphasis>deployment types（建置類型）</emphasis>可啟用建置時間多型性（deployment time polymorphism）、

source: <emphasis>producer methods</emphasis> enable runtime polymorphism, and
de_de: <emphasis>Producer Methoden</emphasis> aktivieren Polymorphie zur Runtime, und
es_es: los <emphasis>métodos de productor</emphasis> habilitan el polimorfismo del tiempo de ejecución, y
it_it: i <emphasis>metodi produttori</emphasis> rendono possibile il polimorfismo a runtime, e
pt_br: <emphasis>método produtores (producer methods)</emphasis> habilitam o polimorfismo em tempo de execução (runtime polymorphism), e
zh_cn: <emphasis>生产者方法</emphasis>能够实现运行时多态性，并且
zh_tw: <emphasis>producer methods</emphasis> 可啟用 runtime Polymorphism（執行期多型性），以及

source: <emphasis>contextual lifecycle management</emphasis> decouples Web Bean lifecycles.
de_de: <emphasis>kontextuelles Lebenszyklus-Management</emphasis> entkoppelt Web Bean Lebenszyklen.
es_es: la <emphasis>administración de ciclo de vida contextual</emphasis> separa los ciclos de vida de WebBean.
it_it: <emphasis>la gestione contestuale del ciclo di vita</emphasis> disaccoppia i cicli di vita dei Web Bean
pt_br: <emphasis>gerenciamento de ciclo de vida contextual (contextual lifecycle management)</emphasis> desacopla o ciclo de vida do Web Bean.
zh_cn: <emphasis>具备上下文的生命周期管理</emphasis>将Web Bean的生命周期解耦。
zh_tw: <emphasis>contextual lifecycle management</emphasis> 可 decouple Web Bean 的生命週期。

source: These techniques serve to enable loose coupling of client and server. The client is no longer tightly bound to an implementation of an API, nor is it required to manage the lifecycle of the server object. This approach lets <emphasis>stateful objects interact as if they were services</emphasis>.
de_de: Diese Techniken dienen der Aktivierung der losen Paarung ("Loose Coupling") von Client und Server. Der Client ist nicht mehr eng an eine API-Implementierung gebunden und muss den Lebenszyklus des Server-Objekts nicht mehr verwalten. Dadurch können <emphasis>Objekte, die "stateful" sind, interagieren als seien Sie Dienste </emphasis>.
es_es: Estas técnicas sirven para habilitar el acoplamiento flexible de cliente y servidor. El cliente ya no está estrechamente ligado a una implementación de un API, ni tiene que administrar el ciclo de vida del objeto del servidor. Este método permite <emphasis>interactuar a los objetos con estado como si fueran servicios</emphasis>.
it_it: Queste tecniche servono a realizzare l'accoppiamento debole (loose coupling) di client e server. Il client non è più strettamente legato all'implementazione di una API, né è tenuto a gestire il ciclo di vita dell'oggetto server. Questo approccio permette <emphasis>agli oggetti stateful di interagire come se fossero servizi</emphasis>.
pt_br: Essas técnicas servem para habiliatr a fraco acoplamento (loose coupling) do cliente e do servidor. O cliente não está mais fortemente ligado (tightly bound) a um implementação de uma API, nem é obrigado a gerenciar o ciclo de vida do obejto servidor. Essa abordagem permite que <emphasis>stateful objects interajam como se fossem serviços</emphasis>.
zh_cn: 这些技术都是为了将客户端和服务器端解耦。客户端不在和一个API的具体实现紧密绑定，也不需要管理服务器端对象的生命周期。这种方法<emphasis>能够让有状态的对象像服务一样交互</emphasis>。
zh_tw: 這些技巧都可用來啟用客戶端以及伺服器的 loose coupling。客戶端已不再固定綁定至一個特定 API 的實做，並且它亦無須管理伺服器物件的生命週期。這個方法能讓<emphasis>有狀態的物件被視為服務一般地來進行互動</emphasis>。

source: Loose coupling makes a system more <emphasis>dynamic</emphasis>. The system can respond to change in a well-defined manner. In the past, frameworks that attempted to provide the facilities listed above invariably did it by sacrificing type safety. Web Beans is the first technology that achieves this level of loose coupling in a typesafe way.
de_de: Lose Paarung macht ein System <emphasis>dynamischer</emphasis>. Das System kann auf gut definierte Weise auf Änderungen reagieren. In der Vergangenheit war es der Fall, dass Frameworks die versuchten die obigen Facilities bereitzustellen, dies auf Kosten der Typensicherheit taten. Bei Web Beans handelt es sich um die erste Technologie, die diese Ebene der losen Paarung auf typensichere Weise ermöglicht.
es_es: El acoplamiento flexible hace más <emphasis>dinámico</emphasis> a un sistema. El sistema puede responder al cambio de una manera bien definida. En el pasado, los marcos que trataban de ofrecer los servicios listados arriba invariablemente lo hacían sacrificando la seguridad. Web Beans es la primer tecnología que logra este nivel de acoplamiento flexible en una forma typesafe.
it_it: L'accoppiamento debole (loose coupling) rende un sistema più <emphasis>dinamico</emphasis>. Il sistema può rispondere ai cambiamenti in un modo ben definito. In passato, i framework che hanno cercato di fornire le funzionalità e gli strumenti sopraelencati, l'hanno puntualmente fatto a discapito della sicurezza dei tipi (type safety). Web Beans è la prima tecnologia a raggiungere questo livello di puntualmente accoppiamento debole (loose coupling) in modo sicuro rispetto all'uso dei tipi.
pt_br: O fraco acoplamento (loose coupling) torna o sistema mais <emphasis>dinâmico</emphasis>. O sistema pode responder a mudanças de uma maneira bem definida. No passado, frameworks que tentaram prover essas facilidades listadas acima invariavelmente acabaram sacrificando a (type safety). A Web Beans é a primeira tecnologia que alcança esse nível de baixo acoplamento (loose coupling) de uma meneira (typesafe).
zh_cn: 松耦合能够让系统更加<emphasis>动态</emphasis>。系统可以以定义良好的方式来相应变化。在过去，多数框架总是通过牺牲类型安全来提供上述功能。实现此种高度的松耦合，同时又能够保证类型安全，Web Beans是第一个实现这个目标的技术。
zh_tw: Loose coupling 會使系統變得更加<emphasis>動態式</emphasis>。系統可透過充足定義的方式來回應變更。過去，有許多 framework 嘗試了提供以上所列出的功能，不過卻都是藉由犧牲了 type safety 來達成的。Web Bean 是第一個以 typesafe 的方式來實現此層級的 loose coupling 的技術。

source: Web Beans provides three extra important facilities that further the goal of loose coupling:
de_de: Web Beans bieten drei weitere wichtige Facilities, die das Ziel loser Paarung weiterbringen:
es_es: Web Beans ofrece tres servicios adicionales importantes que amplían el objetivo del acoplamiento flexible:
it_it: Web Beans fornisce tre strumenti extra importanti che ampliano l'obiettivo del loose coupling:
pt_br: Web Beans provê três facilidades extras importantes que ultrapassam o objetivo do fraco acoplamento ( loose coupling):
zh_cn: Web Bean提供三种额外的功能来实现松耦合的目标：
zh_tw: Web Bean 提供了三個額外的重要功能以用來達成 loose coupling：

source: <emphasis>interceptors</emphasis> decouple technical concerns from business logic,
de_de: <emphasis>Interzeptoren</emphasis> entkoppeln technische Probleme von Business Logik,
es_es: los <emphasis>interceptores</emphasis> separan las cuestiones técnicas de la lógica de negocios,
it_it: gli <emphasis>interceptor</emphasis> disaccoppiano i problemi tecnici dalla business logic,
pt_br: <emphasis>interceptadores</emphasis> desacompalm technical concerns from business logic,
zh_cn: <emphasis>拦截器</emphasis>能够将技术关注点从业务逻辑中解耦。
zh_tw: <emphasis>interceptors（攔截器）</emphasis>可區分技術問題與商業邏輯，

source: <emphasis>decorators</emphasis> may be used to decouple some business concerns, and
de_de: <emphasis>Dekoratoren</emphasis> ("Decorators") können eingesetzt werden, um einige Business Probleme zu entkoppeln und
es_es: los <emphasis>decoradores</emphasis> pueden ser utilizados para separar algunas cuestiones de negocios, y
it_it: i <emphasis>decoratori</emphasis> possono essere usati per disaccoppiare alcuni problemi relativi alla business logic, e
pt_br: <emphasis>decoradores</emphasis> podem ser utilzados para desacoplar
zh_cn: <emphasis>装饰器</emphasis>能够将一些业务关注点解耦，并且
zh_tw: <emphasis>decorators（裝飾器）</emphasis>可被用來區分一些商業問題，並且

source: <emphasis>event notifications</emphasis> decouple event producers from event consumers.
de_de: <emphasis>Ereignis Benachrichtigungen</emphasis> ("Event Notifications") entkoppeln Ereignis-Producer von Ereignis-Konsument.
es_es: las <emphasis>notificaciones de eventos</emphasis> separan a los productores de eventos de los consumidores de eventos.
it_it: le <emphasis>notifiche degli eventi</emphasis> disaccoppiano i produttori di eventi dai consumatori
pt_br: <emphasis>notificadores de eventos</emphasis> desacoplam os produtores de eventos dos consumidores de eventos.
zh_cn: <emphasis>事件通知</emphasis>机制能将事件消费者和事件生产者解耦。
zh_tw: <emphasis>event notifications（事件通知）</emphasis>可區分事件產生器（event producer）與事件用戶（event consumer）。

source: Let's explore interceptors first.
de_de: Sehen wir uns zunächst die Interzeptoren an.
es_es: En primer lugar, exploremos los interceptores.
it_it: Innanzitutto esploriamo gli interceptor.
pt_br: Vamos primeiramente explorar os interceptadores (interceptors)
zh_cn: 让我们首先研究拦截器。
zh_tw: 讓我們先來探討攔截器（interceptor）。
