Repository: 1tchy/core
Catalog: reference/*/part1.po
Languages: de_de, es_es, it_it, ja_jp, pt_br, zh_cn, zh_tw

source: Web Beans was influenced by a number of existing Java frameworks, including Seam, Guice and Spring. However, Web Beans has its own very distinct character: more typesafe than Seam, more stateful and less XML-centric than Spring, more web and enterprise-application capable than Guice.
de_de: Web Beans wurden durch eine Reihe bestehender Java Frameworks beeinflusst, darunter Seam, Guice und Spring. Jedoch besitzen Web Beans ihre eigenen Eigenschaften: Typesicherer als Seam, mehr stateful und weniger XML-zentrisch als Spring, mehr Web- und Enterprise-anwendungsfähig als Guice.
es_es: Una gran cantidad de marcos existentes de Java, incluyendo Seam, Guice y Spring, influyeron en Web Beans. No obstante, Web Beans tiene su propio carácter distintivo: más typesafe que Seam, más con estado y menos centrada en XML que Spring, más red y aplicación de empresa más capaz que Guice.
it_it: Web Beans è stata influenzata da un buon numero di framework Java esistenti, inclusi Seam, Guice and Spring. Comunque, Web Beans ha un proprio chiaro carattere distintivo: è più sicuro nell'uso dei tipi (typesafe) di Seam, è più orientato allo stato (stateful) e meno basato su XML di Spring, e più capace di Guice nelle applicazioni web ed enterprise.
ja_jp: Web Beans は、Seam や Guice、Spring を含む多くの現存する Java フレームワークから影響を受けました。しかし、Web Beans はそれ自身とても特徴的な性質を持っています: Seam よりもタイプセーフであり、Spring よりもステートフルであって XML セントリックではなく、Guice よりも多くの Web アプリケーションとエンタープライズアプリケーション向けの機能があります。
pt_br: Web Beans foi influênciado por inúmeros frameworks Java existentes, incluindo Seam, Guice e Spring. Entretanto, Web Beans tem suas características peculiares: mais typesafe que o Seam, mais stateful e mesmo centrado em XML (XML-centric) que o Spring, mais web e enterprise-aplication que o Guice.
zh_cn: Web Beans受到了包括Seam, Guice和Spring在内的很多现有的Java框架的影响。然而，Web Beans具有自己鲜明的特性：在类型安全方面优于Seam，比Spring更加具备状态和使用更少的XML, 比Guice更加具备Web和企业应用的能力。
zh_tw: Web Bean 受到了幾個現有的 Java framework（包括 Seam、Guice 以及 Spring）的影響。不過，Web Bean 擁有它自己獨特的特性：比 Seam 還要完善的 typesafe、比 Spring 更 stateful 而沒有那麼地以 XML 為中心，並且針對於網站和企業級的應用程式上的處理能力比 Guice 完善。

source: Most importantly, Web Beans is a JCP standard that integrates cleanly with Java EE, and with any Java SE environment where embeddable EJB Lite is available.
de_de: Und das Wichtigste - bei Web Beans handelt es sich um einen JCP-Standard, der sich sauber mit Java EE und mit jeder anderen Java SE Umgebung integrieren lässt, bei der einbettbares EJB Lite verfügbar ist.
es_es: Lo más importante es que Web Beans es un JCP estándar que se integra sin problemas con EE de Java y con cualquier entorno SE dónde EJB Lite incrustado esté disponible.
it_it: Soprattutto, Web Beans è uno standard JCP che si integra in modo trasparente con Java EE, e con qualunque ambiente Java SE dove EJB Lite sia disponibile in modo embeddable.
ja_jp: 最も重要な点は、Web Beans は JCP 標準であるので、Java EE 環境や、さらには 組み込み可能な EJB Lite を利用可能などんな Java SE 環境とでもきれいに統合できることです。
pt_br: Mais importante, Web Beans é um padrão do JCP que integra-se transparentemente com o Java EE, e com qualquer outro ambiente Java SE onde o EJB leve embutido (embeddable EJB Lite) está disponível.
zh_cn: 最重要的是，Web Beans是一个JCP标准，能够干净地整合到Java EE中。Web Beans也可以整合到任何使用轻量的内嵌EJB的Java SE环境中。
zh_tw: 最重要的是，Web Bean 是一個能與 Java EE 以及可使用崁入式的 EJB Lite 的任何 Java SE 環境整合的 JCP 標準。
