Repository: 1tchy/core
Catalog: reference/*/producermethods.po
Languages: ja_jp, ko_kr, pt_br, zh_cn

source: Producer methods
ja_jp: プロデューサメソッド
ko_kr: 생산자 방식
pt_br: Métodos produtores
zh_cn: 生产者方法

source: Producer methods let us overcome certain limitations that arise when the Web Bean manager, instead of the application, is responsible for instantiating objects. They're also the easiest way to integrate objects which are not Web Beans into the Web Beans environment. (We'll meet a second approach in <xref linkend="xml"/>.)
ja_jp: Web Beanマネージャがアプリケーションの代わりにオブジェクトのインスタンス化に対して責務を負うときいくらかの発生する制限をプロデューサメソッドは、克服してくれます。それらはWeb BeansでないオブジェクトをWeb Beans環境に統合する最も簡単な方法でもあります。（我々は<xref linkend="xml"/>で2番目のアプローチを見ることになるでしょう。）
ko_kr: 생산자 방식은 Web Bean 관리자가 애플리케이션 대신 인스턴스 객체에 응답할 때 발생할 수 있는 특정한 한계를 극복할 수 있게 합니다. Web Beans이 아닌 객체를 Web Beans 환경으로 통합하기 위한 가장 쉬운 방법이 있습니다. (<xref linkend="xml"/>에서 두번째 방법에 대해 살펴보겠습니다.)
pt_br: Métodos produtores permitem superarmos certas limitações que surgem quando o gerenciador do Web Bean, em vez da aplicação, é responsável por instanciar objetos. Eles são também a forma mais fácil de integrar os objetos que não são Web Beans ao ambiente Web Beans. (Veremos uma segunda abordagem em <xref linkend="xml"/>.)
zh_cn: 生产者方法能够让我们克服使用Web Bean管理器代替应用来负责实例化对象所带来的特定的限制。生产者方法也是将非Web Beans的对象整合到Web Beans环境中的最简单的途径。（我们将在<xref linkend="xml"/>讨论第二种方法）

source: According to the spec:
ja_jp: 仕様によると、
ko_kr: spec에 의하면:
pt_br: De acordo com a especificação:
zh_cn: 根据规范：

source: A Web Beans producer method acts as a source of objects to be injected, where:
ja_jp: Web Beansのプロデューサメソッドは、次のような場合にインジェクトされるオブジェクトを生成するものとして動作します。
pt_br: Um método produtor Web Beans funciona como uma fonte de objetos a ser injetado, quando:

source: the objects to be injected are not required to be instances of Web Beans,
ja_jp: インジェクトされるオブジェクトはWeb Beansのインスタンスである必要はない。
pt_br: os objetos a serem injetados não forem obrigados a ser instâncias de Web Beans,

source: the concrete type of the objects to be injected may vary at runtime or
ja_jp: インジェクトされるオブジェクトの具象型は実行時によって変わるかもしれない。
pt_br: o tipo concreto dos objetos a serem injetados pode variar em tempo de execução ou

source: the objects require some custom initialization that is not performed by the Web Bean constructor
ja_jp: オブジェクトはWeb Beanコンストラクタにより実行されないカスタムの初期化を必要とする。
pt_br: os objetos requerem alguma inicialização personalizada que não é realizada pelo construtor do Web Bean

source: For example, producer methods let us:
ja_jp: 例えば、プロデューサメソッドによって以下のことをすることができます。
pt_br: Por exemplo, métodos produtores permitem:

source: expose a JPA entity as a Web Bean,
ja_jp: JPAエンティティをWeb Beanとして公開する。
pt_br: expor uma entidade JPA como um Web Bean,

source: expose any JDK class as a Web Bean,
ja_jp: あらゆるJDKクラスをWeb Beanとして公開する。
pt_br: expor qualquer classe do JDK como um Web Bean,

source: define multiple Web Beans, with different scopes or initialization, for the same implementation class, or
ja_jp: 同じ実装クラスに対して、異なるスコープや初期化をされた状態で複数のWeb Beansを定義する。
pt_br: definir vários Web Beans, com diferentes escopos ou inicialização, para a mesma implementação da classe, ou

source: vary the implementation of an API type at runtime.
ja_jp: 実行時にAPIタイプの実装を変える。
pt_br: variar a implementação de um tipo da API em tempo de execução.

source: In particular, producer methods let us use runtime polymorphism with Web Beans. As we've seen, deployment types are a powerful solution to the problem of deployment-time polymorphism. But once the system is deployed, the Web Bean implementation is fixed. A producer method has no such limitation:
ja_jp: 特に、プロデューサメソッドによってWeb Beanを利用した実行時ポリモフィズムを利用できるようになります。見てきたように、デプロイメントタイプはデプロイメントの多態性の問題に対するパワフルなソリューションです。しかし、一旦そのシステムがデプロイされると、そのWeb Beanの実装は固定されてしまいます。プロデューサメソッドにはそのような制限はありません。
pt_br: Em particular, métodos produtores permite-nos utilizar o polimorfismo em tempo de execução com Web Beans. Como vimos, os tipo de implantação são uma poderosa solução para o problema do polimorfismo em tempo de implantação. Mas, uma vez que o sistema está implantado, a implementação do Web Bean é fixada. Um método produtor não tem essa limitação:

source: Consider an injection point:
ja_jp: インジェクションポイントを見てみましょう。
pt_br: Considere o ponto de injeção:

source: This injection point has the same type and binding annotations as the producer method, so it resolves to the producer method using the usual Web Beans injection rules. The producer method will be called by the Web Bean manager to obtain an instance to service this injection point.
ja_jp: このインジェクションポイントはプロデューサメソッドと同じ型とバインディングアノテーションを持ち、そして通常のWeb Beansのインジェクションルールを利用するプロデューサメソッドを解決します。プロデューサメソッドはこのインジェクションポイントをサービスするインスタンスを得るためにWeb Beanマネージャによって呼び出されるでしょう。
pt_br: Esse ponto de injeção tem o mesmo tipo e anotações de binding que o método produtor. Assim, resolve para o método produtor utilizando as regras de injeção da Web Beans. O método produtor será invocado pelo gerenciador do Bean Web para obter uma instância para servir esse ponto de injeção.

source: Scope of a producer method
ja_jp: プロデューサメソッドのスコープ
ko_kr: 생산자 방식의 범위
pt_br: Escopo de um método produtor
zh_cn: 生产者方法的范围

source: The scope of the producer method defaults to <literal>@Dependent</literal>, and so it will be called <emphasis>every time</emphasis> the Web Bean manager injects this field or any other field that resolves to the same producer method. Thus, there could be multiple instances of the <literal>PaymentStrategy</literal> object for each user session.
ja_jp: プロデューサメソッドのスコープはデフォルトでは<literal>@Dependent</literal>になります。そして、Web Beanマネージャがこのフィールドあるいは、同じプロデューサメソッドに解決される他のフィールドをインジェクトする度に<emphasis>毎回</emphasis>呼び出されます。したがって、それぞれのユーザセッション毎に<literal>PaymentStrategy</literal>オブジェクトの複数のインスタンスがあるかもしれません。
ko_kr: 생산자 방식의 기본값 범위는 <literal>@Dependent</literal>로 되어 있으므로, <emphasis>매 번</emphasis> Web Bean 관리자가 이러한 영역 또는 동일한 생산자 방식으로 해결되는 다른 영역을 삽입할 때 마다 호출됩니다. 따라서, 각각의 사용자 세션에 대해 <literal>PaymentStrategy</literal> 객체의 인스턴스가 여러개 있을 수 있습니다.
pt_br: O escopo padrão dos métodos produtores é <literal>@Dependent</literal>, e, por isso ,serão chamados <emphasis>toda vez</emphasis> que o gerenciador do Web Bean injetar esse atributo ou qualquer outro atributo que resolve para o mesmo método produtor. Assim, pode haver várias instâncias do objeto <literal>PaymentStrategy</literal> para cada sessão do usuário.
zh_cn: 默认的生产者方法的范围是 <literal>@Dependent</literal>，所以Web Bean管理器<emphasis>每次</emphasis>注入这个域或者注入任何其他对应改生产者方法的域的时候，这个生产者方法都会被调用。这样，对于每个用户会话，我们有可能有多个<literal>PaymentStrategy</literal>实例。

source: To change this behavior, we can add a <literal>@SessionScoped</literal> annotation to the method.
ja_jp: この振る舞いを変えるために、私たちはメソッドに<literal>@SessionScoped</literal>アノテーションを追記することができます。
ko_kr: 이러한 기능을 변경하려면, <literal>@SessionScoped</literal> 어노테이션 방식을 추가할 수 있습니다.
pt_br: Para mudar esse comportamento, nós podemos adicionar a anotação <literal>@SessionScoped</literal> ao método.
zh_cn: 要改变这种行为，我们可以给这个方法添加一个 <literal>@SessionScoped</literal> 注释。

source: Now, when the producer method is called, the returned <literal>PaymentStrategy</literal> will be bound to the session context. The producer method won't be called again in the same session.
ja_jp: 今度プロデューサメソッドが呼び出されると、戻された<literal>PaymentStrategy</literal>はセッションコンテキストに属することになります。プロデューサメソッドが同じセッションで再び呼び出されることは無いでしょう。
ko_kr: 이제 생산자 방식이 호출되면, 반환된 <literal>PaymentStrategy</literal>는 세션 컨텍스트로 바운드됩니다. 동일한 세션에서 생산자 방식은 다시 호출되지 않습니다.
pt_br: Agora, quando o método produtor é chamado, o <literal>PaymentStrategy</literal> retornado será associado ao contexto sessão. O método produtor não será invocado novamente na mesma sessão.
zh_cn: 现在，当这个生产者方法被调用时，它返回的 <literal>PaymentStrategy</literal> 对象将被绑定到会话上下文中。这个生产者方法在同一个会话范围中不会被再次调用。

source: Injection into producer methods
ja_jp: プロデューサメソッドへのインジェクション
ko_kr: 생산자 방식으로 삽입
pt_br: Injeção em métodos produtores
zh_cn: 注入到生产者方法中

source: There's one potential problem with the code above. The implementations of <literal>CreditCardPaymentStrategy</literal> are instantiated using the Java <literal>new</literal> operator. Objects instantiated directly by the application can't take advantage of dependency injection and don't have interceptors.
ja_jp: 上のコードには１つの潜在的な問題があります。<literal>CreditCardPaymentStrategy</literal>の実装はJavaの<literal>new</literal>演算子を使ってインスタンス化されています。アプリケーションにより直接インスタンス化されたオブジェクトは依存性注入の恩恵を受けることができず、インターセプタを持ちません。
ko_kr: 위의 코드에 한 가지 문제가 있을 수 있습니다. <literal>CreditCardPaymentStrategy</literal> 구현은 Java <literal>new</literal> 연산자를 사용하여 인스턴스화됩니다. 애플리케이션에 의해 직접 인스턴스화된 객체는 의존성 삽입의 장점을 취할 수 없으며 인터셉터를 갖지 못합니다.
pt_br: Existe um problema potencial com o código acima. As implementações de <literal>CreditCardPaymentStrategy</literal> são instanciadas utilizando o operador de Java <literal>new</literal>. Objetos instanciados diretamente pela aplicação não usufruem da injeção de dependência e não possuem interceptadores.
zh_cn: 上面的代码有一个潜在的问题。 <literal>CreditCardPaymentStrategy</literal> 的实现使用Java的 <literal>new</literal> 操作符来实例化。应用直接实例化的对象无法获得依赖注入的好处，也无法获得拦截器。

source: If this isn't what we want we can use dependency injection into the producer method to obtain Web Bean instances:
ja_jp: これが望むことでないのであれば、私たちはWeb Beanインスタンスを取得するためにプロデューサメソッドに依存性注入することができます。
ko_kr: 이러한 방식을 원하지 않을 경우, 의존성 삽입을 생산자 방식으로 사용하여 Web Bean 인스턴스를 획득할 수 있습니다:
pt_br: Se não é isso o que queremos, podemos utilizar a injeção de dependência no método produtor para obter instâncias do Web Bean:
zh_cn: 如果这不是我们想要的，我们可以对生产者方法使用依赖注入来获得Web Bean实例：

source: Wait, what if <literal>CreditCardPaymentStrategy</literal> is a request scoped Web Bean? Then the producer method has the effect of "promoting" the current request scoped instance into session scope. This is almost certainly a bug! The request scoped object will be destroyed by the Web Bean manager before the session ends, but the reference to the object will be left "hanging" in the session scope. This error will <emphasis>not</emphasis> be detected by the Web Bean manager, so please take extra care when returning Web Bean instances from producer methods!
ja_jp: 待って！もし<literal>CreditCardPaymentStrategy</literal>がリクエストスコープのWeb Beanだとしたら？その場合、プロデューサメソッドは現在のリクエストスコープをセッションスコープに"プロモート"する効果を持ちます。これはほぼ確実なバグ！リクエストスコープのオブジェクトはセッションが終わる前にWeb Beanマジェージャによって破棄されることになるでしょうが、オブジェクトのリファレンスはセッションスコープに"ぶら下がった"ままになるでしょう。このエラーはWeb Beanマジェージャには検知され<emphasis>ない</emphasis>でしょうから、Web Beanインスタンスをプロデューサメソッドから戻すときには気をつけてください。
ko_kr: <literal>CreditCardPaymentStrategy</literal>가 요청 범위 Web Bean이면 어떻게 합니까? 이럴 경우 생산자 방식은 현재 요청 범위 임스턴스를 세선 범위로 "활성화되게" 됩니다. 이는 버그입니다! 요청 범위 객체는 세션이 종료되기 전 Web Bean 관리자에 의해 삭제되지만, 객체에 대한 참조는 세션 범위에 "남아 있게" 됩니다. 이러한 오류는 Web Bean 관리자에 의해 검출되지 <emphasis>않으므로</emphasis> 생산자 방식에 Web Bean 인스턴스를 반환할 경우 각별히 주의하시기 바랍니다!
pt_br: Espere, o que se <literal>CreditCardPaymentStrategy</literal> é um Web Bean de escopo de requisição? Então o método produtor tem o efeito de "promover" a instância atual no escopo de requisição para o escopo de sessão. Isso certamente é um erro! O objeto no escopo de requisição será destruído pelo gerenciador do Web Bean antes de terminar a sessão, mas a referência ao objeto será deixada "presa" no escopo sessão. Esse erro <emphasis>não</emphasis> será detectado pelo gerenciador do Web Bean. Por isso, tome cuidado quando retornar instâncias de Web Bean em métodos produtores!
zh_cn: 等一下，如果 <literal>CreditCardPaymentStrategy</literal> 是一个请求范围的Web Bean，那会怎样？生产者方法将会把当前请求范围的实例"提升"到会话范围。这近乎是一个Bug！请求范围的对象会在会话结束前被Web Bean管理器销毁，但是这个对象的引用将被 "悬挂"在会话范围。Web Bean管理器<emphasis>不会</emphasis>检测到这种错误，因此使用生产者方法返回Web bean实例的时候一定要多加小心！

source: There's at least three ways we could go about fixing this bug. We could change the scope of the <literal>CreditCardPaymentStrategy</literal> implementation, but this would affect other clients of that Web Bean. A better option would be to change the scope of the producer method to <literal>@Dependent</literal> or <literal>@RequestScoped</literal>.
ja_jp: 私たちがこのバグを解決する方法が少なくとも3つあります。私たちは<literal>CreditCardPaymentStrategy</literal>を実装したスコープを変えることができますが、これはWeb Beanの他のクライアントに影響を与えるでしょう。より良い選択肢はプロデューサメソッドのスコープを<literal>@Dependent</literal>か<literal>@RequestScoped</literal>に変えることでしょう。
ko_kr: 이러한 버그를 해결할 수 있는 세 가지 방법이 있습니다. <literal>CreditCardPaymentStrategy</literal> 구현 범위를 변경할 수 있지만, Web Bean의 클라이언트에 영향을 미칠 수 있습니다. 보다 나은 방법으로 생산자 방식의 범위를 <literal>@Dependent</literal> 또는 <literal>@RequestScoped</literal>로 변경하는 것입니다.
pt_br: Existem pelo menos três maneiras de corrigirmos esse erro. Podemos alterar o escopo da implementação do <literal>CreditCardPaymentStrategy</literal>, mas isso poderia afetar outros clientes desse Web Bean. A mehor opção seria alterar o escopo do médoto produtor para <literal>@Dependent</literal> ou <literal>@RequestScoped</literal>.
zh_cn: 我们至少有三种方式来解决这个Bug。我们可以改变 <literal>CreditCardPaymentStrategy</literal>实现的范围，但是这种方法将影响到其他使用这个Web Bean的客户。一个更好的选择是将生产者方法的范围更改到 <literal>@Dependent</literal> 或者 <literal>@RequestScoped</literal>。

source: But a more common solution is to use the special <literal>@New</literal> binding annotation.
ja_jp: しかし、より一般的なソリューションは特別な<literal>@New</literal>バインディングアノテーションを使用することです。
ko_kr: 하지만 보다 일반적인 방법은 특별한 <literal>@New</literal> 바인딩 어노테이션을 사용하는 것입니다.
pt_br: Mas, uma solução mais comum é utilizar a anotação especial de binding <literal>@New</literal>
zh_cn: 不过更加常用的方法是使用特殊的 <literal>@New</literal> 绑定注释。

source: Use of <literal>@New</literal> with producer methods
ja_jp: プロデューサメソッドへの<literal>@New</literal>アノテーションの使用
ko_kr: 생산자 방식과 함께 <literal>@New</literal> 사용
pt_br: Uso do <literal>@New</literal> em métodos produtores
zh_cn: 在生产者方法中使用 <literal>@New</literal>

source: Consider the following producer method:
ja_jp: 以下のプロデューサメソッドを見てみましょう。
ko_kr: 다음과 같은 생산자 방식을 고려합니다:
pt_br: Considere o seguinte método produtor:
zh_cn: 考虑到下面的生产者方法：

source: Then a new <emphasis>dependent</emphasis> instance of <literal>CreditCardPaymentStrategy</literal> will be created, passed to the producer method, returned by the producer method and finally bound to the session context. The dependent object won't be destroyed until the <literal>Preferences</literal> object is destroyed, at the end of the session.
ja_jp: 今度は、<literal>CreditCardPaymentStrategy</literal>の新たな<emphasis>依存</emphasis>インスタンスが作成され、プロデューサメソッドに渡され、プロデューサメソッドにより戻され、そして最終的にセッションコンテキストに属することになります。そのセッションの最後で<literal>Preferences</literal>オブジェクトが破棄されるまで依存オブジェクトは破棄されることは無いでしょう。
ko_kr: <literal>CreditCardPaymentStrategy</literal>의 새로운 <emphasis>의존성</emphasis> 인스턴스가 생성되면, 생산자 방식으로 전달하고, 생산자 방식에 의해 반환된 후, 마지막으로 세션 컨텍스트로 바운딩됩니다. 의존성 객체는 세션 마지막에 <literal>Preferences</literal> 객체가 삭제될 때 까지 삭제되지 않습니다.
pt_br: Assim a nova instância <emphasis>dependente</emphasis> de <literal>CreditCardPaymentStrategy</literal> será criada, passada para o método produtor, retornada pelo método produtor e, finalmente, associada ao contexto de sessão. O objeto dependente não será destruído até que o objeto <literal>Preferences</literal> seja destruído, no término da sessão.
zh_cn: 一个新的<emphasis>依赖</emphasis>的 <literal>CreditCardPaymentStrategy</literal> 实例将被创建，然后传递给生产者方法，然后生产者方法将其返回，最终这个实例将被绑定到会话上下文。这个依赖对象不会被提前销毁，而是在会话结束时跟随 <literal>Preferences</literal> 一起被销毁。

source: <blockquote> <para>A Web Beans producer method acts as a source of objects to be injected, where:</para> <itemizedlist> <listitem> <para>the objects to be injected are not required to be instances of Web Beans,</para> </listitem> <listitem> <para>the concrete type of the objects to be injected may vary at runtime or</para> </listitem> <listitem> <para>the objects require some custom initialization that is not performed by the Web Bean constructor</para> </listitem> </itemizedlist> </blockquote> <para>For example, producer methods let us:</para> <itemizedlist> <listitem> <para>expose a JPA entity as a Web Bean,</para> </listitem> <listitem> <para>expose any JDK class as a Web Bean,</para> </listitem> <listitem> <para>define multiple Web Beans, with different scopes or initialization, for the same implementation class, or</para> </listitem> <listitem> <para>vary the implementation of an API type at runtime.</para> </listitem> </itemizedlist> <para>In particular, producer methods let us use runtime polymorphism with Web Beans. As we've seen, deployment types are a powerful solution to the problem of deployment-time polymorphism. But once the system is deployed, the Web Bean implementation is fixed. A producer method has no such limitation:</para> <programlisting role="JAVA"><![CDATA[@SessionScoped public class Preferences { private PaymentStrategyType paymentStrategy; ... @Produces @Preferred public PaymentStrategy getPaymentStrategy() { switch (paymentStrategy) { case CREDIT_CARD: return new CreditCardPaymentStrategy(); case CHEQUE: return new ChequePaymentStrategy(); case PAYPAL: return new PayPalPaymentStrategy(); default: return null; } } }]]></programlisting> <para>Consider an injection point:</para> <programlisting role="JAVA"><![CDATA[@Preferred PaymentStrategy paymentStrat;]]></programlisting> <para>This injection point has the same type and binding annotations as the producer method, so it resolves to the producer method using the usual Web Beans injection rules. The producer method will be called by the Web Bean manager to obtain an instance to service this injection point.</para>.
ko_kr: <blockquote> <para> Web Beans 생산자 방식은 삽입될 객체 소스로 작동합니다, 여기서 </para> <itemizedlist> <listitem> <para> 삽입될 객체는 Web Beans의 인스턴스가 될 필요가 없습니다,</para> </listitem> <listitem> <para> 삽입되야 할 객체의 구체적 타입은 런타임 시 달라질 수 있습니다 </para> </listitem> <listitem> <para> 사용자 정의 초기화가 필요한 객체는 Web Bean 생성자에 의해 실행되지 않습니다</para> </listitem> </itemizedlist> </blockquote> <para> 예를 들어, 생산자 방식은 다음을 허용합니다: </para> <itemizedlist> <listitem> <para>Web Bean으로서 JPA 엔티티 노출,</para> </listitem> <listitem> <para>Web Bean으로서 JDK 클래스 노출,</para> </listitem> <listitem> <para>동일한 구현 클래스에 대해 다른 범위 또는 초기화를 사용하여 여러 Web Beans를 정의, </para> </listitem> <listitem> <para>런타임 시 다양한 API 유형 구현.</para> </listitem> </itemizedlist> <para> 특히, 생산자 방식은 Web Beans를 사용하여 런타임 다형성을 사용하게 합니다. 이미 알고 있듯이, 배포 유형은 배포 시간 다형성 문제의 강력한 해결책입니다. 하지만 일단 시스템이 운용되면 Web Bean 구현은 고정됩니다. 생산자 방식은 이러한 한계를 갖지 않습니다:</para> <programlisting role="JAVA"><![CDATA[@SessionScoped public class Preferences { private PaymentStrategyType paymentStrategy; ... @Produces @Preferred public PaymentStrategy getPaymentStrategy() { switch (paymentStrategy) { case CREDIT_CARD: return new CreditCardPaymentStrategy(); case CHEQUE: return new ChequePaymentStrategy(); case PAYPAL: return new PayPalPaymentStrategy(); default: return null; } } }]]></programlisting> <para>삽입 지점 고려:</para> <programlisting role="JAVA"><![CDATA[@Preferred PaymentStrategy paymentStrat;]]></programlisting> <para> 이러한 삽입 지점은 동일한 유형을 갖으며 생산자 방식으로 어노테이션을 바인딩하므로, 일반적인 Web Beans 삽입 규칙을 사용하여 생산자 방식을 해결합니다. 생산자 방식은 Web Bean 관리자에 의해 호출되어 이러한 삽입 지점을 서비스하기 위해 인스턴스를 획득합니다.</para>.
zh_cn: <blockquote> <para>一个Web Bean生产者方法在下列情况下作为注入对象的源：</para> <itemizedlist> <listitem> <para>所要注入的对象并不要求是一个Web Bean的实例，</para> </listitem> <listitem> <para>所要注入的对象的具体类型有可能在运行时变化，或者</para> </listitem> <listitem> <para>对象需要一些Web Bean构造器无法完成的一些自定义的初始化工作</para> </listitem> </itemizedlist> </blockquote> <para>例如，生产者方法能够让我们：</para> <itemizedlist> <listitem> <para>将JPA实体作为一个Web Bean暴露出来，</para> </listitem> <listitem> <para>将任何JDK类作为Web Bean暴露出来，</para> </listitem> <listitem> <para>为相同的一个实现类定义多个Web Beans，每个都拥有不同的范围或者初始化，或者</para> </listitem> <listitem> <para>在运行时改变一个接口类型的具体实现。</para> </listitem> </itemizedlist> <para>特别是生产者方法让我们能够使用Web Beans实现运行时多态性。就像我们看到的那样，部署类型是解决部署时多态性的解决方案。不过一旦系统被部署之后，Web Bean的实现也就固定了。一个生产者方法并没有这样的限制：</para> <programlisting role="JAVA"><![CDATA[@SessionScoped public class Preferences { private PaymentStrategyType paymentStrategy; ... @Produces @Preferred public PaymentStrategy getPaymentStrategy() { switch (paymentStrategy) { case CREDIT_CARD: return new CreditCardPaymentStrategy(); case CHEQUE: return new ChequePaymentStrategy(); case PAYPAL: return new PayPalPaymentStrategy(); default: return null; } } }]]></programlisting> <para>我们看一下注入点：</para> <programlisting role="JAVA"><![CDATA[@Preferred PaymentStrategy paymentStrat;]]></programlisting> <para>这个注入点和生产者方法拥有相同的类型和绑定注释，所以使用常见的Web Bean注入规则。生产者方法将被Web Bean管理器调用，从而获得一个实例来供给这个注入点。</para>.
