Repository: 1tchy/core
Catalog: reference/*/ri-spi.po
Languages: de_de, es_es, it_it, ja_jp, ko_kr, zh_cn

source: Integrating Web Beans into other environments
ja_jp: 他の環境へのWeb Beansの統合

source: Currently Web Beans only runs in JBoss AS 5; integrating the RI into other EE environments (for example another application server like Glassfish), into a servlet container (like Tomcat), or with an Embedded EJB3.1 implementation is fairly easy. In this Appendix we will briefly discuss the steps needed.
ja_jp: 現在のWeb BeansはJBoss AS 5でのみ動作します。他のEE環境(たとえば、Glassfishのような別のアプリケーションサーバー)に、または(Tomcatoのような)サーブレットコンテナに、または組み込みEJB3.1の実装と統合することは、実に簡単です。この付録では、統合のために必要なステップについて簡単に記述しています。

source: The Web Beans SPI
ja_jp: Web Beans SPI

source: The Web Beans SPI is located in the <literal>webbeans-spi</literal> module, and packaged as <literal>webbeans-spi.jar</literal>. Some SPIs are optional, if you need to override the default behavior, others are required.
ja_jp: Web Beans SPIは<literal>webbeans-spi</literal>モジュールにあり、<literal>webbeans-spi.jar</literal>としてパッケージされています。いくつかのSPIはオプションで、デフォルトの振る舞いを上書きする必要がある場合は、他のものが必要です。

source: All interfaces in the SPI support the decorator pattern and provide a <literal>Forwarding</literal> class located in the <literal>helpers</literal> sub package. Additional, commonly used, utility classes, and standard implementations are also located in the <literal>helpers</literal> sub package.
ja_jp: SPIのすべてのインタフェースがデコレータパターンをサポートし、<literal>helpers</literal> サブパッケージの中にある<literal>Forwarding</literal>クラスを提供します。加えて、共通で使用されるユーティリティクラスや標準実装は<literal>helpers</literal>サブパッケージの中にあります、

source: Web Bean Discovery
ja_jp: Web Bean ディスカバリ
ko_kr: Web Bean 검색
zh_cn: Web Bean的发现

source: The discovery of Web Bean classes and <literal>beans.xml</literal> files is self-explanatory (the algorithm is described in Section 11.1 of the JSR-299 specification, and isn't repeated here).
ja_jp: Web Beanのクラスと<literal>bean.xml</literal>ファイルの探索についてはここでは説明しません(アルゴリズムは、JSR-299スペックのセクション11.1で説明されており、ここで繰り返し説明しません)。

source: EJB services
it_it: Servizi EJB
ja_jp: EJBサービス

source: Web Beans will run without an EJB container; in this case you don't need to implement the EJB SPI.
ja_jp: Web BeansはEJBコンテナなしで動作するでしょう。この場合、あなたは、EJB SPIを実装する必要はありません。

source: Web Beans also delegates EJB3 bean discovery to the container so that it doesn't have to scan for EJB3 annotations or parse <literal>ejb-jar.xml</literal>. For each EJB in the application an EJBDescriptor should be discovered:
ja_jp: Web Beansはまた、EJB3のBeanの探索についてはコンテナへ委譲します。そのため、EJB3のアノテーションをスキャンする必要はありませんし、また<literal>ejb-jar.xml</literal>を解析する必要はありません。アプリケーションにおける各EJBに対して一つずつEJBDescriptorが発見される必要があります。

source: The <literal>EjbDescriptor</literal> is fairly self-explanatory, and should return the relevant metadata as defined in the EJB specification. In addition to these two interfaces, there is <literal>BusinessInterfaceDescriptor</literal> which represents a local business interface (encapsulating the interface class and jndi name used to look up an instance of the EJB).
de_de: Der <literal>EjbDescriptor</literal> ist recht leicht verständlich und sollte relevante Metadaten wie in der EJB-Spezifikation definiert wiedergeben. Neben diesen beiden Interfaces existiert ein <literal>BusinessInterfaceDescriptor</literal>, der ein lokales Business-Interface repräsentiert (die Interface-Klasse und den für die Suche einer Instanz des EJB verwendeten jndi-Namens enthaltend).
es_es: El <literal>EjbDescriptor</literal> es bastante auto explicativo y debería devolver los metadatos pertinentes como se define en la especificación de EJB. Además de estas dos interfaces, está <literal>BusinessInterfaceDescriptor</literal>, la cual representa una interfaz de negocios local (encapsulando la clase de interfaz y el nombre de jndi a la búsqueda de una instancia del EJB).
it_it: Il <literal>EjbDescriptor</literal> è abbastanza auto-esplicatorio e dovrebbe restituire i metadati rilevanti definiti nella specifica EJB. In aggiunta a queste due interfacce, vi è <literal>BusinessInterfaceDescriptor</literal> a rappresentare un'interfaccia locale di business (che incapsula la classe d'interfaccia ed il nome jndi usato per la ricerca di una istanza EJB).
ja_jp: <literal>EjbDescriptor</literal>は、ほとんど読んで字の通りですが、EJBの仕様で定義されている関連メタデータを返します。これらの二つのインタフェースに加えて、ローカルのビジネスインタフェース(インタフェースクラスとEJBのインスタンスをルックアップするために使用されるJNDI名をカプセル化したもの)を表す<literal>BusinessInterfaceDescriptor</literal>があります。
zh_cn: <literal>EjbDescriptor</literal> 具有相当的自解释性，应该返回EJB规范中定义的相关元数据。除了这两个接口，还有一个表示本地业务接口的 <literal>BusinessInterfaceDescriptor</literal> （封装了接口类和用于查询EJB实例的jndi名字）

source: The resolution of <literal>@EJB</literal> (for injection into simple beans), the resolution of local EJBs (for backing session beans) and remote EJBs (for injection as a Java EE resource) is delegated to the container. You must provide an implementation of <literal>org.jboss.webbeans.ejb.spi.EjbServices</literal> which provides these operations. For resolving the <literal>@EJB</literal> injection point, Web Beans will provide the <literal>InjectionPoint</literal>; for resolving local EJBs, the <literal>EjbDescriptor</literal> will be provided, and for remote EJBs the <literal>jndiName</literal>, <literal>mappedName</literal>, or <literal>ejbLink</literal> will be provided.
ja_jp: (シンプルBeansへのインジェションのための)<literal>@EJB</literal>、(背後のセッションBeanのための)ローカルEJB、そして(JavaEEリソースとしてのインジェクションのための)リモートEJBの解決はコンテナに委譲されます。あなたはこれらの操作を提供する<literal>org.jboss.webbeans.ejb.spi.EjbServices</literal>の実装を提供する必要があります。<literal>@EJB</literal>インジェクションポイントを解決するために、Web Beansは<literal>InjectionPoint</literal>を提供するでしょう。ローカルEJBの解決のために、<literal>EjbDescriptor</literal>が提供されるでしょう。そしてリモートEJBのために<literal>jndiName</literal>、<literal>jndiName</literal>、 <literal>ejbLink</literal>が提供されるでしょう。

source: When resolving local EJBs (used to back session beans) a wrapper (<literal>SessionObjectReference</literal>) around the EJB reference is returned. This wrapper allows Web Beans to request a reference that implements the given business interface, and, in the case of SFSBs, request the removal of the EJB from the container.
ja_jp: (よくセッションBeanを背後とする)ローカルEJBを解決するとき、EJB参照を囲んだラッパー(<literal>SessionObjectReference</literal>)を返します。このラッパーのおかげで、Web Beansは特定のビジネスインタフェースを実装する参照を要求することができます。SFSBの場合は、コンテナからEJBの削除を要求することができます。

source: JPA services
it_it: Servizi JPA
ja_jp: JPAサービス

source: Just as EJB resolution is delegated to the container, resolution of <literal>@PersistenceContext</literal> for injection into simple beans (with the <literal>InjectionPoint</literal> provided), and resolution of persistence contexts and persistence units (with the <literal>unitName</literal> provided) for injection as a Java EE resource is delegated to the container.
ja_jp: ちょうどEJBの解決がコンテナに委譲されるように、(<literal>InjectionPoint</literal>が与えられた)シンプルBeansへのインジェクションのための<literal>@PersistenceContext</literal>の解決、およびJava EEリソースとしてのインジェクションのための、永続コンテキストと(<literal>unitName</literal>が与えられた)永続ユニットの解決はコンテナに委譲されます。

source: To allow JPA integration, the <literal>JpaServices</literal> interface should be implemented.
ja_jp: JPAとの統合を可能にするためには、<literal>JpaServices</literal>インタフェースが実装される必要があります。

source: Web Beans also needs to know what entities are in a deployment (so that they aren't managed by Web Beans). An implementation that detects entities through <literal>@Entity</literal> and <literal>orm.xml</literal> is provided by default. If you want to provide support for a entities defined by a JPA provider (such as Hibernate's <literal>.hbm.xml</literal> you can wrap or replace the default implementation.
ja_jp: またWeb Beansは、どんなエンティティがデプロイされているか知る必要があります(それらがWeb Beansによって管理されないようにです)。デフォルトでは、<literal>@Entity</literal>と<literal>orm.xml</literal>を通してエンティティを検出する実装が提供されます。もし、(Hibernateの<literal>.hbm.xml</literal>のような)JPAプロバイダによって定義されるEntityをサポートしたい場合は、デフォルトの実装をラップ、または置き換えることができます。

source: Transaction Services
it_it: Servizi di transazione
ja_jp: トランザクションサービス
zh_cn: 事务服务

source: Web Beans must delegate JTA activities to the container. The SPI provides a couple hooks to easily achieve this with the <literal>TransactionServices</literal> interface.
ja_jp: Web BeansはJTAの活動をコンテナへ委譲する必要があります。SPIはこれを容易に実現するために、<literal>TransactionServices</literal>インタフェースで数カ所のフックを提供します。

source: The enumeration <literal>Status</literal> is a convenience for implementors to be able to keep track of whether a synchronization is supposed to notify an observer only when the transaction is successful, or after a failure, or regardless of the status of the transaction.
it_it: La enumeration <literal>Status</literal> serve agli implementatori per poter essere in grado di tracciare se una sincronizzazione deve notificare un osservatore solo quando la transazione ha avuto successo, o dopo un errore, o indipendentemente dallo stato della transazione.
ja_jp: 列挙型の<literal>Status</literal>は、トランザクションが成功した、失敗した、またはトランザクションの状態にかかわらず、同期がオブザーバに通知すべきかどうかを追跡することが可能な実装にとって便利です。
zh_cn: 枚举 <literal>Status</literal> 对实现者来说是一个很方便的工具，可以追踪在事务成功或者失败或者无论事务成功还是失败的情况下，是否应该将一个同步通知给观察者。

source: Any <literal>javax.transaction.Synchronization</literal> implementation may be passed to the <literal>registerSynchronization()</literal> method and the SPI implementation should immediately register the synchronization with the JTA transaction manager used for the EJBs.
it_it: Qualsiasi implementazione di <literal>javax.transaction.Synchronization</literal> può essere passata al metodo <literal>registerSynchronization()</literal> e l'implementazione SPI deve immediatamente registrare la sincronizzazione con il gestore della transazione JTA usato per EJB.
ja_jp: どのような<literal>javax.transaction.Synchronization</literal>の実装も、<literal>registerSynchronization()</literal>メソッドに渡されるかもしれません。そしてSPIの実装は、EJBに使用されるJTAトランザクションマネージャとの同期をすぐに登録すべきです。
zh_cn: 任何 <literal>javax.transaction.Synchronization</literal> 实现必须传递给 <literal>registerSynchronization()</literal> 方法，SPI实现应该立刻将同步注册到EJB使用的JTA事务管理器。

source: To make it easier to determine whether or not a transaction is currently active for the requesting thread, the <literal>isTransactionActive()</literal> method can be used. The SPI implementation should query the same JTA transaction manager used for the EJBs.
it_it: Per facilitare la determinazione se o no una transazione è attualmente attiva per il thread di richiesta, può essere usato il metodo <literal>isTransactionActive()</literal>. L'implementazione SPI deve interrogare lo stesso gestore della transazione JTA usato per EJB.
ja_jp: 要求スレッドでトランザクションが現在アクティブであるかどうか確認しやすくするために、<literal>isTransactionActive()</literal>メソッドが使用されます。SPIの実装は、EJBで使用される同じJTAトランザクションマネージャに問い合わせを行うべきです。
zh_cn: 为了更容易的决定对于请求线程来说一个事务在当前是否是活动的，我们可以使用<literal>isTransactionActive()</literal> 方法。SPI实现应该查询EJB使用的同一个JTA事务管理器。

source: JMS services
ja_jp: JMSサービス

source: A number of JMS operations are not container specific, and so should be provided via the SPI <literal>JmsServices</literal>. JMS does not specify how to obtain a <literal>ConnectionFactory</literal> so the SPI provides a method which should be used to look up a factory. Web Beans also delegates <literal>Destination</literal> lookup to the container via the SPI.
ja_jp: 多くのJMS操作はコンテナ特有ではないため、SPI <literal>JmsServices</literal>を通して提供されるべきです。JMSは<literal>ConnectionFactory</literal>を取得する方法を指定しないため、SPIはファクトリをルックアップために使用されるメソッドを提供します。また、Web BeansはSPIを通して<literal>Destination</literal>のルックアップをコンテナへ委譲します。

source: Resource Services
ja_jp: リソースサービス

source: The resolution of <literal>@Resource</literal> (for injection into simple beans) and the resolution of resources (for injection as a Java EE resource) is delegated to the container. You must provide an implementation of <literal>ResourceServices</literal> which provides these operations. For resolving the <literal>@Resource</literal> injection, Web Beans will provide the <literal>InjectionPoint</literal>; and for Java EE resources, the <literal>jndiName</literal> or <literal>mappedName</literal> will be provided.
ja_jp: (シンプルBeansへのインジェクションのための)<literal>@Resource</literal>の解決と、(Java EEリソースとしてのインジェションのための)リソースの解決はコンテナに委譲されます。あなたはこれらの操作を提供する<literal>ResourceServices</literal>の実装を提供する必要があります。<literal>@Resource</literal>によるインジェクションを解決するために、Web Beansは<literal>InjectionPoint</literal>を提供するでしょう。そしてJavaEEリソースのために、<literal>jndiName</literal>または<literal>mappedName</literal>が提供されるでしょう。

source: Web Services
ja_jp: Webサービス

source: The resolution of web service references (for injection as a Java EE resource) is delegated to the container. You must provide an implementation of <literal>WebServices</literal> whichprovides this operation. For resolving the Java EE resource, the <literal>jndiName</literal> or <literal>mappedName</literal> will be provided.
ja_jp: (Java EEリソースとしてのインジェクションの)Webサービスの参照の解決は、コンテナに委譲されます。あなたはこの操作を提供する<literal>WebServices</literal>の実装を提供する必要があります。Java EEリソースの解決のために、<literal>jndiName</literal>または<literal>mappedName</literal>が提供されるでしょう。

source: The bean store
ja_jp: Beanストア

source: Web Beans uses a map like structure to store bean instances - <literal>org.jboss.webbeans.context.api.BeanStore</literal>. You may find <literal>org.jboss.webbeans.context.api.helpers.ConcurrentHashMapBeanStore</literal> useful.
ja_jp: Web Beansは、Beanインスタンスを保存するために構成されたものとしてあるMap - <literal>org.jboss.webbeans.context.api.BeanStore</literal>を使用します。<literal>org.jboss.webbeans.context.api.helpers.ConcurrentHashMapBeanStore</literal>が役に立つことがわかるでしょう。

source: The application context
de_de: Der Applikationskontext
it_it: Il contesto applicazione
ja_jp: アプリケーションコンテキスト
zh_cn: 应用上下文

source: Web Beans expects the Application Server or other container to provide the storage for each application's context. The <literal>org.jboss.webbeans.context.api.BeanStore</literal> should be implemented to provide an application scoped storage.
ja_jp: Web Beansは、アプリケーションサーバーかその他のコンテナが、アプリケーションコンテキストのための保存領域を提供することを想定しています。<literal>org.jboss.webbeans.context.api.BeanStore</literal>は、アプリケーションスコープの保存領域を提供するように実装される必要があります。

source: Bootstrap and shutdown
de_de: Bootstrap und Shutdown
it_it: Bootstrap e spegnimento
ja_jp: ブートストラップとシャットダウン
zh_cn: 自举和停止

source: The <literal>org.jboss.webbeans.bootstrap.api.Bootstrap</literal> interface defines the bootstrap for Web Beans. To boot Web Beans, you must obtain an instance of <literal>org.jboss.webbeans.bootstrap.WebBeansBootstrap</literal> (which implements <literal>Boostrap</literal>), tell it about the SPIs in use, and then request the container start.
de_de: Das <literal>org.jboss.webbeans.bootstrap.api.Bootstrap</literal>-Interface definiert den Bootstrap für Web Beans. Um Web Beans zu booten müssen Sie eine Instanz von <literal>org.jboss.webbeans.bootstrap.WebBeansBootstrap</literal> erhalten (die <literal>Boostrap</literal> implementiert), diese über die verwendeten SPIs informieren und dann beim Container um Start anfragen.
it_it: L'interfaccia <literal>org.jboss.webbeans.bootstrap.api.Bootstrap</literal> definisce il bootstrap per Web Beans. Per avviare Web Beans occorre ottenere un'istanza di <literal>org.jboss.webbeans.bootstrap.WebBeansBootstrap</literal> (che implementa <literal>Boostrap</literal>), e comunicare le SPI in uso, e poi chiedere che il container venga avviato.
ja_jp: <literal>org.jboss.webbeans.bootstrap.api.Bootstrap</literal>インタフェースはWeb Beansのブートストラップを定義します。Web Beansを起動するために、(<literal>Boostrap</literal>を実装した)<literal>org.jboss.webbeans.bootstrap.api.Bootstrap</literal>インスタンスを取得し、使用中のSPIに伝え、コンテナに起動を要求する必要があります。
zh_cn: <literal>org.jboss.webbeans.bootstrap.api.Bootstrap</literal> 接口定义了Web Bean的自举机制。为了启动Web Beans，你必须获得一个<literal>org.jboss.webbeans.bootstrap.WebBeansBootstrap</literal> 实例（它实现了<literal>Boostrap</literal>） ，告诉它使用的SPI，然后请求容器启动。

source: The bootstrap is split into phases, bootstrap initialization and boot and shutdown. Initialization will create a manager, and add the standard (specification defined) contexts. Bootstrap will discover EJBs, classes and XML; add beans defined using annotations; add beans defined using XML; and validate all beans.
it_it: Il bootstrap è suddiviso in più fasi, inizializzazione del bootstrap, bootstrap e shutdown. L'inizializzazione creerà un manager, e aggiungerà i contesti standard (definiti dalla specifica). Bootstrap scoprirà EJB, classi e XML; aggiungerà i bean definiti con le annotazioni; aggiungerà i bean definiti con XML; e validerà tutti i bean.
ja_jp: ブートストラップは、初期化と起動とシャットダウンのフェーズに分かれます。初期化はマネージャを生成し、標準の(仕様で定義された)コンテキストを追加するでしょう。ブートストラップはEJB、クラスおよびXMLを探索します。アノテーションにより定義されたBeansを追加します。また、XMLで定義されたBeansを追加します。そして、すべてのBeansの妥当性確認を行います。

source: The bootstrap supports multiple environments. An environment is defined by an implementation of the <literal>Environment</literal> interface. A number of standard envrionments are built in as the enumeration <literal>Environments</literal>. Different environments require different services to be present (for example servlet doesn't require transaction, EJB or JPA services). By default an EE environment is assumed, but you can adjust the environment by calling <literal>bootstrap.setEnvironment()</literal>.
ja_jp: ブートストラップは複数の環境をサポートします。環境は<literal>Environment</literal>インタフェースの実装によって定義されます。多くの標準環境が<literal>Environments</literal>列挙で組み込まれています。環境によっては異なるサービスを要求します(たとえば、サーブレットはトランザクション、EJBまたはJPAサービスを必須としません)。デフォルトではEE環境が想定されますが、<literal>bootstrap.setEnvironment()</literal>を呼ぶことで環境を設定できます。

source: Web Beans uses a generic-typed service registry to allow services to be registered. All services implement the <literal>Service</literal> interface. The service registry allows services to be added and retrieved.
ja_jp: Web Beansは、サービスの登録のために総称型のサービスレジストリを使用します。すべてのサービスが<literal>Service</literal>インタフェースを実装します。サービスレジストリは、サービスが追加されて、検索されることを可能とします。

source: To initialize the bootstrap you call <literal>Bootstrap.initialize()</literal>. Before calling <literal>initialize()</literal>, you must register any services required by your environment. You can do this by calling <literal>bootstrap.getServices().add(JpaServices.class, new MyJpaServices())</literal>. You must also provide the application context bean store.
it_it: Per inizializzare il bootstrap si chiama <literal>Bootstrap.initialize()</literal>. Prima della chiamata di <literal>initialize()</literal> occorre registrare i servizi richiesti dal proprio ambiente. Si può fare questo chiamando <literal>bootstrap.getServices().add(JpaServices.class, new MyJpaServices())</literal>. Occorre anche fornire l'application context bean store.
ja_jp: ブートストラップの初期化のためには<literal>Bootstrap.initialize()</literal>を呼びます。<literal>initialize()</literal>を呼び出す前に、その環境で必要となるサービスを登録する必要があります。これは、<literal>bootstrap.getServices().add(JpaServices.class, new MyJpaServices())</literal>を呼び出すことで可能です。また、アプリケーションコンテキストのBeanストアを提供する必要があります。

source: Having called <literal>initialize()</literal>, the <literal>Manager</literal> can be obtained by calling <literal>Bootstrap.getManager()</literal>.
de_de: Nach Aufruf von <literal>initialize()</literal> erhalten Sie den <literal>Manager</literal> durch Aufruf von <literal>Bootstrap.getManager()</literal>.
it_it: Dopo aver chiamato <literal>initialize()</literal>, il <literal>Manager</literal> può essere ottenuto chiamando <literal>Bootstrap.getManager()</literal>.
ja_jp: <literal>initialize()</literal>が呼び出されると、<literal>Manager</literal>は<literal>Bootstrap.getManager()</literal>を呼ぶことで得ることができます。
zh_cn: 调用<literal>initialize()</literal>后，我们能够通过<literal>Bootstrap.getManager()</literal>来获得<literal>管理器</literal>。

source: To boot the container you call <literal>Bootstrap.boot()</literal>.
it_it: Per avviare il container chiamare <literal>Bootstrap.boot()</literal>.
ja_jp: コンテナをブートするためには<literal>Bootstrap.boot()</literal>を呼びます。

source: To shutdown the container you call <literal>Bootstrap.shutdown()</literal> or <literal>webBeansManager.shutdown()</literal>. This allows the container to perform any cleanup operations needed.
ja_jp: コンテナをシャットダウンするためには<literal>Bootstrap.shutdown()</literal>、または<literal>webBeansManager.shutdown()</literal>を呼びます。これで、コンテナは必要なクリーンアップ操作を実行できます。

source: Web Beans delegates all JNDI operations to the container through the SPI.
ja_jp: Web Beansは全てのJNDI操作をSPIを通じてコンテナに委譲します。

source: A number of the SPI interface require JNDI lookup, and the class <literal>AbstractResourceServices</literal> provides JNDI/Java EE spec compliant lookup methods.
ja_jp: 多くのSPIインタフェースがJNDIルックアップを必要とします。そして<literal>AbstractResourceServices</literal>クラスは、JNDI/Java EE仕様に準拠したルックアップメソッドを提供します。

source: Resource loading
de_de: Laden von Ressourcen
es_es: Carga de recurso
it_it: Caricamento risorse
ja_jp: リソースのロード
ko_kr: 리소스 불러오기
zh_cn: 资源加载

source: Web Beans needs to load classes and resources from the classpath at various times. By default, they are loaded from the Thread Context ClassLoader if available, if not the same classloader that was used to load Web Beans, however this may not be correct for some environments. If this is case, you can implement <literal>org.jboss.webbeans.spi.ResourceLoader</literal>:
ja_jp: Web Beansは様々なタイミングでクラスパスからクラスとリソースをロードする必要があります。デフォルトでは、可能であればスレッドコンテキストクラスローダからロードします。しかしながら、もしWeb Beansのロードに使用されたクラスローダと異なる場合は、ある環境ではこれは正しくないかもしれません。もしそうであれば、<literal>org.jboss.webbeans.spi.ResourceLoader</literal>を実装することができます。

source: Servlet injection
it_it: Iniezione dei servlet
ja_jp: サーブレットインジェクション
zh_cn: Servlet 注入

source: Java EE / Servlet does not provide any hooks which can be used to provide injection into Servlets, so Web Beans provides an API to allow the container to request JSR-299 injection for a Servlet.
it_it: Java EE / Servlet non fornisce alcun hook da usare per fornire l'iniezione nei Servlet, quindi Web Beans fornisce un'API per consentire al container di richiedere l'iniezione JSR-299 per un Servlet.
ja_jp: Java EE/サーブレットはインジェクションをサーブレットに提供するためのフックを提供していません。そのためWeb Beansは、コンテナがサーブレットでJSR-299のインジェクションを要求できるように、APIを提供します。
zh_cn: Java EE/Servlet并不没有提供任何钩子来支持向Servlet注入，所以Web Bean提供了一个接口来允许容器为一个Servlet请求JSR-299的注入。

source: To be compliant with JSR-299, the container should request servlet injection for each newly instantiated servlet after the constructor returns and before the servlet is placed into service.
it_it: Per soddisfare la JSR-299 il container deve richiedere l'iniezione servlet per ogni nuovo servlet istanziato dopo che il costruttore ritorni e prima che il servlet sia messo in servizio.
ja_jp: JSR-299に準拠するために、コンストラクタが呼び出されサーブレットがサービスを開始する前に、コンテナは、新たにインスタンス化されたサーブレットのためにインジェクションを要求するべきです。
zh_cn: 为了和JSR-299兼容，容器应该在构造器返回之后，在Servlet被放到服务中之前，为每个新实例化的Servlet请求Servlet注入。

source: To perform injection on a servlet call <literal>WebBeansManager.injectServlet()</literal>. The manager can be obtained from <literal>Bootstrap.getManager()</literal>.
it_it: Per eseguire l'iniezione su un servlet si chiami <literal>WebBeansManager.injectServlet()</literal>. Il manager può essere ottenuto da <literal>Bootstrap.getManager()</literal>.
ja_jp: サーブレットにインジェクションを実行するには、<literal>WebBeansManager.injectServlet()</literal>を呼び出します。マネージャは<literal>Bootstrap.getManager()</literal>から取得することができます。
zh_cn: 执行Servlet注入时需要调用 <literal>WebBeansManager.injectServlet()</literal>。你可以通过 <literal>Bootstrap.getManager()</literal>来获得管理器。

source: The contract with the container
de_de: Der Vertrag mit dem Container
es_es: El contrato con el contenedor
it_it: Il contratto con il container
ja_jp: コンテナとの契約
ko_kr: 컨테이너와 계약
zh_cn: 容器的合约
