Repository: 1tchy/core
Catalog: reference/*/ri-spi.po
Languages: de_de, es_es, it_it, ja_jp, ko_kr, zh_cn

source: The Web Beans RI needs to load classes and resources from the classpath at various times. By default, they are loaded from the same classloader that was used to load the RI, however this may not be correct for some environments. If this is case, you can implement <literal>org.jboss.webbeans.spi.ResourceLoader</literal>:
de_de: Die Web Beans RI muss Klassen und Ressourcen zu verschiedenen Zeiten aus dem Klasspfad laden. Standardmäßig werden diese aus demselben Klasslader geladen, der zum laden der RI verwendet wurde, allerdings ist das möglicherweise nicht geeignet für einige Umgebungen. Ist dies der Fall, so können Sie <literal>org.jboss.webbeans.spi.ResourceLoader</literal> implementieren:
es_es: La IR de Web Beans necesita cargar clases y recursos desde el classpath en varios momentos. Por defecto, se cargan desde el mismo classloader utilizado para cargar la IR, sin embargo, puede no ser lo apropiado para algunos entornos. Si este es el caso, implemente <literal>org.jboss.webbeans.spi.ResourceLoader</literal>:
it_it: Web Beans RI deve caricare le classi e le risorse dal classpath in vari momenti. Di default vengono caricati dallo stesso classloader usato per caricare RI, comunque questo potrebbe non essere corretto in alcuni ambienti. Se è questo il caso si può implementare <literal>org.jboss.webbeans.spi.ResourceLoader</literal>:
ko_kr: Web Beans RI는 여러번 classpath에서 클래스 및 리소스를 불러와야 합니다. 기본값으로 RI를 불러오기 위해 사용되었던 동일한 classloader에서 로딩되지만, 일부 환경에서는 작동하지 않을 수 도 있습니다. 이러한 경우, <literal>org.jboss.webbeans.spi.ResourceLoader</literal>를 구현할 수 있습니다:
zh_cn: Web Beans参考实现需要在不同时间从类路径上加载类和资源。默认情况下，它们使用加载参考实现的类加载器加载，但是这在一些环境中可能是不适合的。如果出现这种情况的话，你可以实现<literal>org.jboss.webbeans.spi.ResourceLoader</literal> ：

source: Servlet listener and filters
it_it: Servlet listener e filtri
zh_cn: Servlet监听器和过滤器

source: The Web Beans SPI is located in <literal>webbeans-ri-spi</literal> module, and packaged as <literal>webbeans-ri-spi.jar</literal>. Some SPIs are optional, if you need to override the default behavior, others are required.
de_de: Das Web Beans SPI befindet sich im <literal>webbeans-ri-spi</literal>-Modul und ist als <literal>webbeans-ri-spi.jar</literal> verpackt. Einige SPIs sind optional, wenn Sie das standardmäßige Verhalten außer Kraft setzen möchten, sind andere erforderlich.
es_es: El SPI de Web Beans está ubicado en el módulo <literal>webbeans-ri-spi</literal>, empaquetado como <literal>webbeans-ri-spi.jar</literal>. Algunos SPI son opcionales, si necesita anular la conducta predeterminada, se requerirán otros.
ko_kr: Web Beans SPI는 <literal>webbeans-ri-spi</literal> 모듈에 위치하고 있으며 <literal>webbeans-ri-spi.jar</literal>로 패키징되어 있습니다. 일부 SPI는 옵션 사항이며, 기본값 동작을 덮어쓰기해야할 경우, 다른 사항이 필요합니다.
zh_cn: Web Bean的SPI位于<literal>webbeans-ri-spi</literal>模块中，打包为<literal>webbeans-ri-spi.jar</literal>。一些SPI是可选的，如果你需要覆盖默认行为，你需要其他的SPI。

source: EJB Discovery
zh_cn: EJB发现

source: <literal>@EJB</literal>, <literal>@PersistenceContext</literal> and <literal>@Resource</literal> resolution
de_de: <literal>@EJB</literal>, <literal>@PersistenceContext</literal> und <literal>@Resource</literal> Auflösung
zh_cn: <literal>@EJB</literal>, <literal>@PersistenceContext</literal> 和 <literal>@Resource</literal> 的解析

source: The resolution of <literal>@EJB</literal>, <literal>@PersistenceContext</literal> and <literal>@Resource</literal> is delegated to the container. You must provide an implementation of <literal>org.jboss.webbeans.ejb.spi.EjbResolver</literal> which provides these operations. Web Beans passes in the <literal>javax.inject.manager.InjectionPoint</literal> the resolution is for, as well as the <literal>NamingContext</literal> in use for each resolution request.
de_de: Die Auflösung von <literal>@EJB</literal>, <literal>@PersistenceContext</literal> und <literal>@Resource</literal> wird an den Container delegiert. Sie müssen eine Implemntierung von <literal>org.jboss.webbeans.ejb.spi.EjbResolver</literal> bereitstellen, die diese Operationen liefert. Web Beans gibt an den <literal>javax.inject.manager.InjectionPoint</literal> weiter für den die Auflösung ist sowie den für jede Auflösungsanfrage verwendeten <literal>NamingContext</literal>.
zh_cn: <literal>@EJB</literal>, <literal>@PersistenceContext</literal> 和 <literal>@Resource</literal> 的解析被委托给容器。你必须提供一个 <literal>org.jboss.webbeans.ejb.spi.EjbResolver</literal> 实现来完成这些工作。每次解析请求到来时，Web Beans都将 <literal>javax.inject.manager.InjectionPoint</literal> 以及 <literal>NamingContext</literal> 传递进来以便解析。

source: The bootstrap is split into phases, bootstrap initialization and bootstrap. Initialization will create a manager, and add the standard (specification defined) contexts. Bootstrap will discover EJBs, classes and XML; add beans defined using annotations; add beans defined using XML; and validate all beans.
de_de: Der Bootstrap ist in Phasen aufgeteilt, Bootstrap Initialisierung und Bootstrap. Die Initialisierung erstellt einen Manager und fügt die Standard-Kontexte (spezifikationsdefiniert) hinzu. Bootstrap findet EJBs, Klassen und XML auf; fügt unter Verwendung von Annotationen definierte Beans hinzu; fügt unter Verwendung von XML definierte Beans hinzu; und validiert alle Beans.
zh_cn: 自举可以划分为阶段，自举初始化和自举。初始化将创建一个管理器，添加标准（规范定义的）的上下文。自举将发现EJB，类和XML；添加注释定义的Bean；添加XML定义的Bean；和验证所有的Bean。

source: To initialize the bootstrap you call <literal>Bootstrap.initialize()</literal>. Before calling <literal>initialize()</literal> you must have called <literal>Bootstrap.setEjbResolver()</literal>. If you are not using the built in <literal>DefaultNamingContext</literal> or the built in <literal>DefaultResourceLoader</literal> you must set these before calling <literal>initialize()</literal>.
de_de: Zur Initialisierung des Bootstrap rufen Sie <literal>Bootstrap.initialize()</literal> auf. Ehe Sie <literal>initialize()</literal> aufrufen, müssen Sie <literal>Bootstrap.setEjbResolver()</literal> aufgerufen haben. Falls Sie nicht den eingebauten <literal>DefaultNamingContext</literal> oder den eingebauten <literal>DefaultResourceLoader</literal> verwenden, so müssen Sie diese setzen, ehe Sie <literal>initialize()</literal> aufrufen.
zh_cn: 为了初始化自举，你需要调用 <literal>Bootstrap.initialize()</literal> 。在调用 <literal>initialize()</literal> 之前你必须调用 <literal>Bootstrap.setEjbResolver()</literal> 。如果你没有使用内置的<literal>DefaultNamingContext</literal>或者<literal>DefaultResourceLoader</literal>，你必须在调用<literal>initialize()</literal>之前设置它们。

source: To boot the container you call <literal>Bootstrap.boot()</literal>. Before calling <literal>boot()</literal> you must have called <literal>Bootstrap.setWebBeanDiscovery()</literal>, <literal>Bootstrap.setEjbDiscovery()</literal> and <literal>Bootstrap.setApplicationContext()</literal>.
de_de: Zum Booten des Containers rufen Sie <literal>Bootstrap.boot()</literal> auf. Ehe Sie <literal>boot()</literal> aufrufen, müssen Sie <literal>Bootstrap.setWebBeanDiscovery()</literal>, <literal>Bootstrap.setEjbDiscovery()</literal> und <literal>Bootstrap.setApplicationContext()</literal> aufgerufen haben.
zh_cn: 启动容器你需要调用 <literal>Bootstrap.boot()</literal> 。在调用<literal>boot()</literal>之前，你必须调用<literal>Bootstrap.setWebBeanDiscovery()</literal>, <literal>Bootstrap.setEjbDiscovery()</literal> 和 <literal>Bootstrap.setApplicationContext()</literal>。

source: The <literal>webbeans-ri.jar</literal>
de_de: Die <literal>webbeans-ri.jar</literal>
es_es: El <literal>webbeans-ri.jar</literal>
ko_kr: <literal>webbeans-ri.jar</literal>
zh_cn: <literal>webbeans-ri.jar</literal>

source: If you are integrating the Web Beans into an environment that supports deployment of applications, you must insert the <literal>webbeans-ri.jar</literal> into the applications isolated classloader. It cannot be loaded from a shared classloader.
de_de: Falls Sie Web Beans in eine Umgebung integrieren, die das Deployment von Anwendungen unterstützt, so müssen Sie die <literal>webbeans-ri.jar</literal> in den isolierten Klassenlader der Anwendungen einfügen. Das Laden kann nicht aus einem geteilten Klassenlader erfolgen.
es_es: Si está integrando el Web Beans dentro de un entorno que admite despliegue de aplicaciones, debe insertar el <literal>webbeans-ri.jar</literal> dentro de las aplicaciones del classloader aislado. No se puede cargar desde el classloader compartido.
ko_kr: Web Beans를 애플리케이션 운용을 지원하는 환경으로 통합하고자 할 경우, <literal>webbeans-ri.jar</literal>를 애플리케이션 분리 classloader로 삽입해야 합니다. 이는 공유 classloader에서 불러올 수 없습니다.
zh_cn: 如果你将Web Bean整合到一个支持应用部署的环境中，你必须将<literal>webbeans-ri.jar</literal> 插入到应用隔离的类加载器中。它不能被一个共享的类加载器加载。

source: You can specify the implementation of an SPI either as a system property, or in a properties file <literal>META-INF/web-beans-ri.properties</literal>. All property names are the fully qualified class name of the implemented interface; all property values are the fully qualified class name of the implementation class.
es_es: Se puede especificar la implementación de un SPI ya sea como una propiedad del sistema, o en un archivo de propiedades <literal>META-INF/web-beans-ri.properties</literal>. Todos los nombres de propiedad son el nombre completo de clase de la interfaz implementada; todos los valores de propiedad son el nombre completo de clase calificado de la clase de implementación.
ko_kr: SPI 구현을 시스템 속성으로나 또는 속성 파일 <literal>META-INF/web-beans-ri.properties</literal>로 지정할 수 있습니다. 모든 속성 이름은 구현된 인터페이스의 완전 정규화된 클래스 이름입니다; 모드 속성 값은 구현 클래스의 완전 정규화된 클래스 이름입니다.

source: The Web Beans RI can be told to load your implementation of <literal>WebBeanDiscovery</literal> using the property <literal>org.jboss.webbeans.bootstrap.spi.WebBeanDiscovery</literal> with the fully qualified class name as the value. For example:
es_es: Se le puede pedir a la IR de Web Beans cargar la implementación de <literal>WebBeanDiscovery</literal> mediante la propiedad <literal>org.jboss.webbeans.bootstrap.WebBeanDiscovery</literal> con el nombre completo de la clase calificada como el valor. Por ejemplo:

source: If the Web Beans RI is being used in a servlet container, it expects a constructor of the form:
es_es: Si la IR de Web Beans se utiliza en un contenedor de Servlet, se espera un constructor de la forma:

source: The servlet context can be used to allow your implementation of <literal>WebBeanDiscovery</literal> to interact with the container.
es_es: El contexto de servlet se puede utilizar para permitir que la implementación de <literal>WebBeanDiscovery</literal> interactúe con el contenedor.

source: The Web Beans RI can be told to load your implementation of <literal>EjbDiscovery</literal> using the property <literal>org.jboss.webbeans.bootstrap.spi.EjbDiscovery</literal> with the fully qualified class name as the value. For example:
es_es: Se le puede pedir a la IR de Web Beans cargar la implementación de <literal>EjbDiscovery</literal> mediante la propiedad <literal>org.jboss.webbeans.bootstrap.spi.EjbDiscovery</literal> con el nombre completo de la clase calificada como el valor. Por ejemplo:

source: The servlet context can be used to allow your implementation of <literal>EjbDiscovery</literal> to interact with the container.
es_es: El contexto de Servlet se puede utilizar para permitir que la implementación de <literal>EjbDiscovery</literal> interactúe con el contenedor.

source: The Web Beans RI implements JNDI binding and lookup according to standards, however you may want to alter the binding and lookup (for example in an environment where JNDI isn't available). To do this, implement <literal>org.jboss.webbeans.spi.resources.NamingContext</literal>:
es_es: La IR de Web Beans implementa el enlace JNDI y la búsqueda según los estándares, sin embargo si desea puede alterar el enlace y la búsqueda (Por ejemplo en un entorno donde JNDI no está disponible). Para este fin, implemente <literal>org.jboss.webbeans.spi.resources.NamingContext</literal>:

source: and tell the RI to use it:
es_es: y le pide a la IR que lo utilice:
ko_kr: RI에게 사용할 것을 알립니다:

source: The servlet context can be used to allow your implementation of <literal>NamingContext</literal> to interact with the container.
es_es: El contexto de Servlet se puede utilizar para permitir que la implementación de <literal>NamingContext</literal> interactúe con el contenedor.

source: The servlet context can be used to allow your implementation of <literal>ResourceLoader</literal> to interact with the container.
es_es: El contexto de Servlet puede utilizarse para permitir que la implementación de <literal>ResourceLoader</literal> interactúe con el contenedor.

source: Servlet listener
es_es: Oyente de Servlet
ko_kr: Servlet 청취자

source: The contract described the JavaDoc is enough to implement an EJBDescriptor. In addition to these two interfaces, there is <literal>BusinessInterfaceDescriptor</literal> which represents a local business interface (encapsulating the interface class and jndi name).
ko_kr: JavaDoc을 설명하는 계약은 EJBDescriptor를 충분히 구현합니다. 이러한 두 가지 인터페이스에 더하여, 로컬 비지니스 인터페이스를 나타내는 <literal>BusinessInterfaceDescriptor</literal>가 있습니다. (인터페이스 클래스 및 jndi 이름을 캡슐화)

source: The Web Beans RI can be told to load your implementation of <literal>WebBeanDiscovery</literal> using the property <literal>org.jboss.webbeans.bootstrap.WebBeanDiscovery</literal> with the fully qualified class name as the value. For example:
ko_kr: Web Beans RI는 완전 정규화된 클래스 이름 값과 함께 <literal>org.jboss.webbeans.bootstrap.WebBeanDiscovery</literal> 속성을 사용하여 <literal>WebBeanDiscovery</literal> 구현을 불러오기하게 할 수 있습니다. 예:

source: The Web Beans RI implements JNDI binding and lookup according to standards, however you may want to alter the binding and lookup (for example in an environment where JNDI isn't available). To do this, implement <literal>org.jboss.webbeans.spi.resources.Naming</literal>:
ko_kr: Web Beans RI는 기준에 따라 JNDI 바인딩 및 lookup을 구현하지만, 바인딩 및 lookup을 변경하고자 하실 수 있습니다 (예를 들어 JNDI를 사용할 수 없는 환경에서). 이를 위해 <literal>org.jboss.webbeans.spi.resources.Naming</literal>을 구현합니다:
