Repository: 1tchy/core
Catalog: reference/*/ri-spi.po
Languages: de_de, es_es, it_it, ja_jp, ko_kr, zh_cn

source: There are a number of requirements that the Web Beans RI places on the container for correct functioning that fall outside implementation of APIs
de_de: Es gibt eine Reihe von Voraussetzungen, die Web Beans RI dem Container für das korrekte Funktionieren von Implementierungen auferlegen, die außerhalb von Implementierung von APIs fallen.
es_es: Hay una serie de requisitos que la IR de Web Beans ubica en el contenedor para el funcionamiento correcto que está fuera de la implementación de las API.
it_it: Per il corretto funzionamento al di fuori dell'implementazione delle API, ci sono un numero di requisiti che Web Beans RI pone nel container.
ja_jp: Web Beans RIは、APIの実装からは外れますが正しく機能するために、コンテナ上に配置するにあたって多くの要件があります。
ko_kr: API의 외부 구현에서의 올바른 기능을 실행하게 하기 위해 Web Beans RI이 컨테이너에 위치하게 해야 할 여러 요구 사항이 있습니다
zh_cn: 为了接口实现之外的正确的功能，Web Beans参考实现对容器有大量的要求。

source: Classloader isolation
de_de: Klassenlader-Isolierung
es_es: Aislamiento de classloader
it_it: Isolamento del classloader
ja_jp: クラスローダの分離
ko_kr: Classloader 분리
zh_cn: 类加载器隔离

source: If you are integrating the Web Beans RI into an environment that supports deployment of multiple applications, you must enable, automatically, or through user configuation, classloader isolation for each Web Beans application.
de_de: Falls Sie die Web Beans RI in eine Umgebung integrieren, die das Deployment mehrerer Anwendungen unterstützt, so müssen Sie automatisch oder über Benutzerkonfiguration die Klassenlader-Isolierung für jede Web Beans Anwendung aktivieren.
es_es: Si se está integrando la IR de Web Beans dentro de un entorno que admite despliegue de varias aplicaciones, debe habilitar el aislamiento de classloader para cada aplicación de Web Beans, de forma automática o a través de la configuración del usuario.
it_it: Se si integra Web Beans in un ambiente che supporta il deploy di applicazioni, occorre abilitare, automaticamente o attraverso la configurazione utente, l'isolamento del classloader per ogni applicazione Web Beans.
ja_jp: Web Beans RIを複数のアプリケーションのデプロイをサポートする環境に統合しているなら、それぞれのWeb Beansアプリケーションのクラスローダの分離を、自動的またはユーザによる設定によって有効とする必要があります。
ko_kr: Web Beans RI를 다수의 애플리케이션의 운용을 지원하는 환경으로 통합할 경우, 각각의 Web Beans 애플리케이션에 대한 클래스로더 분리를 자동으로 또는 사용자 설정을 통해 반드시 활성화해야 합니다.
zh_cn: 如果你将一个Web Bean参考实现整合到一个支持多应用部署的环境中，你需要以用户配置或者自动化方式为每个Web Bean应用激活类加载器隔离。

source: Servlet
ja_jp: サーブレット

source: If you are integrating the Web Beans into a Servlet environment you must register <literal>org.jboss.webbeans.servlet.WebBeansListener</literal> as a Servlet listener, either automatically, or through user configuration, for each Web Beans application which uses Servlet.
de_de: Falls Sie Web Beans in eine Servlet Umgebung integrieren, müssen Sie <literal>org.jboss.webbeans.servlet.WebBeansListener</literal> als einen Servlet-Listener registrieren, entweder automatisch oder aber durch Benutzerkonfiguration. Dies muss für jede Servlet benutzende Web Beans Applikation erfolgen.
es_es: Si usted está integrando el Web Beans en un entorno de Servlet debe registrar <literal>org.jboss.webbeans.servlet.WebBeansListener</literal> como oyente de Servlet, ya sea automáticamente o a través de la configuración de usuario, para cada aplicación Web Beans que utiliza Servlet.
it_it: Se si integra Web Beans in un ambiente Servlet occorre registrare <literal>org.jboss.webbeans.servlet.WebBeansListener</literal> come Servlet listener, o automaticamente, o attraverso una configurazione utente, per ciascuna applicazione Web Beans che usa Servlet.
ja_jp: Web Beansをサーブレット環境と統合しているなら、自動的またはユーザ設定によって、<literal>org.jboss.webbeans.servlet.WebBeansListener</literal>をサーブレットリスナーとして登録する必要があります。この登録は、サーブレットを使用する各Web Beansアプリケーションで必要です。
ko_kr: Web Beans를 Servlet 환경으로 통합할 경우, Servlet을 사용하는 각각의 Web Beans 애플리케이션에 대해 자동으로 또는 사용자 설정을 통해 <literal>org.jboss.webbeans.servlet.WebBeansListener</literal>를 Servlet 청취자로 등록해야 합니다.
zh_cn: 如果你将Web Bean整合到一个Servlet环境中，对每个使用Servlet的 Web Bean应用，你需要以用户配置或者自动化形式将 <literal>org.jboss.webbeans.servlet.WebBeansListener</literal> 注册为一个Servlet监听器。

source: If you are integrating the Web Beans into a JSF environment you must register <literal>org.jboss.webbeans.jsf.WebBeansPhaseListener</literal> as a phase listener, and <literal>org.jboss.webbeans.el.WebBeansELREsolver</literal> as an EL resolver, either automatically, or through user configuration, for each Web Beans application which uses JSF.
ja_jp: Web BeansをJSF環境と統合しているなら、自動的またはユーザ設定によって、<literal>org.jboss.webbeans.jsf.WebBeansPhaseListener</literal>をフェーズリスナーとして、<literal>org.jboss.webbeans.el.WebBeansELREsolver</literal>をELリゾルバーとして登録する必要があります。この登録は、JSFを使用する各Web Beansアプリケーションで必要です。

source: If you are integrating the Web Beans into a JSF environment you must register <literal>org.jboss.webbeans.servlet.ConversationPropagationFilter</literal> as a Servlet listener, either automatically, or through user configuration, for each Web Beans application which uses JSF. This filter can be registered for all Servlet deployment safely.
it_it: Se si integra Web Beans in un ambiente Servlet occorre registrare <literal>org.jboss.webbeans.servlet.ConversationPropagationFilter</literal> come Servlet listener, o automaticamente, o attraverso una configurazione utente, per ciascuna applicazione Web Beans che usa JSF. Questo filtro può venir registrato in modo sicuro per tutti i deploy dei servlet.
ja_jp: Web BeansをJSF環境と統合しているなら、自動的またはユーザ設定によって、<literal>org.jboss.webbeans.servlet.ConversationPropagationFilter</literal>をサーブレットフィルタとして登録する必要があります。この登録は、JSFを使用する各Web Beansアプリケーションで必要です。すべてのサーブレットのデプロイのために、このフィルタは安全に登録できます。
zh_cn: 如果你将Web Bean整合到一个JSF环境中，对每个使用JSF的 Web Bean应用，你需要以用户配置或者自动化形式将 <literal>org.jboss.webbeans.servlet.ConversationPropagationFilter</literal> 注册为一个Servlet监听器。这个过滤器可以安全地向所有Servlet部署注册。

source: Web Beans only supports JSF 1.2 and above.
ja_jp: Web BeansはJSF 1.2以上をサポートしています。

source: Session Bean Interceptor
de_de: Session Bean Interzeptor
es_es: Intercepción de sesión de Bean
ja_jp: セッションBeanインタセプタ
ko_kr: Session Bean 인터셉터
zh_cn: 会话Bean拦截器

source: If you are integrating the Web Beans into an EJB environment you must register <literal>org.jboss.webbeans.ejb.SessionBeanInterceptor</literal> as a EJB interceptor for all EJBs in the application, either automatically, or through user configuration, for each Web Beans application which uses enterprise beans.
de_de: Falls Sie Web Beans in eine EJB Umgebung integrieren, müssen Sie <literal>org.jboss.webbeans.ejb.SessionBeanInterceptor</literal> als einen EJB-Interzeptor für alle EJBs in der Applikation registrieren, entweder automatisch oder aber durch Benutzerkonfiguration. Dies muss für jede Enterprise Beans benutzende Web Beans Applikation erfolgen.
es_es: Si está integrando los Web Beans en un entorno EJB debe registrar <literal>org.jboss.webbeans.ejb.SessionBeanInterceptor</literal> como un interceptor EJB para todos los EJB en la aplicación, automáticamente o a través de la configuración de usuario, para cada aplicación que utilice Web Beans empresariales.
it_it: Se si integra Web Beans in un ambiente EJB occorre registrare <literal>org.jboss.webbeans.ejb.SessionBeanInterceptor</literal> come interceptor EJB per ogni EJB dell'applicazione, o automaticamente o attraverso una configurazione utente, per ciascuna applicazione Web Beans che utilizza bean enterprise.
ja_jp: Web BeansをEJB環境と統合しているなら、自動的またはユーザ設定によって、アプリケーション中のすべてのEJBに対して<literal>org.jboss.webbeans.ejb.SessionBeanInterceptor</literal>をEJBインタセプタとして登録する必要があります。この登録は、エンタープライズBeanを使用する各Web Beansアプリケーションで必要です。
ko_kr: Web Beans를 EJB 환경으로 통합하고자 할 경우 엔터프라이즈 beans를 사용하는 각각의 Web Beans 애플리케이션 용으로 모든 EJB 애플리케이션에 대해 EJB 인터셉터로서 <literal>org.jboss.webbeans.ejb.SessionBeanInterceptor</literal>를 자동으로 또는 사용자 설정을 통해 등록해야 합니다.
zh_cn: 如果你将Web Beans整合到EJB环境中，对每个使用企业级Bean的Web Bean应用，你需要以用户配置或者自动化形式将 <literal>org.jboss.webbeans.ejb.SessionBeanInterceptor</literal> 注册为应用中所有EJB的EJB拦截器。

source: You must register the <literal>SessionBeanInterceptor</literal> as the inner most interceptor in the stack for all EJBs.
it_it: Occorre registrare il <literal>SessionBeanInterceptor</literal> come interceptor più interno allo stack per tutti gli EJB.
ja_jp: すべてのEJBで、<literal>SessionBeanInterceptor</literal>をインタセプタスタックの中で最も内側に登録する必要があります。
zh_cn: 你必须为所有的EJB在栈中将<literal>SessionBeanInterceptor</literal> 注册为一个最内部的拦截器。

source: The <literal>webbeans-core.jar</literal>
it_it: <literal>webbeans-core.jar</literal>
ja_jp: <literal>webbeans-core.jar</literal>

source: If you are integrating the Web Beans into an environment that supports deployment of applications, you must insert the <literal>webbeans-core.jar</literal> into the applications isolated classloader. It cannot be loaded from a shared classloader.
it_it: Se si integra Web Beans in un ambiente che supporta il deploy di applicazioni, occorre inserire <literal>webbeans-core.jar</literal> nel classloader isolato delle applicazioni. Non può essere caricato da un classloader condiviso.
ja_jp: Web Beansを複数のアプリケーションのデプロイをサポートする環境と統合しているなら、<literal>webbeans-core.jar</literal>を、クラスローダが分離されているアプリケーションに加える必要があります。このJARファイルは共有クラスローダではロードすることはできません。

source: Binding the manager in JNDI
ja_jp: JNDIにマネージャをバインドする

source: You should bind a <literal>Reference</literal> to the Manager <literal>ObjectFactory</literal> into JNDI at <literal>java:app/Manager</literal>. The type should be <literal>javax.inject.manager.Manager</literal> and the factory class is <literal>org.jboss.webbeans.resources.ManagerObjectFactory</literal>
ja_jp: あなたはマネージャの<literal>ObjectFactory</literal> への<literal>参照</literal>をJNDIの <literal>java:app/Manager</literal>にバインドしなければなりません。その型は<literal>javax.inject.manager.Manager</literal>と<literal>org.jboss.webbeans.resources.ManagerObjectFactory</literal>でなければなりません。

source: Integrating the Web Beans RI into other environments
de_de: Integration der Web Beans RI in andere Umgebungen
es_es: Integración de la IR de Web Beans en otros entornos
it_it: Integrazione di Web Beans RI in altri ambienti
ko_kr: Web Beans RI를 다른 환경으로 통합
zh_cn: 将Web Bean参考实现整合到其他环境中

source: Currently the Web Beans RI only runs in JBoss AS 5; integrating the RI into other EE environments (for example another application server like Glassfish), into a servlet container (like Tomcat), or with an Embedded EJB3.1 implementation is fairly easy. In this Appendix we will briefly discuss the steps needed.
de_de: Derzeit läuft die Web Beans RI nur in JBoss AS 5; die Implementierung der RI in andere EE-Umgebungen (zum Beispiel einen anderen Applikationsserver wie Glassfish) in einen Servlet-Container (wie Tomcat) oder eine Embedded EJB3.1 Implementierung ist recht einfach. In diesem Anhang gehen wir kurz auf die notwendigen Schritte ein.
es_es: Actualmente la IR de Web Beans sólo se ejecuta en JBoss AS 5; integrando la IR dentro de otros entornos EE (por ejemplo otro servidor de aplicación como Glassfish), dentro de un contenedor de servlet (como Tomcat), o con una implementación incrustada EJB3.1 es bastante fácil. En este apéndice veremos brevemente los pasos requeridos.
it_it: Attualmente Web Bean RI funziona solo in JBoss AS 5; l'integrazione di RI in altri ambienti EE (per esempio in un application server come Glassfish), in un servlet container (come Tomcat), o con un'implementazione EJB3.1 Embedded è abbastanza facile. In questo appendice si discuterà brevemente dei passi necessari.
ko_kr: 현재 Web Beans RI는 JBoss AS 5에서만 실행됩니다; RI를 기타 다른 EE 환경 (예를 들어 Glassfish와 같은 다른 애플리케이션 서버)으로 통합, 또는 servlet 컨테이너로 통합 (예: Tomcat), 또는 내장된 EJB3.1 구현과 통합하는 것은 쉽습니다. Appendix에서 필요한 절차에 대해 간략하게 살펴보겠습니다.
zh_cn: 目前，Web Bean的参考实现只能运行在JBoss AS5中；将参考实现整合到其他EE环境中（例如像Glassfish的其他的应用服务器）以及一个Servlet容器（像Tomcat）中或者一个内嵌的EJB3.1实现中相当容易。在附录中我们将简要的讨论所需的步骤。

source: It should be possible to run Web Beans in an SE environment, but you'll to do more work, adding your own contexts and lifecycle. The Web Beans RI currently doesn't expose lifecycle extension points, so you would have to code directly against Web Beans RI classes.
de_de: Es sollte möglich sein, Web Beans in einer SE Umgebung auszuführen, aber Sie werden mehr Arbeit durchführen müssen indem Sie Ihre eigenen Kontexte und Lebenszyklus hinzufügen. Die Web Beans RI legt derzeit keine Lebenszyklus-Erweiterungspunkte offen, weswegen Sie direkt gegen Web Beans RI-Klassen kodieren müssten.
es_es: Debería ser posible ejecutar Web Beans en un entorno SE, pero tendría que hacer más cosas, agregar sus propios contextos y ciclo de vida. La IR de Web Beans actualmente no expone puntos de extensión del ciclo de vida, por lo tanto se tendría que codificar directamente en clases IR de Web Beans.
it_it: Dovrebbe essere possibile far funzionare Web Beans in un ambiente SE, ma occorre molto lavoro per aggiungere i propri contesti ed il ciclo di vita. Web Beans RI attualmente non espone punti di estensione del ciclo di vita, così occorre codificare direttamente nelle classi Web Beans RI.
ko_kr: SE 환경에서 Web Beans를 실행할 수 있어야 하지만, 자체적 컨텍스트 및 수명 주기 추가와 같은 더 많은 작업을 해야 합니다. 현재 Web Beans RI는 수명 확장 지점을 나타내지 않고 있으므로, Web Beans RI 클래스에 대해 직접 코드화해야 합니다.
zh_cn: Web Bean可以在SE环境中运行，但是你需要做更多的工作，添加你自己的上下文和生命周期。Web Bean参考实现目前没有暴露生命周期扩展点，所以你不得不直接编写Web Bean参考实现的类。

source: The Web Beans RI SPI
de_de: Das Web Beans RI SPI
es_es: SPI RI de Web Beans
it_it: Web Beans RI SPI
ko_kr: Web Beans RI SPI
zh_cn: Web Bean的参考实现SPI

source: The Web Beans SPI is located in <literal>webbeans-spi</literal> module, and packaged as <literal>webbeans-spi.jar</literal>. Some SPIs are optional, if you need to override the default behavior, others are required.
it_it: Web Beans SPI è collocato nel modulo <literal>webbeans-spi</literal>, ed è impacchettato come <literal>webbeans-spi.jar</literal>. Alcuni SPI sono opzionali se occorre fare override del comportamento di default, altri sono richiesti.

source: All interfaces in the SPI support the decorator pattern and provide a <literal>Forwarding</literal> class.
de_de: Alle Interfaces im SPI unterstützen das Dekorator-Muster und liefern eine <literal>Forwarding</literal>-Klasse.
es_es: Todas las interfaces en el patrón decorador SPI soportan y proporcionan una clase <literal>Forwarding</literal>.
it_it: Tutte le interfacce in SPI supportano il pattern decorator e forniscono una classe <literal>Forwarding</literal>.
zh_cn: 所有的SPI接口都支持装饰器模式，并且提供一个 <literal>Forwarding</literal> 类。

source: The discovery of Web Bean classes and <literal>web-bean.xml</literal> files is self-explanatory (the algorithm is described in Section 11.1 of the JSR-299 specification, and isn't repeated here).
de_de: Die Discovery von Web Bean Klassen und <literal>web-bean.xml</literal> Dateien versteht sich von selbst (der Algorithmus wird in Abschnitt 11.1 der JSR-299 Spezifikation beschrieben, weswegen hier nicht darauf eingegangen wird).
es_es: El descubirmiento de clases de Web Bean y de archivos <literal>web-bean.xml</literal> es autoexplicativo (el algoritmo está descrito en la sección 11.1 de la especificación JSR299 y no se repite aquí).
it_it: L'analisi dei file delle classi Web Bean e di <literal>web-bean.xml</literal> è molto istruttiva (l'algoritmo è descritto nella sezione 11.1 della specifica JSR-299 e non viene qua ripetuto).
ko_kr: Web Bean 클래스 및 <literal>web-bean.xml</literal> 파일 검색은 쉽게 알 수 있습니다 (알고리즘은 JSR-299 사양 11.1장에 설명되어 있으므로 여기서 다시 설명하지 않습니다).
zh_cn: Web Bean类的发现和 <literal>web-bean.xml</literal> 配置文件的都是自解释性的（算法在JSR-299规范中已经描述了，这里就不再重复）

source: The Web Beans RI also delegates EJB3 bean discovery to the container so that it doesn't have to scan for EJB3 annotations or parse <literal>ejb-jar.xml</literal>. For each EJB in the application an EJBDescriptor should be discovered:
de_de: Die Web Beans RI delegiert auch EJB3 Bean Discovery an den Container, so dass er nicht nach EJB3-Annotationen scannen oder <literal>ejb-jar.xml</literal> parsen muss. Für jedes EJB in der Anwendung sollte der EJBDescriptor aufgefunden werden:
es_es: La IR de Web Beans también delega el descubrimiento de bean EJB3 al contenedor para no tener que examinar las anotaciones EJB3 o analizar <literal>ejb-jar.xml</literal>. Para cada EJB en la aplicación se debe descubrir un EJBDescriptor:
it_it: Web Beans RI delega al container la rilevazione dei bean EJB3 e quindi risulta non essere necessario eseguire lo scan delle annotazioni EJB3 o fare il parsing di <literal>ejb-jar.xml</literal>. Per ciascun EJB nell'applicazione dovrebbe essere rilevato un EJBDescriptor:
ko_kr: Web Beans RI는 컨테이너로 EJB3 bean 검색을 위임하므로 EJB3 어노테이션을 검색하거나 <literal>ejb-jar.xml</literal>을 파싱할 필요가 없습니다. 애플리케이션에 있는 각각의 EJB의 경우 EJBDescriptor를 검색해야 합니다:
zh_cn: Web Bean参考实现也将EJB3 Bean的发现委托给容器，以便它不用再扫描EJB3注释和解析 <literal>ejb-jar.xml</literal> 文件。对于应用中的每个EJB都应发现一个EJBDescriptor：

source: The resolution of <literal>@EJB</literal> and <literal>@Resource</literal> is delegated to the container. You must provide an implementation of <literal>org.jboss.webbeans.ejb.spi.EjbServices</literal> which provides these operations. Web Beans passes in the <literal>javax.inject.manager.InjectionPoint</literal> the resolution is for, as well as the <literal>NamingContext</literal> in use for each resolution request.
it_it: La risoluzione di <literal>@EJB</literal> e <literal>@Resource</literal> è delegata al container. Occorre fornire un'implementazione di <literal>org.jboss.webbeans.ejb.spi.EjbServices</literal> che rende disponibili queste operazioni. Web Beans passa nel <literal>javax.inject.manager.InjectionPoint</literal> la risoluzione, anche come <literal>NamingContext</literal>, che è in uso per ogni richiesta di risoluzione.

source: Just as resolution of <literal>@EJB</literal> is delegated to the container, so is resolution of <literal>@PersistenceContext</literal>.
it_it: Solo come risoluzione di <literal>@EJB</literal> è delegata al container, e quindi è la risoluzione di <literal>@PersistenceContext</literal>.

source: OPEN ISSUE: Web Beans also requires the container to provide a list of entities in the deployment, so that they aren't discovered as simple beans.
it_it: PROBLEMA APERTO: Web Beans richiede anche che il container fornisca una lista di entity nel deploy, cosicché non siano rilevati come semplici bean.

source: The Web Beans RI must delegate JTA activities to the container. The SPI provides a couple hooks to easily achieve this with the <literal>TransactionServices</literal> interface.
it_it: Web Beans RI deve delegare le attività JTA al container. SPI fornisce un paio di modi per ottenere ciò tramite l'interfaccia <literal>TransactionServices</literal>.
zh_cn: Web Bean RI必须将JTA活动委托给容器。SPI提供者提供一些钩子(hooks)结合<literal>TransactionServices</literal> 接口来轻松完成这个任务。

source: Web Beans expects the Application Server or other container to provide the storage for each application's context. The <literal>org.jboss.webbeans.context.api.BeanStore</literal> should be implemented to provide an application scoped storage. You may find <literal>org.jboss.webbeans.context.api.helpers.ConcurrentHashMapBeanStore</literal> useful.
de_de: Web Beans erwartet, dass der Applikations-Server oder anderer Container den Speicher für den Kontext jeder Applikation bereitstellt. Der <literal>org.jboss.webbeans.context.api.BeanStore</literal> sollte implementiert sein, um einen durch die Applikation begrenzten Speicher bereitzustellen. Vielleicht finden Sie in diesem Zusammenhang <literal>org.jboss.webbeans.context.api.helpers.ConcurrentHashMapBeanStore</literal> hilfreich.
it_it: Web Beans si aspetta che l'Application Server od un altro container fornisca la memorizzazione per ogni contesto applicazione. <literal>org.jboss.webbeans.context.api.BeanStore</literal> dovrebbe essere implementato per fornire uno storage con scope applicazione. Si può trovare molto utile <literal>org.jboss.webbeans.context.api.helpers.ConcurrentHashMapBeanStore</literal>.
zh_cn: Web Bean期望应用服务器或者其他容器能够提供每个应用上下文的存储。<literal>org.jboss.webbeans.context.api.BeanStore</literal> 应该被实现以便提供一个应用范围的存储。你也许会发现 <literal>org.jboss.webbeans.context.api.helpers.ConcurrentHashMapBeanStore</literal> 非常有用。

source: The bootstrap supports multiple environments. Different environments require different services to be present (for example servlet doesn't require transaction, EJB or JPA services). By default an EE environment is assumed, but you can adjust the environment by calling <literal>bootstrap.setEnvironment()</literal>.
it_it: Il bootstrap supporta più ambienti. Diversi ambienti richiedono diversi servizi presenti (per esempio servlet non richiede i servizi di transazione, EJB o JPA). Di default viene assunto un ambiente EE, ma si può impostare un ambiente chiamando <literal>bootstrap.setEnvironment()</literal>.

source: To shutdown the container you call <literal>Bootstrap.shutdown()</literal>. This allows the container to perform any cleanup operations needed.
de_de: Um den Container herunterzufahren, rufen Sie you call <literal>Bootstrap.shutdown()</literal> auf. Dies gestattet es dem Container notwendige Bereinigungsvorgänge durchzuführen.
it_it: Per spegnere il container si chiama <literal>Bootstrap.shutdown()</literal>. Questo consente al container di eseguire ogni pulizia necessaria delle operazioni.
zh_cn: 要关闭容器，你需要调用 <literal>Bootstrap.shutdown()</literal>。这将让容器执行一些必要的清洁工作。

source: The Web Beans RI implements JNDI binding and lookup according to standards, however you may want to alter the binding and lookup (for example in an environment where JNDI isn't available). To do this, implement <literal>org.jboss.webbeans.resources.spi.NamingContext</literal>:
de_de: Die Web Beans RI implementiert JNDI-Binding und Lookup gemäß Standards, jedoch möchten Sie vielleicht Binding und Lookup ändern (etwa in einer Umgebung, in der JNDI nicht verfügbar ist). Um dies zu tun, implementieren Sie <literal>org.jboss.webbeans.resources.spi.NamingContext</literal>:
it_it: Web Beans RI implementa la ricerca e l'associazione JNDI secondo gli standard, ma può capitare di dover modificare la ricerca e l'associazione (per esempio in un ambiente dove JNDI non è disponibile). Per fare questo occorre implementare <literal>org.jboss.webbeans.resources.spi.NamingContext</literal>:
zh_cn: Web Beans 参考实现实现了JNDI 的绑定和根据标准来查询，然而你可能想要改变这些绑定和查询（例如在一个没有JNDI的环境中）。你可以通过实现 <literal>org.jboss.webbeans.resources.spi.NamingContext</literal>来完成这个工作：
