Repository: 1tchy/core
Catalog: reference/*/ri.po
Languages: es_es, it_it, pt_br, zh_tw

source: <programlistingco> <areaspec> <area id="faces.servlet" coords="12"/> <area id="faces.servlet.mapping" coords="18"/> <area id="faces.default.suffix" coords="23"/> <area id="session.timeout" coords="28"/> <area id="webbeans.listener" coords="32"/> </areaspec> <programlisting><![CDATA[<?xml version="1.0" encoding="UTF-8"?> <web-app version="2.5" xmlns="http://java.sun.com/xml/ns/javaee" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://java.sun.com/xml/ns/javaee http://java.sun.com/xml/ns/javaee/web-app_2_5.xsd"> <display-name>Web Beans Numbergues example</display-name> <!-- JSF --> <servlet> <servlet-name>Faces Servlet</servlet-name> <servlet-class>javax.faces.webapp.FacesServlet</servlet-class> <load-on-startup>1</load-on-startup> </servlet> <servlet-mapping> <servlet-name>Faces Servlet</servlet-name> <url-pattern>*.jsf</url-pattern> </servlet-mapping> <context-param> <param-name>javax.faces.DEFAULT_SUFFIX</param-name> <param-value>.xhtml</param-value> </context-param> <session-config> <session-timeout>10</session-timeout> </session-config> </web-app>]]></programlisting> <calloutlist> <callout arearefs="faces.servlet"> <para> Enable and load the JSF servlet </para> </callout> <callout arearefs="faces.servlet.mapping"> <para> Configure requests to <literal>.jsf</literal> pages to be handled by JSF </para> </callout> <callout arearefs="faces.default.suffix"> <para> Tell JSF that we will be giving our source files (facelets) an extension of <literal>.jsf</literal> </para> </callout> <callout arearefs="session.timeout"> <para> Configure a session timeout of 10 minutes </para> </callout> </calloutlist> </programlistingco> <note> <para> Whilst this demo is a JSF demo, you can use the Web Beans RI with any Servlet based web framework. </para> </note> <para> Let's take a look at the Facelet view: </para> <programlistingco> <areaspec> <area id="template" coords="8"/> <area id="messages" coords="12"/> <area id="instructions" coords="19"/> <area id="guess" coords="25"/> <area id="validator" coords="30"/> <area id="submit" coords="33"/> </areaspec> <programlisting><![CDATA[<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"> <html xmlns="http://www.w3.org/1999/xhtml" xmlns:ui="http://java.sun.com/jsf/facelets" xmlns:h="http://java.sun.com/jsf/html" xmlns:f="http://java.sun.com/jsf/core" xmlns:s="http://jboss.com/products/seam/taglib"> <ui:composition template="template.xhtml"> <ui:define name="content"> <h1>Guess a number...</h1> <h:form id="NumberGuessMain"> <div style="color: red"> <h:messages id="messages" globalOnly="false"/> <h:outputText id="Higher" value="Higher!" rendered="#{game.number gt game.guess and game.guess ne 0}"/> <h:outputText id="Lower" value="Lower!" rendered="#{game.number lt game.guess and game.guess ne 0}"/> </div> <div> I'm thinking of a number between #{game.smallest} and #{game.biggest}. You have #{game.remainingGuesses} guesses. </div> <div> Your guess: <h:inputText id="inputGuess" value="#{game.guess}" required="true" size="3" disabled="#{game.number eq game.guess}"> <f:validateLongRange maximum="#{game.biggest}" minimum="#{game.smallest}"/> </h:inputText> <h:commandButton id="GuessButton" value="Guess" action="#{game.check}" disabled="#{game.number eq game.guess}"/> </div> <div> <h:commandButton id="RestartButton" value="Reset" action="#{game.reset}" immediate="true" /> </div> </h:form> </ui:define> </ui:composition> </html>]]></programlisting> <calloutlist> <callout arearefs="template"> <para> Facelets is a templating language for JSF, here we are wrapping our page in a template which defines the header. </para> </callout> <callout arearefs="messages"> <para> There are a number of messages which can be sent to the user, "Higher!", "Lower!" and "Correct!" </para> </callout> <callout arearefs="instructions"> <para> As the user guesses, the range of numbers they can guess gets smaller - this sentance changes to make sure they know what range to guess in. </para> </callout> <callout arearefs="guess"> <para> This input field is bound to a Web Bean, using the value expression. </para> </callout> <callout arearefs="validator"> <para> A range validator is used to make sure the user doesn't accidentally input a number outside of the range in which they can guess - if the validator wasn't here, the user might use up a guess on an out of range number. </para> </callout> <callout arearefs="submit"> <para> And, of course, there must be a way for the user to send their guess to the server. Here we bind to an action method on the Web Bean. </para> </callout> </calloutlist> </programlistingco>
es_es: <programlistingco> <areaspec> <area id="faces.servlet" coords="12"/> <area id="faces.servlet.mapping" coords="18"/> <area id="faces.default.suffix" coords="23"/> <area id="session.timeout" coords="28"/> <area id="webbeans.listener" coords="32"/> </areaspec> <programlisting><![CDATA[<?xml version="1.0" encoding="UTF-8"?> <web-app version="2.5" xmlns="http://java.sun.com/xml/ns/javaee" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://java.sun.com/xml/ns/javaee http://java.sun.com/xml/ns/javaee/web-app_2_5.xsd"> <display-name>ejemplo de Web Beans Numberguess</display-name> <!-- JSF --> <servlet> <servlet-name>Faces Servlet</servlet-name> <servlet-class>javax.faces.webapp.FacesServlet</servlet-class> <load-on-startup>1</load-on-startup> </servlet> <servlet-mapping> <servlet-name>Faces Servlet</servlet-name> <url-pattern>*.jsf</url-pattern> </servlet-mapping> <context-param> <param-name>javax.faces.DEFAULT_SUFFIX</param-name> <param-value>.xhtml</param-value> </context-param> <session-config> <session-timeout>10</session-timeout> </session-config> </web-app>]]></programlisting> <calloutlist> <callout arearefs="faces.servlet"> <para> Habilitar y cargar el servlet de JSF </para> </callout> <callout arearefs="faces.servlet.mapping"> <para> Configurar peticiones <literal>.jsf</literal> para páginas que van a ser manejadas por JSF </para> </callout> <callout arearefs="faces.default.suffix"> <para> Decir a JSF que le estaremos dando a nuestros archivos fuente (facelets) una extensión de <literal>.jsf</literal> </para> </callout> <callout arearefs="session.timeout"> <para> Configurar una pausa de 10 minutos </para> </callout> </calloutlist> </programlistingco> <note> <para> Aunque este demo es un demo de JSF, puede utilizar el IR de Web Beans con cualquier marco de la red basado en Servlet. </para> </note> <para> Observemos una vista de Facelet: </para> <programlistingco> <areaspec> <area id="template" coords="8"/> <area id="messages" coords="12"/> <area id="instructions" coords="19"/> <area id="guess" coords="25"/> <area id="validator" coords="30"/> <area id="submit" coords="33"/> </areaspec> <programlisting><![CDATA[<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"> <html xmlns="http://www.w3.org/1999/xhtml" xmlns:ui="http://java.sun.com/jsf/facelets" xmlns:h="http://java.sun.com/jsf/html" xmlns:f="http://java.sun.com/jsf/core" xmlns:s="http://jboss.com/products/seam/taglib"> <ui:composition template="template.xhtml"> <ui:define name="content"> <h1>Adivine un número...</h1> <h:form id="NumberGuessMain"> <div style="color: red"> <h:messages id="messages" globalOnly="false"/> <h:outputText id="Higher" value="Higher!" rendered="#{game.number gt game.guess and game.guess ne 0}"/> <h:outputText id="Lower" value="Lower!" rendered="#{game.number lt game.guess and game.guess ne 0}"/> </div> <div> Estoy pensando un número entre #{game.smallest} y #{game.biggest}. Le quedan #{game.remainingGuesses} de intentos. </div> <div> Su número: <h:inputText id="inputGuess" value="#{game.guess}" required="true" size="3" disabled="#{game.number eq game.guess}"> <f:validateLongRange maximum="#{game.biggest}" minimum="#{game.smallest}"/> </h:inputText> <h:commandButton id="GuessButton" value="Guess" action="#{game.check}" disabled="#{game.number eq game.guess}"/> </div> <div> <h:commandButton id="RestartButton" value="Reset" action="#{game.reset}" immediate="true" /> </div> </h:form> </ui:define> </ui:composition> </html>]]></programlisting> <calloutlist> <callout arearefs="template"> <para> Facelets es un lenguaje de plantilla para JSF, aquí se delimita la página en una plantilla que define el encabezado. </para> </callout> <callout arearefs="messages"> <para> Hay una cantidad de mensajes que pueden ser enviados al usuario, "Mayor!", "Menor!" y "Correcto!" </para> </callout> <callout arearefs="instructions"> <para> Mientras el usuario adivina, el rango de números que puede adivinar se vuelve cada vez más pequeño-esta oración cambia para estar seguros de que el usuario sabe en qué rango debe adivinar. </para> </callout> <callout arearefs="guess"> <para> Este campo de entrada está vinculado a un Web Bean, utilizando la expresión de valor. </para> </callout> <callout arearefs="validator"> <para> Un rango de validador se utiliza para garantizar que el usuario por accidente no entre un número fuera del rango en el que se puede adivinar - si el validador no estuviera aquí, el usuario podría tratar de adivinar fuera del rango. </para> </callout> <callout arearefs="submit"> <para> Y, obviamente, debe haber una forma para que el usuario pueda enviar el número al servidor. Aquí nos vincularnos a un método de acción en el Web Bean. </para> </callout> </calloutlist> </programlistingco>

source: <![CDATA[<?xml version="1.0" encoding="UTF-8"?> <application xmlns="http://java.sun.com/xml/ns/javaee" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://java.sun.com/xml/ns/javaee http://java.sun.com/xml/ns/javaee/application_5.xsd" version="5"> <display-name>webbeans-translator-ear</display-name> <description>Ear Example for the reference implementation of JSR 299: Web Beans</description> <module> <web> <web-uri>webbeans-translator.war</web-uri> <context-root>/webbeans-translator</context-root> </web> </module> <module> <ejb>webbeans-translator.jar</ejb> </module> </application>]]>
es_es: <![CDATA[<?xml version="1.0" encoding="UTF-8"?> <application xmlns="http://java.sun.com/xml/ns/javaee" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://java.sun.com/xml/ns/javaee http://java.sun.com/xml/ns/javaee/application_5.xsd" version="5"> <display-name>webbeans-translator-ear</display-name> <description>Ejemplo Ear para la implementación de referencia de JSR 299: Web Beans</description> <module> <web> <web-uri>webbeans-translator.war</web-uri> <context-root>/webbeans-translator</context-root> </web> </module> <module> <ejb>webbeans-translator.jar</ejb> </module> </application>]]>

source: Next, lets look at the war. Just as in the numberguess example, we have a <literal>faces-config.xml</literal> (to enabled Facelets) and a <literal>web.xml</literal> (to enable JSF) in <literal>WebContent/WEB-INF</literal>.
es_es: Ahora veamos al WAR. Al igual que el ejemplo de Numberguess, tenemos un <literal>faces-config.xml</literal> (para Facelets habilitadas) y un <literal>web.xml</literal> (para habilitar a JSF) en <literal>WebContent/WEB-INF</literal>.
it_it: Quindi, esaminiamo il war. Proprio come nell'esempio Indovina Numero, abbiamo un <literal>faces-config.xml</literal> (per abilitare Facelets) e un <literal>web.xml</literal> (per abilitare JSF) in <literal>WebContent/WEB-INF</literal>.
zh_tw: 接下來，讓我們看一下 war。就和 numberguess 範例中一樣，我們在 <literal>WebContent/WEB-INF</literal> 中有個 <literal>faces-config.xml</literal>（用來啟用 Facelets）以及一個 <literal>web.xml</literal>（用來啟用 JSF）。

source: That concludes our short tour of the Web Beans RI examples. For more on the RI, or to help out, please visit <ulink url="http://www.seamframework.org/WebBeans/Development">http://www.seamframework.org/WebBeans/Development</ulink>.
es_es: Aquí termina nuestro corto recorrido por los ejemplos IR de Web Beans. Para mayor información acerca de IR o ayuda, por favor consulte <ulink url="http://www.seamframework.org/WebBeans/Development">http://www.seamframework.org/WebBeans/Development</ulink>.
it_it: Ciò conclude il nostro breve tour degli esempi della RI di Web Beans. Per saperne di più, o per trovare ulteriore aiuto, per favore visitate <ulink url="http://www.seamframework.org/WebBeans/Development">http://www.seamframework.org/WebBeans/Development</ulink>.
zh_tw: 這結束了我們簡短的 Web Bean RI 範例。如欲取得更多有關於 RI 的相關資訊，或是提供相關協助，請參閱 <ulink url="http://www.seamframework.org/WebBeans/Development">http://www.seamframework.org/WebBeans/Development</ulink>。
