Repository: 1tchy/core
Catalog: reference/*/ri.po
Languages: es_es, it_it, pt_br, zh_tw

source: Here we set the context path, which gives us a nice url (<ulink url="http://localhost:8080/webbeans-translator">http://localhost:8080/webbeans-translator</ulink>).
es_es: Aquí establecemos la ruta de contexto, la cual nos da una url interesante (<ulink url="http://localhost:8080/webbeans-translator">http://localhost:8080/webbeans-translator</ulink>).
it_it: Qua viene impostato il context path, in modo da avere un url gradevole (<ulink url="http://localhost:8080/webbeans-translator">http://localhost:8080/webbeans-translator</ulink>).
pt_br: Aqui nós definiremos o caminho do contexto, que nos dá uma url amigável (<ulink url="http://localhost:8080/webbeans-translator">http://localhost:8080/webbeans-translator</ulink>). ulink&gt;) .
zh_tw: 在此我們將設置 context 路徑，它能提供給我們一個網址（<ulink url="http://localhost:8080/webbeans-translator">http://localhost:8080/webbeans-translator</ulink>）。

source: If you aren't using Maven to generate these files, you would need <literal>META-INF/application.xml</literal>:
es_es: Si no está utilizando Maven para generar estos archivos, usted necesitaría <literal>META-INF/application.xml</literal>:
it_it: Se non si sta usando Maven per generare questi file, sarebbe necessario avere il file <literal>META-INF/application.xml</literal>:
pt_br: Se você não está usando o Maven para gerar esses arquivos, você precisaria <literal>META-INF/application.xml</literal>:
zh_tw: 若您不使用 Maven 來產生這些檔案，那麼您將需要 <literal>META-INF/application.xml</literal>：

source: Next, lets look at the war. Just as in the numberguess example, we have a <literal>faces-config.xml</literal> (to enable Facelets) and a <literal>web.xml</literal> (to enable JSF) in <literal>WebContent/WEB-INF</literal>.
pt_br: Em seguida, vamos ver o war. Tal como no exemplo numberguess, temos um <literal>faces-config.xml</literal> (para habilitar o Facelets) e um <literal>web.xml</literal> (para habilitar o JSF) no <literal>WebContent/WEB-INF</literal>.

source: More intersting is the facelet used to translate text. Just as in the numberguess example we have a template, which surrounds the form (ommitted here for brevity):
es_es: Más interesante aún es el facelet utilizado para traducir texto. Al igual que en el ejemplo de numberguess tenemos una plantilla, la cual rodea la forma (omitida aquí por razones de brevedad):
it_it: Più interessante è il facelet usato per tradurre il testo. Proprio come nell'esempio Indovina Numero c'è un template, che circoscrive la form (qui omessa per brevità):
pt_br: Mais interessante é o facelet utilizado para traduzir texto. Tal como no exemplo numberguess, temos um template, que envolve o formulário (omitido aqui por brevitude):
zh_tw: 還有更有趣的就是使用來轉換文字的 facelet。就和 numberguess 範例中一樣，我們有個圍繞著 form 的頁面格式（在此將省略不提）：

source: The user can enter some text in the lefthand textarea, and hit the translate button to see the result to the right.
es_es: El usuario puede entrar texto en el área de texto a mano izquierda y pulsar el botón de traducir para ver el resultado a la derecha.
it_it: L'utente può inserire del testo nell'area di testo sulla sinistra e premere il pulsante di traduzione per vedere il risultato sulla destra.
pt_br: O usuário pode digitar um texto no textarea esquerdo e clicar no botão traduzir para ver o resultado à direita.
zh_tw: 用戶可在左手邊的文字區域中輸入一些文字，然後點選轉譯按鈕並於右手邊的區域中查看結果。

source: Finally, let's look at the ejb module, <literal>webbeans-translator-ejb</literal>. In <literal>src/main/resources/META-INF</literal> there is just an empty <literal>web-beans.xml</literal>, used to mark the archive as containing Web Beans.
es_es: Por último, veamos el módulo EJB, <literal>webbeans-translator-ejb</literal>. En <literal>src/main/resources/META-INF</literal> sólo hay un <literal>web-beans.xml</literal> vacío, utilizado para marcar el archivo como si contuviera Web Beans.
it_it: Infine, si esamini il modulo ejb, <literal>webbeans-translator-ejb</literal>. In <literal>src/main/resources/META-INF</literal> si trova un file vuoto <literal>web-beans.xml</literal>, usato per marcare l'archivio come contenente Web Beans.
pt_br: Por fim, vamos olhar o módulo EJB <literal>webbeans-translator-ejb</literal>. Em <literal>src/main/resources/META-INF</literal> existe apenas um <literal>web-beans.xml</literal> vazio, utilizado para marcar o arquivo como contendo Web Beans.
zh_tw: 最後，讓我們來看一下 ejb 模組 <literal>webbeans-translator-ejb</literal>。在 <literal>src/main/resources/META-INF</literal> 中只有一個用來將 archive 標記為包含著 Web Bean 的空 <literal>web-beans.xml</literal>。

source: We've saved the most interesting bit to last, the code! The project has two simple beans, <literal>SentenceParser</literal> and <literal>TextTranslator</literal> and two enterprise beans, <literal>TranslatorControllerBean</literal> and <literal>SentenceTranslator</literal>. You should be getting quite familiar with what a Web Bean looks like by now, so we'll just highlight the most interesting bits here.
es_es: Hemos guardado la parte más interesante para el final, ¡el código! El proyecto tiene dos beans sencillos, <literal>SentenceParser</literal> y <literal>TextTranslator</literal> y dos beans empresariales, <literal>TranslatorControllerBean</literal> y <literal>SentenceTranslator</literal>. Por ahora, debe comenzar a familiarizarse con el aspecto de Web Bean, por lo tanto sólo destacaremos aquí las partes más interesantes.
it_it: Abbiamo lasciato per ultimo il boccone più prelibato, il codice! Il progetto ha due bean semplici, <literal>SentenceParser</literal> e <literal>TextTranslator</literal> e due bean enterprise, <literal>TranslatorControllerBean</literal> e <literal>SentenceTranslator</literal>. Dovreste ormai essere piuttosto familiari all'aspetto di un Web Bean, così ci limiteremo a evidenziare le parti più interessanti.
pt_br: Deixamos o pedaço mais interessante para o final: o código! O projeto tem dois beans simples, <literal>SentenceParser</literal> e <literal>TextTranslator</literal> e dois beans corporativos<literal>TranslatorControllerBean</literal> e <literal>SentenceTranslator</literal>. Você deve estar bastante familiarizado com o que um Web Bean parece até agora. Então, vamos apenas destacar as partes mais interessantes aqui.

source: Both <literal>SentenceParser</literal> and <literal>TextTranslator</literal> are dependent beans, and <literal>TextTranslator</literal> uses constructor initialization:
es_es: Tanto <literal>SentenceParser</literal> como <literal>TextTranslator</literal> son beans dependientes, y <literal>TextTranslator</literal> utiliza inicialización de constructor:
it_it: Sia <literal>SentenceParser</literal> che <literal>TextTranslator</literal> sono bean dependenti, e <literal>TextTranslator</literal> usa l'inizializzazione via costruttore:
pt_br: Tanto <literal>SentenceParser</literal> quanto <literal>TextTranslator</literal> são beans dependentes, e <literal>TextTranslator</literal> usa inicialização por construtor :

source: <![CDATA[public class TextTranslator { private SentenceParser sentenceParser; private Translator sentenceTranslator; @Initializer TextTranslator(SentenceParser sentenceParser, Translator sentenceTranslator) { this.sentenceParser = sentenceParser; this.sentenceTranslator = sentenceTranslator;]]>
pt_br: <![CDATA[<h:form id="NumberGuessMain"> <table> <tr align="center" style="font-weight: bold" > <td> Your text </td> <td> Translation </td> </tr> <tr> <td> <h:inputTextarea id="text" value="#{translator.text}" required="true" rows="5" cols="80" /> </td> <td> <h:outputText value="#{translator.translatedText}" /> </td> </tr> </table> <div> <h:commandButton id="button" value="Translate" action="#{translator.translate}"/> </div> </h:form>]]>

source: <literal>TextTranslator</literal> is a stateless bean (with a local business interface), where the magic happens - of course, we couldn't develop a full translator, but we gave it a good go!
es_es: <literal>TextTranslator</literal> es un bean con estado (con una interfaz local de negocios), donde lo mágico sucede - claro está, que no podemos desarrollar todo un traductor, pero le dimos una luz!
it_it: <literal>TextTranslator</literal> è un bean stateless (con un'interfaccia business locale), dove avviene la magia - naturalmente, non potevamo sviluppare un traduttore completo, ma gli abbiamo dato un buon avvio!
pt_br: <literal>TextTranslator</literal> é um bean stateless (com uma interface de negócios local), onde a mágica acontece . Obviamente, não poderíamos desenvolver um tradutor completo, mas lhe demos um bom caminho!
zh_tw: <literal>TextTranslator</literal> 是個無狀態的 bean（以及一個本地的商業介面）- 當然，我們無法開發一個完整的轉譯器。

source: Finally, there is UI orientated controller, that collects the text from the user, and dispatches it to the translator. This is a request scoped, named, stateful session bean, which injects the translator.
es_es: Por último, hay un controlador orientado UI que recoge el texto desde el usuario y lo envía al traductor. Esta es una petición en ámbito, llamada bean con estado de sesión que inyecta el traductor.
it_it: Infine, vi è un controller orientato all'UI, che raccoglie il testo dall'utente, e lo invia al traduttore. Questo è un bean stateful di sessione, dotato di nome, con scope richiesta, in cui viene iniettato il traduttore.
pt_br: Finalmente, há um controlador orientado à interface, que recolhe o texto do usuário e despacha para o tradutor. Esse é um escopo de requisição, com o nome, stateful session bean, que injeta o tradutor.
zh_tw: 最後，有個 UI 導向的控制器，它會藉由用戶收集文字然後將它發送給轉譯器。這是個請求導向、被命名，而有狀態的 session bean，並且會注入轉譯器。

source: The bean also has getters and setters for all the fields on the page.
es_es: El bean también tiene capturadores y configuradores para todos los campos en la página.
it_it: Il bean possiede pure dei metodi getter e setter per tutti i campi della pagina.
pt_br: O bean também tem getters e setters para todos os campos da página.
zh_tw: 這個 bean 針對於頁面上所有欄位都有 getter 與 setter。

source: As this is a stateful session bean, we have to have a remove method:
es_es: Como este es un bean de sesión con estado, tenemos que tener un método de eliminación:
it_it: Poichè si tratta di un bean stateful di sessione, è necessario un metodo di rimozione (remove method):
pt_br: Como esse é um stateful session bean, temos de ter um método de remoção:
zh_tw: 因為這是個 stateful（有狀態）的 session bean，因此我們必須要有個 remove method：

source: The Web Beans manager will call the remove method for you when the bean is destroyed; in this case at the end of the request.
es_es: El administrador de Web Beans llamará al método de eliminación cuando el bean sea destruido, en este caso al final de la petición.
it_it: Il manager Web Beans chiamerà il metodo di rimozione quando il bean verrà distrutto; in questo caso al termine della richiesta.
pt_br: O gerenciador do Web Beans chamará o método remover para você quando o bean for destruído - neste caso, no final da requisição.
zh_tw: 當 bean 被毀掉後，Web Bean 管理員會為您調用 remove 這個 method；在此情況下為請求結束之後。

source: That concludes our short tour of the Web Beans examples. For more on Web Beans , or to help out, please visit <ulink url="http://www.seamframework.org/WebBeans/Development">http://www.seamframework.org/WebBeans/Development</ulink>.
pt_br: Está encerrado o nosso curto passeio pelos exemplos de Web Beans. Para mais informações sobre a Web Beans, ou para ajudar, por favor visite <ulink url="http://www.seamframework.org/WebBeans/Development">http://www.seamframework.org/WebBeans/Development</ulink>.

source: We need help in all areas - bug fixing, writing new features, writing examples and translating this reference guide.
es_es: Necesitamos ayuda en todas las áreas - corrección de errores, escritura de nuevas funciones, escritura de ejemplos y traducción de esta guía de referencia.
it_it: Abbiamo bisogno di aiuto in tutte le aree - soluzione dei bug, scrittura di nuove caratteristiche ed esempi e traduzione di questa guida.
pt_br: Precisamos de ajuda em todas as áreas - correção de bugs, escrita de novas funcionalidades, escrita de exemplos e tradução deste guia de referência.
zh_tw: 我們在所有層面都需要協助 - 錯誤修正、編寫新功能、編寫範例，以及翻譯此參照指南。

source: The Web Beans Reference Implementation
es_es: La Implementación de referencia de Web Beans
it_it: Implementazione di riferimento di Web Beans
zh_tw: Web Bean 參照實做

source: The Web Beans Reference Implementation is being developed at <ulink url="http://seamframework.org/WebBeans">the Seam project</ulink>. You can download the latest developer release of Web Beans from the <ulink url="http://seamframework.org/Download">the downloads page</ulink>.
es_es: La implementación de referencia de Web Beans se desarrolla en <ulink url="http://seamframework.org/WebBeans">the Seam project</ulink>. La última versión de Web Beans se puede descargar desde <ulink url="http://seamframework.org/Download">the downloads page</ulink>.
it_it: La Web Beans Reference Implementation viene sviluppata all'indirizzo <ulink url="http://seamframework.org/WebBeans">the Seam project</ulink>. Si può scaricare l'ultima release di Web Beans dalla <ulink url="http://seamframework.org/Download">pagina di download</ulink>.
zh_tw: Web Bean 參照實作（Web Beans Reference Implementation）開發於 <ulink url="http://seamframework.org/WebBeans">the Seam project</ulink>。您可藉由 <ulink url="http://seamframework.org/Download">the downloads page</ulink> 來下載最新開發人員版本的 Web Bean。

source: The Web Beans RI comes with a two deployable example applications: <literal>webbeans-numberguess</literal>, a war example, containing only simple beans, and <literal>webbeans-translator</literal> an ear example, containing enterprise beans. To run the examples you'll need the following:
es_es: La IR de Web Beans viene con dos ejemplos de aplicaciones de despliegue: <literal>webbeans-numberguess</literal>, un ejemplo WAR, que contiene sólo beans sencillos y un ejemplo EAR <literal>webbeans-translator</literal> que contiene beans empresariales. Para ejecutar los ejemplos necesitará lo siguiente:
it_it: La Web Beans RI (Reference Implementation) viene distribuita con due applicazioni deployabili d'esempio, <literal>webbeans-numberguess</literal>, un esempio in formato war, che contiene solo bean semplici, e <literal>webbeans-translator</literal>, un esempio in formato ear, che contiene bean enterprise. Per eseguire gli esempi occorre fare le seguenti cose:
zh_tw: Web Bean RI 包含了兩個可建置的範例應用程式：<literal>webbeans-numberguess</literal>，這是個 war 範例，並且只包含著基本的 bean，以及 <literal>webbeans-translator</literal>，這是個 ear 範例，並包含著企業級的 bean。若要執行這些範例，您將需要滿足下列需求：

source: the latest release of the Web Beans RI,
es_es: la última versión de la IR de Web Beans,
it_it: l'ultima release di Web Beans RI,
zh_tw: 最新版本的 Web Beans RI、

source: JBoss AS 5.0.0.GA, and
es_es: JBoss AS 5.0.0.GA, y
zh_tw: JBoss AS 5.0.0.GA，以及

source: Currently, the Web Beans RI only runs on JBoss Application Server 5. You'll need to download JBoss AS 5.0.0.GA from <ulink url="http://www.jboss.org/jbossas/downloads/">jboss.org</ulink>, and unzip it. For example:
es_es: Actualmente, la IR de Web Beans sólo se ejecuta en JBoss Application Server 5. Necesitará descargar JBoss AS 5.0.0.GA desde <ulink url="http://www.jboss.org/jbossas/downloads/">jboss.org</ulink>, y descomprimirlo. Por ejemplo:
it_it: Attualmente, la RI di Web Beans può essere eseguita solo sull'Application Server 5 di JBoss. Occorre scaricare JBoss AS 5.0.0.GA da <ulink url="http://www.jboss.org/jbossas/downloads/">jboss.org</ulink>, e scompattarlo. Per esempio:
zh_tw: 目前，Web Beans RI 只能在 JBoss Application Server 5 上執行。您將需要由 <ulink url="http://www.jboss.org/jbossas/downloads/">jboss.org</ulink> 來下載 JBoss AS 5.0.0.GA，然後再將它解壓縮。例如：

source: Next, download the Web Beans RI from <ulink url="http://seamframework.org/Download">seamframework.org</ulink>, and unzip it. For example
es_es: Luego, descargue el IR de Web Beans desde <ulink url="http://seamframework.org/Download">seamframework.org</ulink>, y descomprímalo. Por ejemplo:
it_it: Scaricare Web Beans RI da <ulink url="http://seamframework.org/Download">seamframework.org</ulink>, e scompattarla. Per esempio
zh_tw: 接下來，請由 <ulink url="http://seamframework.org/Download">seamframework.org</ulink> 下載 Web Beans RI 並將它解壓縮。例如

source: As Web Beans is a new piece of software, you need to update JBoss AS to run the Web Beans RI. Future versions of JBoss AS will include these updates, and this step won't be necessary.
es_es: Como Web Beans es una nueva parte de software, necesitaremos actualizar JBoss AS para ejecutar el IR de Web Beans. Versiones futuras de JBOSS AS incluirán dichas actualizaciones, y este paso no será necesario.
it_it: Poiché Web Beans è un software nuovo, occorre aggiornare JBoss AS per poter eseguire la RI di Web Beans. Versioni future di JBoss AS includeranno questi update, e questa operazione non sarà necessaria.
zh_tw: 因為 Web Bean 是個新的軟體，您需要更新 JBoss AS 才可執行 Web Bean RI。未來版本的 JBoss AS 將會包含這些更新，因此這個步驟將可被忽略。

source: Currently, two updates are needed. Firstly, a new deployer, <literal>webbeans.deployer</literal> is added. This adds supports for Web Bean archives to JBoss AS, and allows the Web Beans RI to query the EJB3 container and discover which EJBs are installed in your application. Secondly, an update to JBoss EJB3 is needed.
es_es: Actualmente, se necesitan dos actualizaciones. Primero, se agrega el nuevo desarrollador, <literal>webbeans.deployer</literal>. Así se agrega soporte para los archivos de Web Bean a JBoss AS, y permite al IR de Web Beans solicitar el contenedor EJB3 y descubrir cuáles EJB están instalados en su aplicación. En segundo lugar se necesita una actualización de JBoss EJB3.
it_it: Attualmente, sono necessari due aggiornamenti. In primo luogo, occorre aggiungere un nuovo deployer, <literal>webbeans.deployer</literal> . Esso aggiunge JBoss AS il supporto per gli archivi Web Bean, e permette alla RI di Web Beans RI di interrogare il container EJB3 e scoprire quali EJB sono presenti nell'applicazione. In secondo luogo, è necessario un aggiornamento di JBoss EJB3.
zh_tw: 目前您需要兩個更新。首先一個新的建置器 <literal>webbeans.deployer</literal> 被新增了。這可為 JBoss AS 提供 Web Bean archive，並能讓 Web Bean RI 查詢 EJB3 container，並找出安裝在您應用程式中的 EJB 為何。接下來，您需要 JBoss EJB3 的更新。

source: To install the update, you'll need Ant 1.7.0 installed, and the <literal>ANT_HOME</literal> environment variable set. For example:
es_es: Para instalar la actualización, necesitaremos que Ant 1.7.0 esté instalado, y que la variable de entorno <literal>ANT_HOME</literal> esté configurada. Por ejemplo:
it_it: Per installare gli aggiornamenti, occorre avere installato Ant 1.7.0, e avere valorizzato la variabile d'ambiente <literal>ANT_HOME</literal>. Per esempio:
zh_tw: 若要安裝更新，您將需要先安裝 Ant 1.7.0，並設置 <literal>ANT_HOME</literal> 環境變數。例如：

source: Then, you can install the update. The update script will use Maven to download the Web Beans and EJB3 automatically.
es_es: Luego, puede instalar la actualización. La actualización utiliza Maven para descargar automáticamente el Web Beans y EJB3.
it_it: Quindi, è possibile installare gli aggiornamenti. Lo script di aggiornamento userà Maven per scaricare automaticamente Web Beans e EJB3.
zh_tw: 接下來，您便可安裝更新。更新 script 將會使用 Maven 來自動地下載 Web Bean 以及 EJB3。

source: The build scripts for the examples offer a number of targets, these are:
es_es: Los scripts creados para los ejemplos ofrecen una cantidad de objetivos, a saber:
it_it: Gli script di build degli esempio offrono una quantità di target, cioè:
zh_tw: 這些範例的建置 script 提供了一些目標，它們包含了：

source: The Web Beans RI includes a second simple example that will translate your text into Latin. The numberguess example is a war example, and uses only simple beans; the translator example is an ear example, and includes enterprise beans, packaged in an EJB module. To try it out:
es_es: El IR de Web Beans RI incluye un segundo ejemplo que traducirá su texto en Latín. El ejemplo numberguess es un ejemplo WAR, y sólo utiliza beans sencillos; el ejemplo de traductor es un ejemplo EAR e incluye beans empresariales, empaquetados en un módulo EJB. Para probar:
it_it: La RI di Web Beans include un secondo semplice esempio che tradurrà i vostri testi in Latino. L'esempio Indovina Numero è in formato war, e usa soltanto bean semplici; l'esempio col traduttore è in formato ear, e include dei bean enterprise, assemblati in un modulo EJB. Per provarlo:
zh_tw: Web Bean RI 包含了第二個基本範例，它可將您的文字轉譯為拉丁文。numberguess 範例為一個 war 範例，並且只使用基本的 bean；轉譯器範例則為 ear 範例，並且包含著企業級的 bean，封裝於一個 EJB 模組中。若要嘗試：
