Repository: 1tchy/core
Catalog: reference/*/ri.po
Languages: es_es, it_it, pt_br, zh_tw

source: Web Beans, the Reference Implementation of JSR-299
pt_br: Web Beans, a Implementação de Referência da JSR-299

source: The Web Beans is being developed at <ulink url="http://seamframework.org/WebBeans">the Seam project</ulink>. You can download the latest developer release of Web Beans from the <ulink url="http://seamframework.org/Download">the downloads page</ulink>.
pt_br: A Web Beans está sendo desenvolvida no <ulink url="http://seamframework.org/WebBeans">projeto Seam</ulink>. Você pode baixar a última versão da Web Beans na <ulink url="http://seamframework.org/Download">página de downloads</ulink>.

source: Web Beans comes with a two deployable example applications: <literal>webbeans-numberguess</literal>, a war example, containing only simple beans, and <literal>webbeans-translator</literal> an ear example, containing enterprise beans. There are also two variations on the numberguess example, the tomcat example (suitable for deployment to Tomcat) and the jsf2 example, which you can use if you are running JSF2. To run the examples you'll need the following:
pt_br: A Web Beans vem com duas aplicações de exemplo: <literal>webbeans-numberguess</literal> - um war, contendo apenas beans simples (simple beans) e <literal>webbeans-translator</literal>, e um ear, contendo beans corporativos (enterprise beans) -. Existem ,ainda, duas variações do exemplo numberguess: o exemplo tomcat (adequado para a implantação no Tomcat) e o exemplo jsf2, que você pode usar se estiver utilizando JSF2. Para executar os exemplos, você precisará do seguinte:

source: the latest release of Web Beans,
pt_br: a última versão da Web Beans,

source: JBoss AS 5.0.1.GA, or
pt_br: JBoss AS 5.0.1.GA, e

source: Apache Tomcat 6.0.x, and
pt_br: Apache Tomcat 6.0.x, e

source: Using JBoss AS 5
pt_br: Utilizando o JBoss AS 5

source: You'll need to download JBoss AS 5.0.1.GA from <ulink url="http://www.jboss.org/jbossas/downloads/">jboss.org</ulink>, and unzip it. For example:
pt_br: Você precisará fazer o download do JBoss AS 5.0.1.GA em <ulink url="http://www.jboss.org/jbossas/downloads/">jboss.org</ulink> e descompactá-lo. Por exemplo:"

source: Next, download Web Beans from <ulink url="http://seamframework.org/Download">seamframework.org</ulink>, and unzip it. For example
pt_br: Depois, faça o download da Web Beans em <ulink url="http://seamframework.org/Download">seamframework.org</ulink> e descompacte-o. Por exemplo

source: <![CDATA[$ cd ~/ $ unzip ~/webbeans-$VERSION.zip]]>
pt_br: <![CDATA[$ cd ~/ $ unzip ~/webbeans-1.0.0.ALPHA1.zip]]>

source: Next, we need to tell Web Beans where JBoss is located. Edit <literal>jboss-as/build.properties</literal> and set the <literal>jboss.home</literal> property. For example:
es_es: Después necesitaremos decirle a Web Beans en dónde está localizado JBoss. Editar <literal>jboss-as/build.properties</literal> y establecer la propiedad <literal>jboss.home</literal>. Por ejemplo:
it_it: Quindi, occorre indicare a Web Beans dove è stato installato JBoss. Modificate il file <literal>jboss-as/build.properties</literal> e valorizzate la proprietà <literal>jboss.home</literal>. Per esempio:
pt_br: Em seguida, temos de dizer aos Web Beans onde o JBoss está localizado. Editar o <literal>jboss-as/build.properties</literal> e definir a propriedade <literal>jboss.home</literal>. Por exemplo:
zh_tw: 接下來，我們需要讓 Web Bean 知道 JBoss 的位置在哪裡。請編輯 <literal>jboss-as/build.properties</literal> 然後設置 <literal>jboss.home</literal> 內容。例如：

source: To install Web Beans, you'll need Ant 1.7.0 installed, and the <literal>ANT_HOME</literal> environment variable set. For example:
pt_br: Para instalar a Web Beans, você precisará do Ant 1.7.0 instalado e a variável de ambiente <literal>ANT_HOME</literal> setada. Por exemplo:

source: Then, you can install the update. The update script will use Maven to download Web Beans automatically.
pt_br: Então, você pode instalar a atualização. O script de atualização utilizará o Maven para fazer o download da Web Beans automaticamente.

source: $ cd webbeans-$VERSION/jboss-as $ ant update
pt_br: $ cd webbeans-1.0.0.ALPHA1/jboss-as $ ant update

source: Now, you're ready to deploy your first example!
es_es: Ahora, ¡está listo para desplegar su primer ejemplo!
it_it: Ora, siete pronti a fare il deploy del primo esempio!
pt_br: Agora, você está pronto para fazer a publicação do seu primeiro exemplo!
zh_tw: 現在，您已準備好建置您的第一個範例！

source: The build scripts for the examples offer a number of targets for JBoss AS, these are:
pt_br: Os scripts para criar os exemplos oferecem uma série de alvos para JBoss AS, entre eles:

source: <literal>ant restart</literal> - deploy the example in exploded format
es_es: <literal>ant restart</literal> - despliega el ejemplo en formato explotado
it_it: <literal>ant restart</literal> - fa il deploy dell'esempio in formato esploso
pt_br: <literal>ant restart</literal> - implanta o exemplo no formato explodido
zh_tw: <literal>ant restart</literal> - 以分解的格式來建置範例

source: <literal>ant explode</literal> - update an exploded example, without restarting the deployment
es_es: <literal>ant explode</literal> - actualiza un ejemplo explotado, sin reiniciar el despliegue
it_it: <literal>ant explode</literal> - aggiorna un esempio in formato esploso, senza riavviare il deploy
pt_br: <literal>ant explode</literal> - atualiza o exemplo explodido, sem reiniciar
zh_tw: <literal>ant explode</literal> - 在不重新建置的情況下更新一個已分解的範例

source: <literal>ant deploy</literal> - deploy the example in compressed jar format
es_es: <literal>ant deploy</literal> - despliega el ejemplo en formato JAR comprimido
it_it: <literal>ant deploy</literal> - fa il deploy dell'esempio in formato jar compresso
pt_br: <literal>ant deploy</literal> - implanta o exemplo no formato jar compactado
zh_tw: <literal>ant deploy</literal> - 以 jar 格式來建置範例

source: <literal>ant undeploy</literal> - remove the example from the server
es_es: <literal>ant undeploy</literal> - quita el ejemplo del servidor
it_it: <literal>ant undeploy</literal> - rimuove l'esempio dal server
pt_br: <literal>ant undeploy</literal> - remove o exemplo do servidor
zh_tw: <literal>ant undeploy</literal> - 將範例由伺服器中移除

source: <literal>ant clean</literal> - clean the example
es_es: <literal>ant clean</literal> - borra el ejemplo
it_it: <literal>ant clean</literal> - ripulisce l'esempio
pt_br: <literal>ant clean</literal> - limpa o exemplo
zh_tw: <literal>ant clean</literal> - 清除範例

source: To deploy the numberguess example:
es_es: Para desplegar el ejemplo numberguess:
it_it: Per fare il deploy dell'esempio Indovina Numero:
pt_br: Para implantar o exemplo numberguess:
zh_tw: 若要建置 numberguess 範例：

source: Start JBoss AS:
pt_br: Inicializando o JBoss AS:

source: If you use Windows, use the <literal>run.bat</literal>script.
pt_br: Se você utiliza o Windows, utilize o script <literal>run.bat</literal>.

source: Wait for the application to deploy, and enjoy hours of fun at <ulink url="http://localhost:8080/webbeans-numberguess"></ulink>!
es_es: Espere que despliegue la aplicación, y diviértase en <ulink url="http://localhost:8080/webbeans-numberguess"></ulink>!
it_it: Attendete che l'applicazione sia installata, e godetevi ore di divertimento all'indirizzo <ulink url="http://localhost:8080/webbeans-numberguess"></ulink>!
pt_br: Aguarde até que a aplicação seja implantada, e desfrute de horas de diversão em <ulink url="http://localhost:8080/webbeans-numberguess"></ulink>!
zh_tw: 請等待應用程式的建置，然後在 <ulink url="http://localhost:8080/webbeans-numberguess"></ulink> 花上幾個小時！

source: Web Beans includes a second simple example that will translate your text into Latin. The numberguess example is a war example, and uses only simple beans; the translator example is an ear example, and includes enterprise beans, packaged in an EJB module. To try it out:
pt_br: Web Beans inclui um segundo exemplo simples que irá traduzir o seu texto para o Latim. O exemplo numberguess é um war e usa apenas beans simples; o exemplo translator é um exemplo ear e inclui benas corporativos, empacotados em um módulo EJB. Para experimentá-lo:

source: Wait for the application to deploy, and visit <ulink url="http://localhost:8080/webbeans-translator"></ulink>!
es_es: Espere a que despliegue la aplicación, y ¡visite <ulink url="http://localhost:8080/webbeans-translator"></ulink>!
it_it: Attendete che l'applicazione sia installata, e visitate l'indirizzo <ulink url="http://localhost:8080/webbeans-translator"></ulink>!
pt_br: Aguarde até que a aplicação seja implantada, e acesse <ulink url="http://localhost:8080/webbeans-translator"></ulink>!
zh_tw: 請等待應用程式的建置並進入 <ulink url="http://localhost:8080/webbeans-translator"></ulink>！

source: Using Apache Tomcat 6.0
pt_br: Utilizando o Apache Tomcat 6.0

source: You'll need to download Tomcat 6.0.18 or later from <ulink url="http://tomcat.apache.org/download-60.cgi">tomcat.apache.org</ulink>, and unzip it. For example:
pt_br: Depois, faça o download do Tomcat 6.0.18 ou posterior em <ulink url="http://tomcat.apache.org/download-60.cgi">tomcat.apache.org</ulink>, e descompacte-o. Por exemplo

source: Next, we need to tell Web Beans where Tomcat is located. Edit <literal>jboss-as/build.properties</literal> and set the <literal>tomcat.home</literal> property. For example:
pt_br: Em seguida, temos de dizer aos Web Beans onde o Tomcat está localizado. Editar o <literal>jboss-as/build.properties</literal> e definir a propriedade <literal>tomcat.home</literal>. Por exemplo:

source: The build scripts for the examples offer a number of targets for Tomcat, these are:
pt_br: Os scripts para criar os exemplos oferecem uma série de alvos para Tomcat. São eles:

source: <literal>ant tomcat.restart</literal> - deploy the example in exploded format
pt_br: <literal>ant tomcat.restart</literal> - publica o exemplo no formato explodido

source: <literal>ant tomcat.explode</literal> - update an exploded example, without restarting the deployment
pt_br: <literal>ant tomcat.explode</literal> - atualiza o exemplo explodido, sem reiniciar

source: <literal>ant tomcat.deploy</literal> - deploy the example in compressed jar format
pt_br: <literal>ant tomcat.deploy</literal> - publica o exemplo no formato jar compactado

source: <literal>ant tomcat.undeploy</literal> - remove the example from the server
pt_br: <literal>ant tomcat.undeploy</literal> - remove o exemplo do servidor

source: To deploy the numberguess example for tomcat:
pt_br: Para implantar o exemplo numberguess no tomcat:

source: Start Tomcat:
pt_br: Inicializando o Tomcat:

source: If you use Windows, use the <literal>startup.bat</literal>script.
pt_br: Se você utiliza o Windows, utilize o script <literal>startup.bat</literal>.

source: Using GlassFish
pt_br: Utilizando o GlassFish

source: The numberguess example
es_es: El ejemplo numberguess
it_it: Esempio Indovina Numero
pt_br: O exemplo numberguess
zh_tw: numberguess 範例

source: In the numberguess application you get given 10 attempts to guess a number between 1 and 100. After each attempt, you will be told whether you are too high, or too low.
es_es: En la aplicación numberguess se le dan 10 intentos para adivinar un número de 1 a 100. Después de cada intento, se le dirá si es mayor o menor a su número.
it_it: Nell'applicazione Indovina Numero avete a disposizione 10 tentativi per indovinare un numero tra 1 e 100. Dopo ciascun tentativo, siete informati se siete stati troppo alti o troppo bassi.
pt_br: Na aplicação numberguess você terá 10 tentativas para adivinhar um número entre 1 e 100. Após cada tentativa, você será informado se você disse muito acima, ou muito abaixo.
zh_tw: 在 numberguess 應用程式中，您將會有 10 次機會來猜一個介於 1 至 100 之間的號碼。每當猜過一遍，系統便會告知您您所輸入的數字是否太大或太小。

source: The numberguess example is comprised of a number of Web Beans, configuration files, and Facelet JSF pages, packaged as a war. Let's start with the configuration files.
es_es: El ejemplo de numberguess consta de una cantidad de Web Beans, archivos de configuración y páginas Facelet JSF, empaquetadas como WAR. Empecemos con los archivos de configuración.
it_it: L'esempio Indovina Numero comprende un certo numero di Web Bean, file di configurazione e pagine JSF, assemblati in un war. Iniziamo dai file di configurazione.
pt_br: O exemplo numberguess é composto de um número de Web Beans, arquivos de configuração e páginas Facelet JSF , empacotados como um war. Vamos começar com os arquivos de configuração.
zh_tw: numberguess 範例包含了 Web Bean 的一個數字、配置檔案，以及 Facelet JSF 頁面，並且封裝為 war。讓我們先從配置檔案開始。

source: All the configuration files for this example are located in <literal>WEB-INF/</literal>, which is stored in <literal>WebContent</literal> in the source tree. First, we have <literal>faces-config.xml</literal>, in which we tell JSF to use Facelets:
es_es: Todos los archivos de configuración para este ejemplo están localizados en <literal>WEB-INF/</literal>, el cual está almacenado en <literal>WebContent</literal> en el árbol fuente. Primero, tenemos <literal>faces-config.xml</literal>, en donde le pedimos a JSF que utilice Facelets:
it_it: Tutti i file di configurazione di questo esempio si trovano in <literal>WEB-INF/</literal>, che è situato in <literal>WebContent</literal> nell'albero dei sorgenti. Innanzitutto, c'è <literal>faces-config.xml</literal>, in cui JSF viene informata di usare Facelets:
pt_br: Todos os arquivos de configuração para este exemplo estão localizados no <literal>WEB-INF/</literal>, que é armazenado no <literal>WebContent</literal> na árvore de fontes. Primeiro, temos <literal>faces-config.xml</literal>, onde dizemos para o JSF usar o Facelets:
zh_tw: 此範例的所有配置檔案都位於 <literal>WEB-INF/</literal> 中，並且它又儲存在來源樹中的 <literal>WebContent</literal> 裡。首先，我們有個可使用來指定 JSF 來使用 Facelet 的 <literal>faces-config.xml</literal>：

source: There is an empty <literal>web-beans.xml</literal> file, which marks this application as a Web Beans application.
es_es: Hay un archivo<literal>web-beans.xml</literal> vacío, el cual marca esta aplicación como una aplicación de Web Beans.
it_it: Vi è un file vuoto <literal>web-beans.xml</literal>, che identifica l'applicazione come applicazione Web Beans.
pt_br: Existe um arquivo <literal>web-beans.xml</literal> vazio, que assinala essa aplicação como uma aplicação Web Beans.
zh_tw: 有個空的 <literal>web-beans.xml</literal> 檔案，它會將此應用程式標記為一個 Web Bean 應用程式。

source: Finally there is <literal>web.xml</literal>:
es_es: Por último, está <literal>web.xml</literal>:
it_it: Infine c'è <literal>web.xml</literal>:
pt_br: Finalmente no <literal>web.xml</literal>:
zh_tw: 最後為 <literal>web.xml</literal>：

source: The example exists of 4 classes, the first two of which are binding types. First, there is the <literal>@Random</literal> binding type, used for injecting a random number:
es_es: El ejemplo existe de 4 clases, las primeras dos de las cuales son tipos de enlace. Primero, hay un tipo de enlace <literal>@Random</literal>, utilizado para inyectar un número aleatorio:
it_it: L'esempio consiste di 4 classi, delle quali le prime due sono tipi di binding. Innanzitutto, c'è il tipo di binding <literal>@Random</literal>, usato per iniettare un numero casuale:
pt_br: No exemplo, existem 4 classes: as duas primeiras são tipos de binding. Primeiro, há o tipo de binding <literal>@Random</literal>, utilizado para a injeção de um número aleatório:
zh_tw: 範例存有 4 個類別，前兩個為綁定類型。首先，有個使用來注入亂數號碼的 <literal>@Random</literal> 綁定類型：

source: There is also the <literal>@MaxNumber</literal> binding type, used for injecting the maximum number that can be injected:
es_es: También hay un tipo de enlace <literal>@MaxNumber</literal>, utilizado para inyectar el número máximo posible:
it_it: C'è anche il tipo di binding <literal>@MaxNumber</literal>, usato per iniettare il numero massimo iniettatabile:
pt_br: Há também o binding type <literal>@MaxNumber</literal>, utilizado para injetar o número máximo que pode ser injetado:
zh_tw: 還有個用來注入可注入之最大號碼的 <literal>@MaxNumber</literal> 綁定類型：

source: The <literal>Generator</literal> class is responsible for creating the random number, via a producer method. It also exposes the maximum possible number via a producer method:
es_es: La clase <literal>Generator</literal> es responsable de crear el número aleatorio, a través de un método de productor. También expone el número máximo posible a través del método de productor:
it_it: Alla classe <literal>Generator</literal> è affidata la generazione del numero casuale, per mezzo di un metodo produttore. Inoltre essa espone il massimo numero possibile attraverso un metodo produttore:
pt_br: A classe <literal>Generator</literal> é responsável por criar um número aleatório, através de um método produtor. Ela também expõe o número máximo possível através de um método produtor:
zh_tw: <literal>Generator</literal> 類別負責透過產生器的方式來建立亂數號碼。它也會透過一個產生器的方式來顯示最大的可能號碼：

source: You'll notice that the <literal>Generator</literal> is application scoped; therefore we don't get a different random each time.
es_es: Notará que el <literal>Generador</literal> es una aplicación en ámbito por lo tanto no obtenemos un número aleatorio diferente cada vez.
it_it: E' possibile notare che <literal>Generator</literal> ha scope applicazione; quindi non si ottiene un diverso numero casuale ogni volta.
pt_br: Você perceberá que o <literal>Generator</literal> está no escopo de aplicação; portanto, não obtemos um número aleatório diferente a cada vez.
zh_tw: 您將會注意到 <literal>Generator</literal> 是屬於應用程式導向的；因此，我們不會每次都一定能得到不同的亂數號碼。

source: The final Web Bean in the application is the session scoped <literal>Game</literal>.
es_es: El Web Bean final en la aplicación es la sesión en ámbito <literal>Juego</literal>.
it_it: Il Web Bean finale nell'applicazione è <literal>Game</literal> avente scope di sessione.
pt_br: O Web Bean final da aplicação é o <literal>Game</literal> em escopo de sessão.
zh_tw: 應用程式中最後的 Web Bean 為 session 導向的 <literal>Game</literal>。

source: You'll note that we've used the <literal>@Named</literal> annotation, so that we can use the bean through EL in the JSF page. Finally, we've used constructor injection to initialize the game with a random number. And of course, we need to tell the player when they've won, so we give feedback with a <literal>FacesMessage</literal>.
es_es: Notará que hemos utilizado la anotación <literal>@Named</literal>, para poder utilizar el bean a través de EL en la página JSF. Por último, hemos utilizado la inyección de constructor para inicializar el juego con un número aleatorio. Y, claro está, necesitamos decirle al jugador cuando haya ganado, por lo tanto le damos retroalimentación con <literal>FacesMessage</literal>.
it_it: Si noti anche che è stata usata l'annotazione <literal>@Named</literal>, in modo che sia possibile usare il bean in espressioni EL presenti nelle pagine JSF. Infine, si è utilizzata l'iniezione del costruttore per inizializzare il gioco con un numero casuale. E naturalmente, è necessario dire al giocatore se ha vinto, informazione di feedback che viene fornita con un <literal>FacesMessage</literal>.
pt_br: Você notará que nós utilizamos a anotação <literal>@Named</literal>, para que possamos utilizar o bean através EL na página JSF. Finalmente, utilizamos injeção de construtor para inicializar o jogo com um número aleatório. E, claro, precisamos de dizer ao jogador quando ele venceu. Por isso, informaremos através do <literal>FacesMessage</literal>.
zh_tw: 您將會注意到我們使用了 <literal>@Named</literal> 標記，如此一來我們便可在 JSF 頁面中的 EL 上使用這個 bean。最後，我們使用了 constructor injection 來利用亂數號碼來初始化了這個遊戲。當然，當玩家贏時我們將需要告知玩家，並藉由一個 <literal>FacesMessage</literal> 來給予回應。

source: The numberguess example for Tomcat
pt_br: O exemplo numberguess para o Tomcat

source: The numberguess for Tomcat differs in a couple of ways. Firstly, Web Beans should be deployed as a Web Application library in <literal>WEB-INF/lib</literal>. For your convenience we provide a single jar suitable for running Web Beans on Tomcat <literal>webbeans-tomcat.jar</literal>.
pt_br: O numberguess para Tomcat difere em várias maneiras. Em primeiro lugar, Web Beans devem ser implementados como uma biblioteca de aplicação Web em <literal>WEB-INF/lib</literal>. Para sua comodidade, fornecemos um único jar adequado para executar Web Beans no Tomcat <literal>webbeans-tomcat.jar</literal>.

source: Of course, you must also include JSF and EL, as well common annotations (<literal>jsr250-api.jar</literal>) which a JEE server includes by default.
pt_br: Claro, você também deve incluir JSF e EL, bem como anotações comuns (common annotations) (<literal>jsr250-api.jar</literal>), que um servidor JEE inclui por padrão.

source: Secondly, we need to explicitly specify the Tomcat servlet listener (used to boot Web Beans, and control it's interaction with requests) in <literal>web.xml</literal>:
pt_br: Em segundo lugar, precisamos indicar explicitamente o Tomcat servlet listener (utilizado para "bootar" a Web Beans, e controlar sua interação com as requisições) no <literal>web.xml</literal>:

source: The translator example
es_es: Ejemplo del traductor
it_it: Esempio Traduttore
pt_br: O exemplo translator
zh_tw: 轉譯器範例

source: The translator example will take any sentences you enter, and translate them to Latin.
es_es: El ejemplo de traductor tomará las oraciones que entre y las traducirá en Latín.
it_it: L'esempio Traduttore prende le frasi che vengono inserite e le traduce in latino.
pt_br: O exemplo translator pegará qualquer frase que você fornecer e a traduzirá para o Latim.
zh_tw: 轉譯器範例能接受您所輸入的任何句子，然後將它們翻譯成拉丁文。

source: The translator example is built as an ear, and contains EJBs. As a result, it's structure is more complex than the numberguess example.
es_es: El ejemplo de traductor está incorporado como un EAR, y contiene EJB. Como resultado, su estructura es más compleja que el ejemplo de Numberguess.
it_it: L'esempio Traduttore è assemblato in un ear, e contiene EJB. Di conseguenza, la sua struttura è più complessa di quella dell'esempio Indovina Numero.
pt_br: O exemplo translator é construído como um ear e contém EJBs. Como resultado, a sua estrutura é mais complexa do que o exemplo numberguess.

source: EJB 3.1 and Jave EE 6 allow you to package EJBs in a war, which will make this structure much simpler!
es_es: EJB 3.1 y Java EE 6 le permiten empaquetar EJB en un WAR, lo cual hará la estructura mucho más simple!
it_it: EJB 3.1 and Java EE 6 permettono di assemblare gli EJB in un war, cosa che rende questa struttura molto più semplice!
pt_br: EJB 3.1 e Java EE 6 permitem a você empacotar EJBs em um war, o que tornará esta estrutura muito mais simples!
zh_tw: EJB 3.1 和 Jave EE 6 能讓您將 EJB 封裝為 war，並使得該結構變得更為簡樸！

source: First, let's take a look at the ear aggregator, which is located in <literal>webbeans-translator-ear</literal> module. Maven automatically generates the <literal>application.xml</literal> for us:
es_es: Primero, demos una mirada al agregador EAR, el cual está localizado en el módulo <literal>webbeans-translator-ear</literal>. Maven genera automáticamente la <literal>application.xml</literal>:
it_it: Innanzitutto, diamo un'occhiata all'aggregatore ear, che è situato nel modulo <literal>webbeans-translator-ear</literal>. Maven genera automaticamente il file <literal>application.xml</literal>:
pt_br: Primeiro, vamos dar uma olhada no ear aggregator, que está localizado módulo <literal>webbeans-translator-ear</literal>. Maven gera automaticamente o<literal>application.xml</literal> para nós:
zh_tw: 首先，讓我們先來看一下 ear 聚合器，它位於 <literal>webbeans-translator-ear</literal> 模組中。Maven 會自動地為我們產生 <literal>application.xml</literal>：
