Repository: 1tchy/core
Catalog: reference/*/scopescontexts.po
Languages: de_de, es_es, it_it, zh_tw

source: Scopes and contexts
de_de: Geltungsbereiche und Kontexte
es_es: Ámbitos y contextos
it_it: Scope e contesti
zh_tw: Scope 與 context

source: So far, we've seen a few examples of <emphasis>scope type annotations</emphasis>. The scope of a Web Bean determines the lifecycle of instances of the Web Bean. The scope also determines which clients refer to which instances of the Web Bean. According to the Web Beans specification, a scope determines:
de_de: Bis jetzt haben wir ein paar Beispiele von <emphasis>Geltungsbereichtyp-Annotationen</emphasis> gesehen. Der Geltungsbereich eines Web Beans bestimmt den Lebenszyklus der Instanzen des Web Beans. Der Geltungsbereich bestimmt auch, welche Clients sich auf welche Instanzen des Web Beans beziehen. Gemäß der Web Beans Spezifikation bestimmt ein Geltungsbereich:
es_es: Hasta ahora, hemos visto algunos ejemplos de <emphasis>anotaciones de tipo ámbito</emphasis>. El ámbito de un Web Bean determina el ciclo de vida de instancias del Web Bean. El ámbito también determina qué clientes se refieren a qué instancias del Web Bean. Según la especificación de Web Beans, un ámbito determina:
it_it: Finora si sono visti pochi esempi di <emphasis>annotazioni di tipi di scope</emphasis>. Gli scope di un Web Bean determinano il ciclo di vita del Web Bean. Lo scope determina anche quali client fanno riferimento a quali istanze di Web Bean. Secondo la specifica Web Bean, uno scope determina:
zh_tw: 到目前為止，我們已見過了一些 <emphasis>scope 類型標記（scope type annotations）</emphasis>的範例了。Web Bean 的 scope 可決定 Web Bean instance 的生命週期（lifecycle）。Scope 也能決定哪個客戶端參照哪個 Web Bean 的 instance。根據 Web Bean 規格，scope 可決定：

source: When a new instance of any Web Bean with that scope is created
de_de: Wann eine neue Instanz eines beliebigen Web Beans mit diesem Geltungsbereich erstellt wird
es_es: Cuándo se crea una nueva instancia de un Web Bean con ese ámbito
it_it: Quando una nuova istanza di un Web Bean con tale scope viene creata
zh_tw: 任何含有該 scope 的 Web Bean 的新 instance 應何時被建立

source: When an existing instance of any Web Bean with that scope is destroyed
de_de: Wenn eine bestehende Instanz eines beliebigen Web Beans mit diesem Geltungsbereich gelöscht wird
es_es: Cuándo se destruye una instancia existente de cualquier Web Bean con ese ámbito
it_it: Quando un'istanza esistente di un Web Bean con tale scope viene distrutta
zh_tw: 任何含有該 scope 的 Web Bean 的現有 instance 應何時被刪除

source: Which injected references refer to any instance of a Web Bean with that scope
de_de: Welche eingespeisten Referenzen auf eine beliebige Instanz eines Web Beans mit diesem Geltungsbereich verweisen
es_es: Qué referencias se refieren a una instancia de un Web Bean con ese ámbito
it_it: Quali riferimenti iniettati puntano a istanze di un Web Bean con tale scope
zh_tw: 哪個被注入的參照代表含有該 scope 的 Web Bean 的任何 instance

source: For example, if we have a session scoped Web Bean, <literal>CurrentUser</literal>, all Web Beans that are called in the context of the same <literal>HttpSession</literal> will see the same instance of <literal>CurrentUser</literal>. This instance will be automatically created the first time a <literal>CurrentUser</literal> is needed in that session, and automatically destroyed when the session ends.
de_de: Wenn wir etwa ein session-begrenztes Web Bean <literal>CurrentUser</literal> haben, so sehen alle Web Beans, die im Kontext derselben <literal>HttpSession</literal> aufgerufen werden, dieselbe Instanz von <literal>CurrentUser</literal>. Diese Instanz wird automatisch erstellt, wenn <literal>CurrentUser</literal> erstmals in dieser Session benötigt wird und automatisch gelöscht, wenn die Session endet.
es_es: Por ejemplo, si tenemos una sesión con ámbito Web Bean, <literal>UsuarioActual</literal>, todos los Web Beans que son llamados en el contexto de la misma <literal>HttpSession</literal> verán la misma instancia del <literal>UsuarioActual</literal>. Dicha instancia se creará automáticamente la primera vez que se necesite un <literal>UsuarioActual</literal> en esa sesión, y se destruirá automáticamente al terminar la sesión.
it_it: Per esempio, se esiste un Web Bean con scope di sessione, <literal>CurrentUser</literal>, tutti i Web Bean che vengono chiamati nel contesto della medesima <literal>HttpSession</literal> vedranno la stessa istanza di <literal>CurrentUser</literal>. Quest'istanza verrà automaticamente creata la prima volta che in tale sessione occorre <literal>CurrentUser</literal>, e verrà distrutta automaticamente quando la sessione termina.
zh_tw: 比方說若我們有個 session scope 的 Web Bean <literal>CurrentUser</literal>，那麼所有在相同 <literal>HttpSession</literal> 的 context 中被調用的 Web Bean 都會看見相同的 <literal>CurrentUser</literal> 的 instance。當 <literal>CurrentUser</literal> 在該 session 中第一次被需要時，這個 instance 就會自動地被建立，並且在這個 session 結束時被自動地刪除掉。

source: Scope types
de_de: Typen von Geltungsbereichen
es_es: Tipos de ámbito
it_it: Tipi di scope
zh_tw: Scope type

source: Web Beans features an <emphasis>extensible context model</emphasis>. It is possible to define new scopes by creating a new scope type annotation:
de_de: Web Beans besitzen ein <emphasis>erweiterbares Kontextmodell</emphasis>. Es ist möglich, neue Geltungsbereiche zu definieren, indem man eine neue Annotation für einen Geltungsbereich-Typ erstellt:
es_es: Web Beans ofrece un <emphasis>modelo contextual extensible</emphasis>. Es posible definir nuevos ámbitos creando una nueva anotación de tipo de ámbito:
it_it: Web Bean fornisce un <emphasis>modello di contesto estensibile</emphasis>. E' possibile definire nuovi scope creando una nuova annotazione di un tipo di scope.
zh_tw: Web Bean 含有著一個 <emphasis>extensible context model（可延伸的 context 模型）</emphasis>。您可藉由建立新的 scope 類型標記來定義新的 scope：

source: Of course, that's the easy part of the job. For this scope type to be useful, we will also need to define a <literal>Context</literal> object that implements the scope! Implementing a <literal>Context</literal> is usually a very technical task, intended for framework development only.
de_de: Natürlich ist dies der einfache Teil des Jobs. Damit dieser Typ von Geltungsbereich von Nutzen ist, müssen wir außerdem ein <literal>Context</literal>-Objekt definieren, das den Geltungsbereich implementiert! Die Implementierung eines <literal>Context</literal> ist in der Regel ein sehr technisches Unterfangen, das nur für Framework-Entwicklung vorgesehen ist.
es_es: Claro está que esa es la parte fácil. Para que este tipo de ámbito sea útil, necesitaremos también definir un objeto <literal>Contexto</literal> que implemente el ámbito. La implementación de un <literal>Contexto</literal> suele ser una tarea muy técnica, únicamente destinada a desarrollo de marco.
it_it: Sicuramente questa è la parte facile del lavoro. Affinché questo tipo di scope sia utile, avremo bisogno di definire un oggetto <literal>Contesto</literal> che implementi lo scope! Implementare un <literal>Contesto</literal> è compito molto tecnico, inteso solo per lo sviluppo di framework.
zh_tw: 當然，那是這項工作中最簡單的部份。若要此 scope 類型能被有效使用，我們還需要定義一個能夠實做該 scope 的 <literal>Context</literal> 物件！實做一個 <literal>Context</literal> 通常是一項非常技術性的工作，這只應使用於架構開發（framework development）上。

source: We can apply a scope type annotation to a Web Bean implementation class to specify the scope of the Web Bean:
de_de: Wir können eine Annotation eines Geltungsbereich-Typs an einer Web Bean Implementierungsklasse anwenden, um den Geltungsbereich des Web Beans festzulegen:
es_es: Podemos aplicar un tipo de anotación de ámbito a una clase de implementación de Web Bean para especificar el ámbito del Web Bean:
it_it: Si può applicare un'annotazione con un tipo scope ad una classe di implementazione Web Bean per specificare lo scope del Web Bean:
zh_tw: 我們可套用一個 scope 類型標記至一個 Web Bean 實做 class 來指定 Web Bean 的 scope：

source: Usually, you'll use one of Web Beans' built-in scopes.
de_de: In der Regel verwenden Sie einen der eingebauten Geltungsbereiche der Web Beans.
es_es: Por lo general, se utilizará uno de los ámbitos incorporados de Web Beans.
it_it: Solitamente si userà uno degli scopi predefiniti di Web Beans.
zh_tw: 您通常會使用到其中一個 Web Bean 的內建 scope。

source: Built-in scopes
de_de: Eingebaute Geltungsbereiche
es_es: Ámbitos incorporados
it_it: Scope predefiniti
zh_tw: 內建 scope

source: Web Beans defines four built-in scopes:
de_de: Web Beans definiert vier eingebaute Geltungsbereiche:
es_es: Web Beans define cuatro ámbitos incorporados:
it_it: Web Beans definisce quattro scope predefiniti:
zh_tw: Web Bean 定義了四個內建的 scope：

source: For a web application that uses Web Beans:
de_de: Für eine Web Beans verwendende Webanwendung:
es_es: Para una aplicación de red que utilice Web Beans:
it_it: Per un'applicazione web che impiega Web Beans:
zh_tw: 使用 Web Bean 的網站應用程式：

source: any servlet request has access to active request, session and application scopes, and, additionally
de_de: Jede Servlet-Anfrage hat Zugriff auf die aktuelle Anfrage, Session und Geltungsbereiche der Anwendung und zusätzlich
es_es: cualquier petición de servlet tiene acceso a petición activa, sesión y ámbitos de aplicación, y adicionalmente,
it_it: qualsiasi richiesta servlet ha accesso a scope attivi di richiesta, sessione e applicazione e, in aggiunta
zh_tw: 任何 servlet 請求都可存取 active request、session 和應用程式 scope，另外

source: any JSF request has access to an active conversation scope.
de_de: hat jede JSF-Anfrage Zugriff auf einen aktiven Konversations-Geltungsbereich.
es_es: cualquier petición de JSF tiene acceso a un ámbito de conversación activo.
it_it: qualsiasi richiesta JSF ha accesso allo scope attivo di conversazione.
zh_tw: 任何 JSF 請求也都能存取一個現行的 conversation scope。

source: The request and application scopes are also active:
de_de: Die Geltungsbereiche von Anfrage und Applikation sind ebenfalls aktiv:
es_es: Los ámbitos de petición y aplicación también están activos:
it_it: Gli scope di richiesta ed applicazione sono pure attivi:
zh_tw: 請求和應用程式 scope 在下列情況中會是有效的：

source: during invocations of EJB remote methods,
de_de: während Aufrufen von EJB Remote-Methoden,
es_es: durante invocaciones de métodos remotos EJB,
it_it: durante le invocazioni a metodi remoti EJB,
zh_tw: 當調用 EJB 的遠端 method 時、

source: during EJB timeouts,
de_de: während EJB-Timeouts,
es_es: durante pausas EJB,
it_it: durante i timeout EJB,
zh_tw: 當 EJB 逾時時、

source: during message delivery to a message-driven bean, and
de_de: während Message Delivery an ein message-betriebenes Bean und
es_es: durante la entrega de mensaje a un bean controlado por mensajes, y
it_it: durante la consegna dei messaggi a bean message-drive, e
zh_tw: 當訊息傳送給訊息導向的 bean 時，以及

source: during web service invocations.
de_de: während Aufrufen von Webdiensten.
es_es: durante invocaciones de servicio de red.
it_it: durante invocazioni web service.
zh_tw: 當進行網路服務調用時。

source: If the application tries to invoke a Web Bean with a scope that does not have an active context, a <literal>ContextNotActiveException</literal> is thrown by the Web Bean manager at runtime.
de_de: Versucht die Applikation ein Web Bean aufzurufen, das keinen aktiven Kontext besitzt, so wird zur Runtime eine <literal>ContextNotActiveException</literal> vom Web Bean Manager gemeldet.
es_es: Si la aplicación trata de invocar un Web Bean con un ámbito que no tiene un contexto activo, el administrador de Web Bean produce una <literal>ContextNotActiveException</literal> de Web Bean en tiempo de ejecución.
it_it: Se l'applicazione prova ad invocare un Web Bean con scope che non ha un contesto attivo, una <literal>ContextNotActiveException</literal> viene lanciata a runtime dal manager Web Bean.
zh_tw: 若應用程式嘗試透過一個沒有有效 context 的 scope 來引動 Web Bean 的話，Web Bean 管理員便會在 runtime 時回傳一項 <literal>ContextNotActiveException</literal>。

source: Three of the four built-in scopes should be extremely familiar to every Java EE developer, so let's not waste time discussing them here. One of the scopes, however, is new.
de_de: Drei der vier eingebauten Geltungsbereiche solltem jedem Java EE Entwickler sehr vertraut sein, daher wollen wir hier nicht weiter auf diese eingehen. Einer der Geltungsbereiche jedoch ist neu.
es_es: Tres de los ámbitos incorporados deben ser extremadamente familiares a cualquier desarrollador de Java EE, por eso no perdamos tiempo en explicarlos aquí. No obstante, uno de los ámbitos es nuevo.
it_it: Tre dei quattro scope predefiniti dovrebbero essere estremamente familiari ad ogni sviluppatore Java EE, quindi non si procede oltre nella discussione. Uno degli scope è comunque nuovo.
zh_tw: 四個內建 scope 中有其中的三個對於所有 Java EE 開發人員來說應該都不陌生，所以我們將不花時間在此討論它們。不過在這之中有個 scope 則是新的。

source: The conversation scope
de_de: Der Geltungsbereich der Konversation
es_es: El ámbito de conversación
it_it: Lo scope conversazione
zh_tw: conversation scope

source: The Web Beans conversation scope is a bit like the traditional session scope in that it holds state associated with a user of the system, and spans multiple requests to the server. However, unlike the session scope, the conversation scope:
de_de: Der Web Beans Geltungsbereich der Konversation ähnelt dem herkömmlichen Geltungsbereich der Session dahingehend, dass er den mit einem Benutzer des Systems assoziierten Status verwahrt und mehrere Anfragen zum Server umfasst. Anders als für den Geltungsbereich der Session gilt für den Geltungsbereich der Konversation jedoch:
es_es: El ámbito de conversación de Web Beans es un poco parecido al ámbito de sesión tradicional en que mantiene el estado asociado con el usuario del sistema y abarca varias peticiones al servidor. Sin embargo, a diferencia del ámbito de sesión, el ámbito de conversación:
it_it: Lo scope di conversazione di Web Beans è un pò come il tradizionale scope di sessione in cui viene mantenuto lo stato associato all'utente del sistema, e vengono create richiest multiple al server. Comunque, a differenza dello scope di sessione, lo scope di conversazione:
zh_tw: Web Bean 的 conversation scope 和傳統的 session scope 類似，它們都持有著有關於系統用戶的狀態，並發出多重請求至伺服器。conversation scope 和 session scope 不同的地方在於：

source: is demarcated explicitly by the application, and
de_de: ist explizit durch die Applikation demarkiert und
es_es: está demarcado explícitamente por la aplicación, y
it_it: è demarcato esplicitamente dall'applicazione, e
zh_tw: conversation scope 已被應用程式明確區分，並且

source: holds state associated with a particular web browser tab in a JSF application.
de_de: verwahrt den mit einem bestimmten Webbrowser assoziierten Status in einer JSF-Applikation.
es_es: mantiene un estado asociado con una ficha de navegador de red determinada en una aplicación JSF.
it_it: mantiene lo stato associato ad un particolare tab del browser in un'applicazione JSF.
zh_tw: 它在 JSF 應用程式中會持有和特定網站瀏覽器分頁相關的狀態。

source: A conversation represents a task, a unit of work from the point of view of the user. The conversation context holds state associated with what the user is currently working on. If the user is doing multiple things at the same time, there are multiple conversations.
de_de: Eine Konversation repräsentiert aus Perspektive des Benutzers eine Aufgabe, eine Arbeitseinheit. Der Konversationskontext enthält den Status dessen, woran der Benutzer gerade arbeitet. Arbeitet der Benutzer gleichzeitig an mehreren Dingen, so existieren mehrere Konversationen.
es_es: Una conversación representa una tarea, una unidad de trabajo desde el punto de vista del usuario. El contexto de conversación mantiene un estado asociado con lo que el usuario está actualmente trabajando. Si el usuario está trabajando en varias tareas al mismo tiempo, habrá múltiples conversaciones.
it_it: Una conversazione rappresenta un task, un'unità di lavoro dal punto di vista dell'utente. Il contesto di conversazione mantiene uno stato associato all'utente che sta lavorando. Se l'utente sta facendo più cose contemporaneamente ci saranno più conversazioni.
zh_tw: Conversation（對話）代表一項工作，從用戶角度來看是項工作的單位。conversation 的 context 持有和用戶目前工作相關的狀態。若用戶同時間一次進行多項工作的話，那就會有多個 conversation。

source: The conversation context is active during any JSF request. However, most conversations are destroyed at the end of the request. If a conversation should hold state across multiple requests, it must be explicitly promoted to a <emphasis>long-running conversation</emphasis>.
de_de: Der Konversation skontext ist während jeder JSF-Anfrage aktiv. Jedoch werden die meisten Konversationen am Ende der Anfrage gelöscht. Soll eine Konversation den Status über mehrere Anfragen hinweg verwahren, so muss sie explizit zu einer <emphasis>lange laufenden Konversation</emphasis> fortgepflanzt werden.
es_es: El contexto de conversación está activo durante cualquier petición de JSF. Sin embargo, la mayoría de las conversaciones se destruyen al final de la petición. Si una conversación debe mantener un estado a través de múltiples peticiones, debe ser explícitamente promovida a <emphasis>conversación-larga</emphasis>.
it_it: Il contesto di conversazione è attivo durante ogni richiesta JSF. Comunque, la maggior parte delle conversazioni vengono distrutte alla fine della richiesta. Se una conversazione deve mantenere lo stato nel corso richieste multiple, deve esplicitamente essere promossa a <emphasis>conversazione long-running</emphasis>.
zh_tw: conversation context 會在任何 JSF 請求進行中的時候啟用。不過，大部分的 conversation 都會在請求結束後被刪除掉。若有個 conversation 必須持有多重請求的狀態，它便需要被明確地轉為 <emphasis>long-running conversation</emphasis>。

source: Conversation demarcation
de_de: Konversationsdemarkierung
es_es: Demarcación de conversación
it_it: Demarcazione della conversazione
zh_tw: Conversation demarcation（對話區分）

source: Web Beans provides a built-in Web Bean for controlling the lifecyle of conversations in a JSF application. This Web Bean may be obtained by injection:
de_de: Web Beans liefert ein eingebautes Web Bean für die Steuerung des Lebenszyklus von Konversationen in einer JSF-Applikation. Dieses Web Bean kann durch Einspeisung erhalten werden:
es_es: Web Beans ofrece un Web Bean incorporado para controlar el ciclo de vida de conversaciones en una aplicación JSF. Dicho Web Bean puede obtenerse por inyección:
it_it: Web Beans fornisce un Web Bean predefinito per controllare il ciclo di vita delle conversazioni in un'applicazione JSF. QUesto Web Bean può essere ottenuto per iniezione:
zh_tw: Web Bean 提供了一個內建的 Web Bean，它可被用來在 JSF 應用程式中控制 conversation 的生命週期。這個 Web Bean 能透過注入下列來取得：

source: @Current Conversation conversation;
de_de: @Current Conversation Konversation;

source: To promote the conversation associated with the current request to a long-running conversation, call the <literal>begin()</literal> method from application code. To schedule the current long-running conversation context for destruction at the end of the current request, call <literal>end()</literal>.
de_de: Um die mit der aktuellen Anfrage assoziierte Konversation an eine lange laufende Konversation fortzupflanzen, rufen Sie die <literal>begin()</literal>-Methode vom Applikationscode auf. Um den aktuellen, lange laufenden Konversationskontext für die Löschung am Ende der aktuellen Anfrage zu terminieren, rufen Sie <literal>end()</literal> auf.
es_es: Para iniciar la conversación asociada con la petición actual a una conversación larga, llame al método <literal>begin()</literal> desde el código de aplicación. Para programar que el actual contexto de conversación larga se destruya al final de la petición actual, llame a <literal>end()</literal>.
it_it: Per promuovere a long-running la conversazione associata alla richiesta corrente, occorre chiamare il metodo <literal>begin()</literal> dal codice dell'applicazione. Per schedulare la distruzione del contesto attuale della conversazione long-running, si chiami <literal>end()</literal>.
zh_tw: 若要將和目前的請求關聯的 conversation 轉為 long-running conversation 的話，請由應用程式的程式碼調用 <literal>begin()</literal> method。若要將目前的 long-running conversation context 排程在目前請求結束時被刪除，請調用 <literal>end()</literal>。

source: In the following example, a conversation-scoped Web Bean controls the conversation with which it is associated:
de_de: IIm folgenden Beispiel steuert ein konversationsbegrenztes Web Bean die Konversation, mit der es assoziiert ist:
es_es: En el ejemplo a continuación, un Web Bean de conversación en ámbito controla la conversación con la que está asociada.
it_it: Nel seguente esempio un Web Bean con scope di conversazione controlla la conversazione alla quale è associato:
zh_tw: 在下列範例中，有個 conversation-scoped 的 Web Bean 會控制和它關聯的 conversation：

source: This Web Bean is able to control its own lifecycle through use of the <literal>Conversation</literal> API. But some other Web Beans have a lifecycle which depends completely upon another object.
de_de: Dieses Web Bean ist in der Lage, seinen eigenen Lebenszyklus durch Verwendung der <literal>Conversation</literal>-API zu steuern. Aber einige andere Web Beans besitzen einen Lebenszyklus, der komplett von einem anderen Objekt abhängt.
es_es: Este Web Bean puede controlar su propio ciclo de vida mediante la API de <literal>Conversación</literal>. No obstante, algunos otros Web Beans tienen un ciclo de vida que depende totalmente de otro objeto.
it_it: Questo Web Bean è capace di controlla il proprio ciclo di vita attraverso l'uso della API <literal>Conversation</literal>. Ma altri Web BEan hanno un ciclo di vita che dipende completamente da un altro oggetto.
zh_tw: 這個 Web Bean 能夠透過使用 <literal>Conversation</literal> API 來控制它自己的生命週期。不過有些其它 Web Bean 的生命週期完全取決於另一個物件。

source: Conversation propagation
de_de: Konversationsfortpflanzung (Conversation Propagation)
es_es: Propagación de conversación
it_it: Propagazione della conversazione
zh_tw: Conversation propagation（傳播）

source: The conversation context automatically propagates with any JSF faces request (JSF form submission). It does not automatically propagate with non-faces requests, for example, navigation via a link.
de_de: Der Konversationskontext wird automatisch mit allen JSF Faces Anfragen fortgepflanzt(JSF-Formulareinreichung). Nicht-Faces Anfragen werden nicht automatisch fortgepflanzt, zum Beispiel Navigation via einem Link.
es_es: El contexto de conversación se propaga automáticamente con cualquier petición de JSF (presentación de formulario JSF). No se propaga automáticamente con peticiones sin caras, por ejemplo, la navegación mediante un enlace.
it_it: Il contesto di conversazione viene automaticamente propagato con ogni richiesta JSF faces (invio di form JSF). Non si propaga in modo automatico con richiesta non-faces, per esempio, navigazione tramite un link.
zh_tw: conversation context 會隨著任何 JSF face 的請求（JSF form submission）自動地傳播。它不會隨著 non-face 的請求（例如透過連結來瀏覽）自動地傳播。
