Repository: 1tchy/core
Catalog: reference/*/scopescontexts.po
Languages: de_de, es_es, it_it, zh_tw

source: We can force the conversation to propagate with a non-faces request by including the unique identifier of the conversation as a request parameter. The Web Beans specification reserves the request parameter named <literal>cid</literal> for this use. The unique identifier of the conversation may be obtained from the <literal>Conversation</literal> object, which has the Web Beans name <literal>conversation</literal>.
de_de: Wir können die Konversation zwingen, mit einer nicht-Faces Anfrage fortzupflanzen, indem wir den eindeutigen Bezeichner der Konversation als einen Anfragenparameter mit einschließen. Die Web Beans Spezifikation reserviert den Anfragenparameter namens <literal>cid</literal> für diesen Gebrauch. Den eindeutigen Bezeichner der Konversation erhält man vom <literal>Conversation</literal>-Objekt, welches den Web Beans Namen <literal>conversation</literal> besitzt.
es_es: Podemos forzar la propagación de una conversación con una petición sin-caras al incluir el identificador único de la conversación como un parámetro de petición. La especificación de Web Beans reserva el parámetro llamado <literal>cid</literal> para este uso. El único identificador de la conversación se puede obtener del objeto <literal>Conversation</literal>, el cual tiene el nombre de Web Beans <literal>conversation</literal>.
it_it: E' possibile forzare la conversazione da propagare tramite richiesta non-faces attraverso l'inclusione di un identificatore univoco della conversazione come parametro di richiesta. La specifica Web Bean riserva un parametro di richiesta chiamato <literal>cid</literal> per tale uso. L'identificatore univoco della conversazione può essere ottenuto dall'oggetto <literal>Conversation</literal>, che ha il nome Web Beans <literal>conversation</literal>.
zh_tw: 我們能夠透過包含 conversation 的唯一識別碼（unique identifier）來作為一個請求參數以強制 conversation 隨著 non-face 的請求進行傳播。Web Bean 規格保留了一個名為 <literal>cid</literal> 的請求參數以用於此情況下。conversation 的唯一識別碼可藉由 <literal>Conversation</literal> 這個物件取得，並且它的 Web Bean 名稱為 <literal>conversation</literal>。

source: Therefore, the following link propagates the conversation:
de_de: Daher pflanzt das folgende Link die Konversation fort:
es_es: Por consiguiente, el siguiente enlace propaga la conversación:
it_it: Quindi il seguente link propaga la conversazione:
zh_tw: 因此，下列連結會傳播 conversation：

source: The Web Bean manager is also required to propagate conversations across any redirect, even if the conversation is not marked long-running. This makes it very easy to implement the common POST-then-redirect pattern, without resort to fragile constructs such as a "flash" object. In this case, the Web Bean manager automatically adds a request parameter to the redirect URL.
de_de: Der Web Bean Manager muss auch Konversationen über ein Redirect fortpflanzen, selbst wenn die Konversation nicht als lange laufend gekennzeichnet ist. Dies macht die Implementierung des POST-then-redirect Musters sehr einfach, ohne dass man sich auf anfällige Konstrukte wie etwa ein "Flash"-Objekt stützen müsste. In tdiesem Fall fügt der Web Bean Manager automatisch einen Anfragenparameter hinzu, um die URL umzuleiten.
es_es: El administrador de Web Bean también se requiere para propagar conversaciones a través de cualquier redirección, incluso si la conversación no está marcada como larga. Esto facilita mucho la implementación del patrón de POST-luego-redirigir, sin recurrir a construcciones frágiles tales como un objeto "flash". En este caso, el administrador de Web Bean agrega automáticamente un parámetro a la URL de redirección.
it_it: Il manager Web Bean deve propagare le conversazioni attraverso i redirect, anche se la conversazione non è marcata long-running. Questo rende facile implementare il comune pattern POST-then-redirect, senza impiegare fragili costrutti quali oggetti "flash". In questo caso il manager Web Bean aggiunge automaticamente un parametro di richiesta all'URL di redirect.
zh_tw: Web Bean 管理員也必須將 conversation 在任何重定向作業之間進行傳播，儘管該 conversation 沒有被標記為 long-running。這使得實做一般的 POST-then-redirect 模式變得非常簡單，這樣便無須使用一些像是「flash」物件的脆弱 construct。在此情況下，Web Bean 管理員會自動地新增一個請求參數至重定向 URL。

source: Conversation timeout
de_de: Konversations-Timeout
es_es: Pausa de conversación
it_it: Timeout della conversazione
zh_tw: Conversation timeout（逾時）

source: The Web Bean manager is permitted to destroy a conversation and all state held in its context at any time in order to preserve resources. A Web Bean manager implementation will normally do this on the basis of some kind of timeout &#151; though this is not required by the Web Beans specification. The timeout is the period of inactivity before the conversation is destroyed.
de_de: Dem Web Bean Manager ist gestattet, eine Konversation und alle Stati innerhalb seines Kontexts zu jedem Zeitpunkt zu löschen, um Ressourcen zu schonen. Eine Implementierung des Web Bean Managers wird dies in der Regel auf der Basis einer Art von Timeout &#151; tun, obwohl dies nicht durch die Web Beans Spezifikation gefordert wird. Beim Timeout handelt es sich um den Zeitraum von Inaktivität, ehe die Konversation gelöscht wird.
es_es: Con el fin de preservar recursos, el administrador de Web Bean puede destruir una conversación y todo el estado en su contexto en cualquier momento. Una implementación del administrador de Web Bean normalmente hace esto con base en alguna clase de pausa &#151; aunque la especificación de Web Beans no lo requiere. La pausa es el periodo de inactividad anterior a la destrucción de la conversación.
zh_tw: Web Bean 管理員能夠隨時隨地刪除它 context 中的 conversation 以及所有狀態以保留資源。一個 Web Bean 管理員實做一般會利用某種形式的 timeout 來這麼作 &#151; 儘管這在 Web Bean 規格中是非必要的。Timeout 代表 conversation 在被刪除之前所經過的休止狀態時間。

source: The <literal>Conversation</literal> object provides a method to set the timeout. This is a hint to the Web Bean manager, which is free to ignore the setting.
de_de: Das <literal>Conversation</literal>-Objekt liefert eine Methode, mit der der Timeout eingestellt werden kann. Dies ist ein Tipp an den Web Bean Manager, der die Einstellung ignorieren kann.
es_es: El objeto de <literal>Conversación</literal> proporciona un método para configurar el tiempo de espera. Se trata de una ayuda para el administrador de Web Bean quién tiene la libertad de pasar por alto la configuración.
it_it: L'oggetto <literal>Conversation</literal> fornisce un metodo per impostare iltimeout. Questo è solo un suggerimento al manager Web Bean, che è libero di ignorare quest'impostazione.
zh_tw: <literal>Conversation</literal> 這個物件提供了一個能設置 timeout 的 method。這是個給 Web Bean 管理員的提示，您可忽略該設定。

source: The dependent pseudo-scope
de_de: Der abhängige Pseudo-Geltungsbereich ("Pseudo-Scope")
es_es: El seudo ámbito dependiente
it_it: Pseudo-scope dipendente
zh_tw: dependent pseudo-scope

source: In addition to the four built-in scopes, Web Beans features the so-called <emphasis>dependent pseudo-scope</emphasis>. This is the default scope for a Web Bean which does not explicitly declare a scope type.
de_de: Neben den vier eingebauten Geltungsbereichen bieten Web Beans den sogenannten<emphasis>abhängigen Pseudo-Geltungsbereich</emphasis>. Dies ist der standardmäßige Geltungsbereich für ein Web Bean, das nicht expliziet einen Typ von Geltungsbereich deklariert.
es_es: Además de los cuatro ámbitos incorporados, Web Beans ofrece el <emphasis>ámbito seudo dependiente</emphasis>. Este es el ámbito para el Web Bean que no declare explícitamente un tipo de ámbito.
it_it: In aggiunta ai quattro scope predefiniti, Web Bean fornisce il cosiddetto <emphasis>pseudo-scope dipendente</emphasis>. Questo è lo scope di default per un Web Bean che non dichiara esplicitamente un tipo di scope.
zh_tw: 除了這四個內建的 scope，Web Bean 還提供了一項稱為 <emphasis>dependent pseudo-scope</emphasis> 的功能。這是個未明確宣告 scope 類型的 Web Bean 的預設 scope。

source: For example, this Web Bean has the scope type <literal>@Dependent</literal>:
de_de: Zum Beispiel besitzt dieses Web Bean den Geltungsbereich-Typ <literal>@Dependent</literal>:
es_es: Por ejemplo, este Web Bean tiene el ámbito de tipo <literal>@Dependent</literal>:
it_it: Per esempio questo Web Bean ha uno scope di tipo <literal>@Dependent</literal>:
zh_tw: 比方說，這個 Web Bean 的 scope 類型為 <literal>@Dependent</literal>：

source: When an injection point of a Web Bean resolves to a dependent Web Bean, a new instance of the dependent Web Bean is created every time the first Web Bean is instantiated. Instances of dependent Web Beans are never shared between different Web Beans or different injection points. They are <emphasis>dependent objects</emphasis> of some other Web Bean instance.
de_de: Wenn der Einspeisungspunkt eines Web Bean zu einem abhängigen Web Bean hin aufgelöst wird, so wird jedes Mal, wenn das erste Web Bean instantiiert wird, eine neue Instanz des abhängigen Web Beans erstellt. Instanzen abhängiger Web Beans werden nie von unterschiedlichen Web Beans oder unterschiedlichen Einspeisungspunkten geteilt. Sie sind <emphasis>abhängige Objekte</emphasis> einer anderen Web Bean Instanz.
es_es: Cuando un punto de inyección de un Web Bean apunta a un Web Bean dependiente, una nueva instancia del Web Bean dependiente es creada cada vez que el primer Web Bean sea instanciado. Las instancias de Web Beans dependientes nunca se comparten entre Web Beans o puntos diferentes de inyección. Ellas son <emphasis>objetos dependientes</emphasis> de alguna otra instancia de Web Bean.
it_it: Quando un punto di iniezione di un Web Bean risolve verso un Web Bean dipendente, viene creata una nuova istanza di Web Bean dipendente ogni volta che il primo Web Bean viene istanziato. Le istanze dei Web Beans dipendenti non vengono mai condivise tra Web Bean differenti o punti di iniezione differenti. Sono <emphasis>oggetti dipendenti</emphasis> di altre istanze Web Bean.
zh_tw: 當 Web Bean 的一個注入點解析至一個相依 Web Bean 時，每當第一個 Web Bean 被例示（instantiate）時，相依 Web Bean 的一個新的 instance 就會被建立。相依 Web Bean 的 instance 絕不會被共享於不同的 Web Bean 或不同的注入點之間。它們是其它 Web Bean instance 的 <emphasis>dependent object（相依物件）</emphasis>。

source: Dependent Web Bean instances are destroyed when the instance they depend upon is destroyed.
de_de: Abhängige Web Bean Instanzen werden gelöscht, wenn die Instanz von der sie abhängen gelöscht wird.
es_es: Las instancias dependientes de Web Bean se destruyen cuando la instancia de la que dependen es destruida.
it_it: Istanze Web Bean dipendenti vengono distrutte quando viene distrutta l'istanza da cui dipendono.
zh_tw: 相依 Web Bean 的 instance 會在它們所依賴的 instance 被刪除掉時跟著被一起刪除。

source: Web Beans makes it easy to obtain a dependent instance of a Java class or EJB bean, even if the class or EJB bean is already declared as a Web Bean with some other scope type.
de_de: Web Beans machen es einfach, eine unabhängige Instanz einer Java-Klasse oder eines EJB-Beans zu erhalten, selbst wenn die Klasse oder das EJB-Bean bereits als ein Web Bean mit einem anderen Typ von Geltungsbereich deklariert sind.
es_es: Web Beans facilita la obtención de una instancia dependiente de una clase de Java o bean EJB, incluso si la clase o el bean EJB ya se declaró como Web Bean con algún otro tipo de ámbito.
it_it: Web Beans facilità l'ottenimento di un'istanza dipendente di una classe Java o bean EJB, anche se la classe o bean EJB sono già dichiarati come Web Bean con qualche altro tipo di scope.
zh_tw: Web Bean 使得取得 Java class 或是 EJB bean 的相依 instance 變得相當容易，儘管該 class 或是 EJB bean 已被宣告為一個含有其牠 scope 類型的 Web Bean。

source: The <literal>@New</literal> annotation
de_de: Die <literal>@New</literal>-Annotation
es_es: La anotación <literal>@New</literal>
it_it: Annotazione <literal>@New</literal>
zh_tw: <literal>@New</literal> 標記

source: The built-in <literal>@New</literal> binding annotation allows <emphasis>implicit</emphasis> definition of a dependent Web Bean at an injection point. Suppose we declare the following injected field:
de_de: Die eingebaute <literal>@New</literal> Binding-Annotation gestattet die <emphasis>implizite</emphasis> Definition eines abhängigen Web Beans an einem Einspeisungspunkt. Nehmen wir an, wir deklarieren das folgende eingespeiste Feld:
es_es: La anotación de enlace incorporada <literal>@New</literal> permite definición <emphasis>implícita</emphasis> de un Web Bean dependiente en un punto de inyección. Imagine que declara el siguiente campo inyectado:
it_it: L'annotazione predefinita di binding <literal>@New</literal> consente la definizione<emphasis>implicita</emphasis> di un Web Bean dipendente in un punti di iniezione. Si supponga di dichiarare il seguentecampo iniettato:
zh_tw: 內建的 <literal>@New</literal> 綁定標記允許在注入點能夠有<emphasis>暗示性</emphasis>的相依 Web Bean 定義。假設我們宣告下列被注入的欄位：

source: Then a Web Bean with scope <literal>@Dependent</literal>, binding type <literal>@New</literal>, API type <literal>Calculator</literal>, implementation class <literal>Calculator</literal> and deployment type <literal>@Standard</literal> is implicitly defined.
de_de: Dann wird ein Web Bean mit Geltungsbereich <literal>@Dependent</literal>, Binding-Typ <literal>@New</literal>, API-Typ <literal>Calculator</literal>, Implementierungsklasse <literal>Calculator</literal> und Deployment-Typ <literal>@Standard</literal> impliziert definiert.
es_es: Entonces un Web Bean con ámbito <literal>@Dependent</literal>, tipo de enlace <literal>@New</literal>, tipo de API <literal>Calculator</literal>, clase de implementación <literal>Calculator</literal> y tipo de despliegue <literal>@Standard</literal> está definido de modo implícito.
it_it: Allora viene implicitamente definito il Web Bean con scope <literal>@Dependent</literal>, tipo di binding <literal>@New</literal>, tipo di API <literal>Calculator</literal>, classe di implementazione <literal>Calculator</literal> e tipo di deploy <literal>@Standard</literal>.
zh_tw: 如此一來有個含有 scope <literal>@Dependent</literal>、綁定類型 <literal>@New</literal>、API 類型 <literal>Calculator</literal>、實做 class <literal>Calculator</literal> 以及建置類型 <literal>@Standard</literal> 的 Web Bean 就被暗示性地定義了。

source: This is true even if <literal>Calculator</literal> is <emphasis>already</emphasis> declared with a different scope type, for example:
de_de: Dies ist wahr, selbst wenn <literal>Calculator</literal> <emphasis>bereits</emphasis> mit einem anderen Typ von Geltungsbereich definiert ist, zum Beispiel:
es_es: Esto es cierto incluso si <literal>Calculator</literal> está <emphasis>ya</emphasis> declarado con un tipo de ámbito diferente, por ejemplo:
it_it: Questo è vero se <literal>Calculator</literal> è <emphasis>già</emphasis> dichiarato con un tipo di scope differente, per esempio:
zh_tw: 就算 <literal>Calculator</literal> <emphasis>已經</emphasis>被宣告為不同 scope type，這還是有效的，比方說：

source: So the following injected attributes each get a different instance of <literal>Calculator</literal>:
de_de: Die folgenden eingespeisten Attribute erhalten also jeweils eine unterschiedliche Instanz von <literal>Calculator</literal>:
es_es: Por lo tanto cada uno de los siguientes atributos inyectados obtiene una instancia diferente a <literal>Calculator</literal>:
it_it: Quindi i seguenti attributi iniettati ricevono ciascuno un'istanza di <literal>Calculator</literal>:
zh_tw: 因此下列已注入的屬性都會各得到一個 <literal>Calculator</literal> 的不同 instance：

source: The <literal>calculator</literal> field has a conversation-scoped instance of <literal>Calculator</literal> injected. The <literal>newCalculator</literal> field has a new instance of <literal>Calculator</literal> injected, with a lifecycle that is bound to the owning <literal>PaymentCalc</literal>.
de_de: In das <literal>calculator</literal>-Feld wird eine konversationsbegrenzte Instanz von <literal>Calculator</literal> eingespeist. In das <literal>newCalculator</literal>-Feld wird eine neue Instanz von <literal>Calculator</literal> eingespeist, mit einem Lebenszyklus, der an den besitzenden <literal>PaymentCalc</literal> gebunden ist.
es_es: El campo <literal>calculadora</literal> tiene una instancia de conversación-en ámbito de <literal>Calculator</literal> inyectada. El campo <literal>newCalculator</literal> tiene una nueva instancia de <literal>Calculator</literal> inyectada con un ciclo de vida vinculado al propietario de <literal>PaymentCalc</literal>.
it_it: Il campo <literal>calculator</literal> ha iniettata un'istanza con scope conversazionale di <literal>Calculator</literal>. Il campo <literal>newCalculator</literal> ha iniettata un nuova istanza di <literal>Calculator</literal>, con ciclo di vita che è legato a <literal>PaymentCalc</literal>.
zh_tw: <literal>calculator</literal> 這個欄位中注入了一個 <literal>Calculator</literal> 的 conversation-scoped instance。<literal>newCalculator</literal> 欄位中有個新的 <literal>Calculator</literal> 的 instance 被注入了，並且它的生命週期取決於擁有它的 <literal>PaymentCalc</literal>。

source: This feature is particularly useful with producer methods, as we'll see in the next chapter.
de_de: Dieses Feature ist insbesondere im Zusammenhang mit Producer-Methoden von Nutzen, wie wir im folgenden Kapitel noch sehen werden.
es_es: La función es particularmente útil con métodos de productor, así como veremos en el siguiente capítulo.
it_it: Questa caratteristica è particolarmente utile con i metodi produttori, come si vedrà nel prossimo capitolo.
zh_tw: 這項功能對於 producer method 來講特別有幫助，我們將在下個章節中討論到。

source: The Web Bean manager is permitted to destroy a conversation and all state held in its context at any time in order to preserve resources. A Web Bean manager implementation will normally do this on the basis of some kind of timeout&#151;though this is not required by the Web Beans specification. The timeout is the period of inactivity before the conversation is destroyed.
it_it: Al manager Web Bean è permesso di distruggere una conversazione e tutto lo stato mantenuto nel contesto in qualsiasi momento al fine di preservare le risorse. Un'implementazione di un manager Web Bean eseguirà questo sulla base di un qualche timeout&#151;sebbene non sia richiesto dalla specifica Web Beans. Il timeout è il periodo di inattività prima che la conversazione venga distrutta.
