Repository: 1tchy/core
Catalog: reference/*/specialization.po
Languages: de_de, es_es, ja_jp, ko_kr, pt_br, zh_cn, zh_tw

source: Specialization
de_de: Specialization (Spezialisierung)
ja_jp: 特殊化
ko_kr: 특성화
pt_br: Especialização
zh_cn: 特化
zh_tw: 專門化（Specialization）

source: We've already seen how the Web Beans dependency injection model lets us <emphasis>override</emphasis> the implementation of an API at deployment time. For example, the following enterprise Web Bean provides an implementation of the API <literal>PaymentProcessor</literal> in production:
de_de: Wir haben bereits gesehen, wie das Web Beans Modell zur Dependency Einspeisung uns die <emphasis>Außerkraftsetzung</emphasis> der Implementierung eines API zum Zeitpunkt des Deployment gestattet. Das folgende Enterprise Web Bean zum Beispiel liefert eine Implementierung der API <literal>PaymentProcessor</literal> in Production:
es_es: Hemos visto cómo el modelo de inyección de dependencia de Web Beans nos permite <emphasis>omitir</emphasis> la implementación de un API en el momento del despliegue. Por ejemplo, la siguiente Web Bean empresarial provee una implementación del <literal>Procesador de Pago</literal> de API en producción:
ja_jp: Web Beans 依存性注入モデルがどんな状態デプロイメントタイムで API のインプリメントに <emphasis>オーバーライド</emphasis> させるかについて、すでに説明しました。たとえば、以下のエンタープライズ Web Bean は、プロダクションにおいて API <literal>PaymentProcessor</literal> の実装を提供します。
ko_kr: 이미 Web Beans 의존성 삽입 모델은 배치시 API 구현을 <emphasis>덮어쓰기</emphasis> 하게 합니다. 예를 들어, 다음과 같은 엔터프라이즈 Web Bean은 제품에서 API <literal>PaymentProcessor</literal> 구현을 제공합니다:
pt_br: Nós já vimos a forma como o modelo de injeção de dependências da Web Beans permite <emphasis>sobrescrever</emphasis> a implementação da API em tempo de implantação. Por exemplo, o seguinte Bean Web corporativo fornece uma implementação da API <literal>PaymentProcessor</literal> em produção:
zh_cn: 我们已经看到Web Bean的依赖注入模型如何让我们在部署时期 <emphasis>重载</emphasis> 一个API实现。例如，下面的企业级Web Bean在生产环境下使提供一个<literal>PaymentProcessor</literal>接口的实现：
zh_tw: 我們已經看過了 Web Bean 的依賴注入模型如何讓我們在建置時<emphasis>置換（override）</emphasis>了一個 API 的實做。比方說，下列企業級的 Web Bean 在生產時提供了 <literal>PaymentProcessor</literal> 這個 API 的一個實做：

source: But in our staging environment, we override that implementation of <literal>PaymentProcessor</literal> with a different Web Bean:
de_de: Aber in unserer Staging-Umgebung setzen wir diese Implementierung von <literal>PaymentProcessor</literal> mit einem anderen Web Bean außer Kraft:
es_es: Pero en nuestro entorno, omitimos esa implementación de <literal>PaymentProcessor</literal> con un Web Bean diferente:
ja_jp: しかし、ステージング環境で、異なる Web Bean で <literal>PaymentProcessor</literal> のその実装にオーバーライドします。
ko_kr: staging 환경에서, 다른 Web Bean을 사용하여 <literal>PaymentProcessor</literal> 구현을 덮어쓰기 합니다:
pt_br: Mas, no nosso ambiente simulado, nos sobrepomos a implementação de <literal>PaymentProcessor</literal> com um Web Bean diferente:
zh_cn: 但在我们的阶段开发环境中，我们可以使用一个不同的Web Bean来重载这个<literal>PaymentProcessor</literal> 实现：
zh_tw: 不過在我們的中繼環境（staging environment）中，我們利用了不同的 Web Bean 來置換了 <literal>PaymentProcessor</literal> 的實做：

source: What we've tried to do with <literal>StagingCreditCardPaymentProcessor</literal> is to completely replace <literal>AsyncPaymentProcessor</literal> in a particular deployment of the system. In that deployment, the deployment type <literal>@Staging</literal> would have a higher priority than the default deployment type <literal>@Production</literal>, and therefore clients with the following injection point:
de_de: Wir haben bei <literal>StagingCreditCardPaymentProcessor</literal> versucht, <literal>AsyncPaymentProcessor</literal> in einem bestimmten Deployment des Systems komplett zu ersetzen. In diesem Deployment, hätte der Deployment Typ <literal>@Staging</literal> eine höhere Priorität als der standardmäßige Deployment Typ <literal>@Production</literal> und daher Clients mit dem folgenden Einspeisungspunkt:
es_es: Lo que hemos tratado de hacer con <literal>StagingCreditCardPaymentProcessor</literal> es remplazar totalmente a <literal>AsyncPaymentProcessor</literal> en un despliegue particular del sistema. En ese despliegue, el tipo de despliegue <literal>@Staging</literal> tendría una prioridad más alta que el tipo de despliegue predeterminado <literal>@Production</literal>, y por ende los clientes con el siguiente punto de inyección:
ja_jp: <literal>StagingCreditCardPaymentProcessor</literal> でしようとしたことは、システムの特定のデプロイメントにおいて完全に <literal>AsyncPaymentProcessor</literal> を取り替えることです。そのデプロイメントで、デプロイメントタイプ <literal>@Staging</literal> はデフォルトデプロイメントタイプ <literal>@Production</literal> より高いプライオリティを持ちます、したがって、以下の依存性注入によるクライアントを指し示します。
ko_kr: <literal>StagingCreditCardPaymentProcessor</literal>를 사용하여 실행하려는 작업은 특정 시스템 배치에 <literal>AsyncPaymentProcessor</literal>를 완전 교체하는 것입니다. 여기서 배치 유형 <literal>@Staging</literal>은 기본값 배치 유형 <literal>@Production</literal> 보다 높은 우선 순위를 갖게 되므로 클라이언트는 다음과 같은 삽입 지점을 사용하게 됩니다:
zh_cn: 我们试图做的是在特定的系统部署环境中使用<literal>StagingCreditCardPaymentProcessor</literal>来完全替代<literal>AsyncPaymentProcessor</literal>。在这个部署中，部署类型为<literal>@Staging</literal>的将有比默认部署类型<literal>@Production</literal>更高的优先级，因此下面注入点的客户：
zh_tw: 我們嘗試要對 <literal>StagingCreditCardPaymentProcessor</literal> 進行的就是在系統的某個特定的 deployment 中完全地替換掉 <literal>AsyncPaymentProcessor</literal>。在該 deployment 中，<literal>@Staging</literal> 這個 deployment type 將會擁有比 <literal>@Production</literal> 這個預設 deployment type 還要高的優先權，因此含有下列注入點的客戶端：

source: Would receive an instance of <literal>StagingCreditCardPaymentProcessor</literal>.
de_de: Wir würden eine Instanz von <literal>StagingCreditCardPaymentProcessor</literal> erhalten.
es_es: Recibirían una instancia de <literal>StagingCreditCardPaymentProcessor</literal>.
ja_jp: これには <literal>StagingCreditCardPaymentProcessor</literal> のインスタンスが設定されます。
ko_kr: <literal>StagingCreditCardPaymentProcessor</literal> 인스턴스를 받고자 합니다.
pt_br: Pode receber uma instância de <literal>StagingCreditCardPaymentProcessor</literal>.
zh_cn: 将会收到一个 <literal>StagingCreditCardPaymentProcessor</literal> 的实例。
zh_tw: 將會收到 <literal>StagingCreditCardPaymentProcessor</literal> 的一個 instance。

source: Unfortunately, there are several traps we can easily fall into:
de_de: Leider könnten wir in gleich mehrere Fallen tappen:
es_es: Lamentablemente, hay varias trampas en las que se puede caer fácilmente:
ja_jp: 残念なことに、簡単に落ちることができるいくつかの罠が、あります。
ko_kr: 불행하게도 여기에는 몇 가지 함정이 있습니다:
pt_br: Infelizmente, existem várias armadilhas que facilmente podemos cair:
zh_cn: 不幸的是，我们很容易掉入几个陷阱：
zh_tw: 不過我們有幾點需要小心：

source: the higher-priority Web Bean may not implement all the API types of the Web Bean that it attempts to override,
de_de: Das Web Bean mit der höheren Priorität implementiert möglicherweise nicht alle API-Typen des Web Beans, das es außer Kraft zu setzen versucht,
es_es: el Web Bean de prioridad más alta puede que no implemente todos los tipos de API del Web Bean que intenta omitir,
ja_jp: より高いプライオリティの Web Bean が、それがオーバーライドしようとする Web Bean のすべての API 型を実行することがありえるというわけではありません
ko_kr: 높은 우선 순위의 Web Bean은 덮어쓰기하려는 Web Bean의 모든 API 유형을 구현할 수 없습니다.
pt_br: o Web Bean de maior prioridade não pode implementar todos os tipos da API do Web Bean que tenta sobrepor,
zh_cn: 更高优先级的Web Bean可能没有实现其要重载的所有的API类型，
zh_tw: 優先權較高的 Web Bean 無法實做它所嘗試置換的 Web Bean 的所有 API 類型、

source: the higher-priority Web Bean may not declare all the binding types of the Web Bean that it attempts to override,
de_de: Das Web Bean mit der höheren Priorität deklariert möglicherweise nicht alle Binding-Typen des Web Beans, das es außer Kraft zu setzen versucht,
es_es: el Web Bean de prioridad más alta puede que no declare todos los tipos de enlace del Web Bean que intenta omitir,
ja_jp: より高いプライオリティの Web Bean が、それがオーバーライドしようとする Web Bean のすべてのバインディングタイプを宣言することがありえるというわけではありません
ko_kr: 높은 우선 순위의 Web Bean은 덮어쓰기하려는 Web Bean의 모든 바인딩 유형을 명시할 수 없습니다.
pt_br: o Web Bean de maior prioridade não pode declarar todos os tipos de binding do Web Bean que tenta sobrepor,
zh_cn: 更高优先级的Web Bean可能没有声明其要重载的所有绑定类型，
zh_tw: 優先權較高的 Web Bean 無法宣告它所嘗試置換的 Web Bean 的所有綁定類型、

source: the higher-priority Web Bean might not have the same name as the Web Bean that it attempts to override, or
de_de: Das Web Bean mit der höheren Priorität besitzt möglicherweise nicht denselben Namen wie das Web Bean, das es außer Kraft zu setzen versucht oder
es_es: el Web Bean de prioridad más alta puede que no tenga el mismo nombre que el Web Bean que intenta omitir, o
ja_jp: より高いプライオリティの Web Bean は、それがオーバーライドしようとする Web Bean と同じ名前を持たないかもしれません
ko_kr: 높은 우선 순위의 Web Bean은 덮어 쓰기하려는 Web Bean과 동일한 이름을 갖을 수 없습니다.
pt_br: o Web Bean de maior prioridade talvez não tenha o mesmo nome que o Web Bean que tenta sobrepor, ou
zh_cn: 更高优先级的Web Bean可能没有和其要重载的Web Bean拥有相同的名字，或者
zh_tw: 優先權較高的 Web Bean 無法擁有與它所嘗試置換的 Web Bean 相同的名稱，或是

source: the Web Bean that it attempts to override might declare a producer method, disposal method or observer method.
de_de: das Web Bean, das es außer Kraft zu setzen versucht deklariert möglicherweise eine Producer Methode, eine Bereinigungsmethode odereine Observer Methode.
es_es: el Web Bean que intenta omitir podría declarar un método de productor, método desechable o método de observador.
ja_jp: それがオーバーライドしようとする Web Bean は、プロデューサメソッド、ディスポーザルメソッド、またはオブザーバメソッドを宣言するかもしれません
ko_kr: 덮어쓰기하려는 Web Bean은 생산자 방식, 폐지 방식 또는 옵저버 방식을 명시할 수 있습니다.
pt_br: o Web Bean que tenta sobrepor poderia declarar um método produtor, método de eliminação ou método observador.
zh_cn: 其要重载的Web Bean有可能声明了一个生产者方法，清除方法或者观察者方法。
zh_tw: 它所嘗試置換的 Web Bean 可能能夠宣告一個 producer method、disposal method 或是 observer method。

source: In each of these cases, the Web Bean that we tried to override could still be called at runtime. Therefore, overriding is somewhat prone to developer error.
de_de: In allen diesen Fällen kann das Web Bean, das wir außer Kraft zu setzen versucht haben, nach wie vor zur Runtime aufgerufen werden. Daher ist Außerkraftsetzung anfällig für Entwicklerfehler.
es_es: En cada uno de estos casos, el Web Bean que hemos tratado de omitir se podría llamar aún en el tiempo de ejecución. Por lo tanto, la omisión de alguna manera tiende a desarrollar error.
ja_jp: これらの各ケースで、オーバーライドしようとした Web Bean は、実行時に呼びだされる可能性があります。したがって、オーバーライドは開発時に間違いが発生しやすいと言えます。
ko_kr: 이러한 경우, 덮어 쓰기하려는 Web Bean은 런타임시 호출 가능해야 합니다 따라서, 덮어쓰기는 다소 개발자 오류를 초래하는 경우가 있습니다.
pt_br: Em cada um destes casos, o Web Bean que tentamos sobrescrever ainda podia ser chamado em tempo de execução. Portanto, a sobrescrita é algo propensa a erros de desenvolvimento.
zh_cn: 在上面的任何一种情况，我们试图重载的Web Bean仍旧可以在运行时被调用。因此重载对于开发者来说是很容易出错的。
zh_tw: 在各個情況下，我們所嘗試置換的 Web Bean 都還是可能在 runtime 時被調用。因此，置換可能會造成開發上的錯誤。

source: Web Beans provides a special feature, called <emphasis>specialization</emphasis>, that helps the developer avoid these traps. Specialization looks a little esoteric at first, but it's easy to use in practice, and you'll really appreciate the extra security it provides.
de_de: Web Beans bieten ein spezielles Feature namens <emphasis>Specialization</emphasis> (Spezialisierung), das dem Entwickler hilft, diese Stolperfallen zu umgehen. Specialization wirkt auf den ersten Blick etwas ungewöhnlich, ist aber in der Praxis einfach zu verwenden und Sie werden die zusätzliche Sicherheit, die es bietet bald schätzen.
es_es: Web Beans ofrece una función especial, llamada <emphasis>Specialization</emphasis>, la cual ayuda al desarrollador a evitar estas trampas. Specialization parece un poco esotérica al comienzo, pero es fácil de utilizar en la práctica y realmente apreciará la seguridad adicional que proporciona.
ja_jp: Web Beans は <emphasis>特殊化</emphasis> と呼ばれる独自の機能を提供します。 そして、それは開発者がこれらの罠を回避するのを助けます。特殊化は最初は少し難解に見えますが、それは実際には使いやすいものです。そして、あなたはそれが安全性を提供する事に本当に感謝する事でしょう。
ko_kr: Web Beans는 <emphasis>특성화</emphasis>라는 특별 기능을 제공하여, 개발자들이 이러한 함정에 빠지지 않도록 돕습니다. 특성화 기능은 처음에는 조금 난해하게 보이지만, 익숙해 지면 사용하기 쉬우며 제공되는 추가 보안 기능에 만족하실 것입니다.
zh_cn: Web Bean提供了一个特殊的特性，称之为<emphasis>特化</emphasis>，能够帮助开发者避免这些陷阱。特化初看起来有些神秘，但是在实际应用中非常容易使用，你很快就会感激它提供的特殊的安全性。
zh_tw: Web Bean 提供了一項特殊的功能稱為 <emphasis>specialization</emphasis>，它可協助開發人員避免發生這些錯誤。Specialization 一開始看起來似乎有些難懂，不過實際上卻相當易於使用，並且您將會慶幸擁有它所提供的額外安全性。

source: Using specialization
de_de: Verwendung von Spezialisierung
es_es: Uso de Specialization
ja_jp: 特殊化を使用する
ko_kr: 특성화 기능 사용
pt_br: Utilizando a especialização
zh_cn: 使用特化
zh_tw: 使用 specialization

source: Specialization is a feature that is specific to simple and enterprise Web Beans. To make use of specialization, the higher-priority Web Bean must:
de_de: Specialization ist ein Feature das spezifisch für einfache und Enterprise Web Beans ist. Um Specialization zu nutzen, muss ein Web Bean mit höherer Priorität:
es_es: Specialization es una función específica para Web Beans sencillos y empresariales. Para hacer uso de Specialization, la Web Bean de prioridad más alta debe:
ja_jp: 特殊化は、シンプルおよびエンタープライズ Web Beans に特有の特徴です。特殊化を利用するために、より高いプライオリティーの Web Bean は以下の条件を満たさなければなりません。
ko_kr: 특성화는 심플 Web Beans 및 엔터프라이즈 Web Beans에만 있는 기능입니다. 특성화 기능을 사용하려면 높은 우선 순위의 Web Bean은 다음 사항을 따라야 합니다:
pt_br: Especialização é uma característica que é específica de Web Beans simples e enterprise. Para fazer uso da especialização, o Web Bean de maior prioridade deve:
zh_cn: 特化是为简单和企业级Web Bean提供的特性。要使用特化，更高优先级的Web Bean必须：
zh_tw: Specialization 是一項基於基本和企業級 Web Bean 的功能。若要有效使用 specialization，擁有較高優先權的 Web Bean 必須：

source: be a direct subclass of the Web Bean it overrides, and
de_de: eine direkt Subklasse des Web Beans sein, das es außer Kraft setzt und
es_es: ser una subclase directa del Web Bean que omite y
ja_jp: それがオーバーライドする Web Bean の直接的なサブクラスです
ko_kr: 덮어쓰기할 Web Bean의 직접적인 하부 클래스가 되어야 합니다.
pt_br: ser uma subclasse direta do Web Bean que sobrescreve, e
zh_cn: 是其重载的Web Bean的直接子类，并且
zh_tw: 是個它所置換的 Web Bean 的直接 subclass，並且

source: be a simple Web Bean if the Web Bean it overrides is a simple Web Bean or an enterprise Web Bean if the Web Bean it overrides is an enterprise Web Bean, and
de_de: ein einfaches Web Bean sein, falls das Web Bean, das es außer Kraft setzt ein einfaches Web Bean ist oder ein Enterprise Web Bean sein, falls das Web Bean, das es außer Kraft setzt ein Enterprise Web Bean ist und
es_es: ser un Web Bean sencillo si el Web Bean que omite es un Web Bean sencillo o un Web Bean empresarial si el Web Bean que omite es un Web Bean empresarial y
ja_jp: それがオーバーライドする Web Bean がエンタープライズ Web Bean であるならば、エンタープライズ Web Beanで、それがオーバーライドする Web Beans がシンプル Web Bean であるならば、シンプル Web Beanです
ko_kr: 덮어쓰기할 Web Bean이 심플 Web Bean일 경우 심플 Web Bean이 되어야 하고 또는 덮어쓰기 할 Web Bean이 엔터프라이즈 Web Bean일 경우 엔터프라이즈 Web Bean이 되어야 합니다
pt_br: ser um simples Web se o Web Bean que sobrepuser for um Web Bean simples ou um Web Bean enterprise se o Web Bean que sobrepuser for um Web Bean enterprise, e
zh_cn: 如果其重载的是简单的Web Bean, 它也要是一个简单的Web Bean；如果其重载的是企业级的Web Bean, 它也要是一个企业级的Web Bean，并且
zh_tw: 若它所置換的 Web Bean 是個基本的 Web Bean，它就必須是個基本 Web Bean，或是若它所置換的 Web Bean 是個企業級的 Web Bean，那它就必須是個企業級的 Web Bean，並且

source: be annotated <literal>@Specializes</literal>.
de_de: <literal>@Specializes</literal> annotiert sein.
es_es: estar anotado <literal>@Specializes</literal>.
ja_jp: <literal>@Specializes</literal> アノテーションが付いています
ko_kr: <literal>@Specializes</literal>로 어노테이션되어야 합니다.
pt_br: será anotada <literal>@Specializes</literal>.
zh_cn: 需要使用 <literal>@Specializes</literal> 注释。
zh_tw: 需被標記 <literal>@Specializes</literal>。

source: We say that the higher-priority Web Bean <emphasis>specializes</emphasis> its superclass.
de_de: Wir sprechen davon, dass das Web Bean mit höherer Priorität seine Superklasse <emphasis>spezialisiert</emphasis>.
es_es: Decimos que el Web Bean de prioridad más alta<emphasis>especializa</emphasis> su superclase.
ja_jp: これは Web Bean がそのスーパークラスを <emphasis>特殊化</emphasis> すると言います。
ko_kr: 높은 우선 순위의 Web Bean이 해당 상위클래스를 <emphasis>특성화</emphasis>한다고 합니다.
pt_br: Nós dizemos que a alta prioridade na Web Bean <emphasis>specializa</emphasis> sua superclasse.
zh_cn: 我们称更高优先级的Web Bean<emphasis>特化</emphasis>了它的超类。
zh_tw: 優先權較高的 Web Bean 會 <emphasis>specializes</emphasis> 它的 superclass。

source: Advantages of specialization
de_de: Vorteile von Spezialisierung
es_es: Ventajas de Specialization
ja_jp: 特殊化の長所
ko_kr: 특성화 기능의 장점
pt_br: Vantagens da especialização
zh_cn: 特化的优点
zh_tw: Specializarion 的優點

source: When specialization is used:
de_de: Wann Spezialisierung eingesetzt wird:
es_es: Cuando se utiliza Specialization:
ja_jp: 特殊化が使用されるとき
ko_kr: 특성화 기능 사용시:
pt_br: Quando a especialização é utilizada:
zh_cn: 当使用特化时：
zh_tw: 當使用了 specialization 時：

source: the binding types of the superclass are automatically inherited by the Web Bean annotated <literal>@Specializes</literal>, and
de_de: DIe Binding-Typen der Superklasse werden automatisch durch das mit <literal>@Specializes</literal> annotierte Web Bean geerbt und
es_es: los tipos de enlace de la superclase son heredados automáticamente por el Web Bean anotado <literal>@Specializes</literal>, y
ja_jp: スーパークラスのバインディングタイプは、 Web Bean アノテーションを付けた <literal>@Specializes</literal> によって、自動的に継承されます
ko_kr: 상위클래스의 바인딩 유형은 <literal>@Specializes</literal>로 어노테이션된 Web Bean에 의해 자동으로 상속됩니다
zh_cn: 超类的绑定类型自动被使用<literal>@Specializes</literal>注释的Web Bean继承，并且
zh_tw: superclass 的綁定類型就會自動地被標記為 <literal>@Specializes</literal> 的 Web Bean 繼承，並且

source: the Web Bean name of the superclass is automatically inherited by the Web Bean annotated <literal>@Specializes</literal>, and
de_de: der Web Bean Name der Superklasse wird automatisch automatisch durch das mit <literal>@Specializes</literal> annotierte Web Bean geerbt und
es_es: el nombre de Web Bean de la superclase es heredado automáticamente por el Web Bean anotado <literal>@Specializes</literal>, y
ja_jp: スーパークラスの Web Bean 名は、 Web Bean アノテーションを付けた <literal>@Specializes</literal> によって自動的に継承されます
ko_kr: 상위클래스의 Web Bean 이름은 <literal>@Specializes</literal>로 어노테이션된 Web Bean에 의해 자동으로 상속됩니다
zh_cn: 超类的Web Bean名称自动被使用<literal>@Specializes</literal>注释的Web Bean继承，并且
zh_tw: superclass 的 Web Bean 名稱會自動地被標記為 <literal>@Specializes</literal> 的 Web Bean 繼承，並且

source: producer methods, disposal methods and observer methods declared by the superclass are called upon an instance of the Web Bean annotated <literal>@Specializes</literal>.
de_de: durch die Superklasse deklarierte Producer-Methoden, Bereinigungsmethoden und Observer-Methoden werden durch eine Instanz des mit <literal>@Specializes</literal> annotierten Web Beans aufgerufen.
es_es: los métodos de productor, métodos desechables y métodos de observador declarados por la superclase son llamados por una instancia del Web Bean anotado <literal>@Specializes</literal>.
ja_jp: スーパークラスによって宣言される プロデューサメソッド、ディスポーザルメソッド、またはオブザーバメソッドは、 Web Bean のアノテーションを付けた <literal>@Specializes</literal> のインスタンスに呼ばれます
ko_kr: 상위클래스에 의해 명시된 생산자 방식, 폐지 방식 및 옵저버 방식은 <literal>@Specializes</literal>로 어노테이션된 Web Bean 인스턴스를 호출합니다.
pt_br: métodos produtores, métodos de eliminação e métodos observadores declarados pela superclasse são chamados sobre uma instância do Web Bean anotado com <literal>@Specializes</literal>.
zh_cn: 超类声明的生产者方法，清除方法和观察者方法将在使用<literal>@Specializes</literal>注释的Web Bean实例上调用。
zh_tw: superclass 所宣告的 producer method、disposal method 以及 observer method 會被一個標記了 <literal>@Specializes</literal> 的 Web Bean instance 調用。

source: In our example, the binding type <literal>@CreditCard</literal> of <literal>CreditCardPaymentProcessor</literal> is inherited by <literal>StagingCreditCardPaymentProcessor</literal>.
de_de: In unserem Beispiel wird der Binding-Typ <literal>@CreditCard</literal> von <literal>CreditCardPaymentProcessor</literal> von <literal>StagingCreditCardPaymentProcessor</literal> geerbt.
es_es: En nuestro ejemplo, el tipo de enlace <literal>@CreditCard</literal> de <literal>CreditCardPaymentProcessor</literal> es heredado por <literal>StagingCreditCardPaymentProcessor</literal>.
ja_jp: 例で、 <literal>CreditCardPaymentProcessor</literal> のバインディングタイプ <literal>@CreditCard</literal> は、 <literal>StagingCreditCardPaymentProcessor</literal> によって継承されます。
ko_kr: 예에서 <literal>CreditCardPaymentProcessor</literal>의 <literal>@CreditCard</literal> 바인딩 유형은 <literal>StagingCreditCardPaymentProcessor</literal>에 의해 전승됩니다.
pt_br: Em nosso exemplo, o tipo de ligação (binding type) <literal>@CreditCard</literal> do <literal>CreditCardPaymentProcessor</literal> é herdado por <literal>StagingCreditCardPaymentProcessor</literal>.
zh_cn: 在我们这个例子中，<literal>CreditCardPaymentProcessor</literal> 的绑定类型 <literal>@CreditCard</literal> 被<literal>StagingCreditCardPaymentProcessor</literal>继承。
zh_tw: 在我們的範例中，<literal>CreditCardPaymentProcessor</literal> 的 <literal>@CreditCard</literal> 綁定類型會被 <literal>StagingCreditCardPaymentProcessor</literal> 繼承。

source: Furthermore, the Web Bean manager will validate that:
de_de: Desweiteren validiert der Web Bean Manager dies:
es_es: Además, el administrador de Web Bean confirmará que:
ja_jp: さらにまた、 Web Bean マネージャは、以下の妥当性を検査します。
ko_kr: Web Bean 관리자는 다음 사항을 유효화합니다:
pt_br: Além disso, o gerenciador do Web Bean irá validar que:
zh_cn: 进一步，Web Bean管理器将验证：
zh_tw: 另外，Web Bean 管理員會針對於以下情形進行驗證：

source: all API types of the superclass are API types of the Web Bean annotated <literal>@Specializes</literal> (all local interfaces of the superclass enterprise bean are also local interfaces of the subclass),
de_de: alle API-Typen der Superklasse sind API-Typen des mit <literal>@Specializes</literal> annotierten Web Beans (alle lokalen Interfaces der Superklasse Enterprise Bean sind auch lokale Interfaces der Subklasse),
es_es: todos los tipos de API de la superclase son tipos de API del Web Bean anotado <literal>@Specializes</literal> (todas las interfaces locales del bean empresarial de superclase también son interfaces locales de la subclase),
ja_jp: スーパークラスのすべての API 型は、 Web Bean アノテーションを付けた <literal>@Specializes</literal> （スーパークラス・エンタープライズ bean のすべてのローカルインターフェースは、サブクラスのローカルインターフェースでもあります）の API 型であること
ko_kr: 상위클래스의 모든 API 유형은 <literal>@Specializes</literal>로 어노테이션된 Web Bean의 API 유형입니다 (상위클래스 엔터프라이즈 빈의 모든 로컬 인터페이스는 하부클래스의 로컬 인터페이스도 됩니다)
zh_cn: 超类的所有API类型是使用 <literal>@Specializes</literal> 注释的Web Bean的API类型（所有企业级Bean超类的本地接口是子类的本地接口）
zh_tw: superclass 的所有 API 類型都會是標記為 <literal>@Specializes</literal> 的 Web Bean 的 API 類型（superclass enterprise bean 的所有本地介面也都屬於 subclass 的本地介面）、

source: the deployment type of the Web Bean annotated <literal>@Specializes</literal> has a higher precedence than the deployment type of the superclass, and
de_de: der Deployment-Typ des mit <literal>@Specializes</literal> annotierten Web Bean besitzt Vorrang vor dem Deployment-Typ der Superklasse und
es_es: el tipo de despliegue del Web Bean anotado <literal>@Specializes</literal> tiene una prioridad más alta que el tipo de despliegue de la superclase, y
ja_jp: Web Bean アノテーションを付けた <literal>@Specializes</literal> のデプロイメントタイプは、スーパークラスのデプロイメントタイプより高い優先順位を持つこと
ko_kr: <literal>@Specializes</literal>로 어노테이션된 Web Bean의 배치 유형은 상위클래스의 배치 유형보다 높은 우선 순위를 갖습니다
pt_br: o tipo de implantação do Web Bean anotado com <literal>@Specializes</literal> tem uma precedência maior do que o tipo de implantação da superclasse, e
zh_cn: 使用 <literal>@Specializes</literal> 注释的Web Bean的部署类型比超类的部署类型拥有更高的优先级，并且
zh_tw: 標記為 <literal>@Specializes</literal> 的 Web Bean 的 deployment type 擁有比 superclass 的 deployment type 還要高的優先權，以及

source: there is no other enabled Web Bean that also specializes the superclass.
de_de: es existiert keun weiteres aktiviertes Web Bean, das ebenfalls die Superklasse spezialisiert.
es_es: no hay ningún otro Web Bean habilitado que también especialice la superclase.
ja_jp: また、スーパークラスを特殊化する他のいかなる有効化された Web Bean も存在しないこと
ko_kr: 상위클래스를 특성화하는 활성화된 Web Bean이 없습니다.
pt_br: não há outro Web Bean ativado que também especializa a superclasse.
zh_cn: 没有其他特化该超类的Web Bean被激活。
zh_tw: 沒有其它已啟用的 Web Bean 會 specialize 該 superclass。
