Repository: 1tchy/core
Catalog: reference/*/specialization.po
Languages: de_de, es_es, ja_jp, ko_kr, pt_br, zh_cn, zh_tw

source: If any of these conditions are violated, the Web Bean manager throws an exception at initialization time.
de_de: Wird eine dieser Bedingungen verletzt, so meldet der Web Bean Manager zum Zeitpunkt der Initialisierung eine Ausnahme.
es_es: Si se violan algunas condiciones, el administrador de Web Bean produce una excepción en el momento de la inicialización.
ja_jp: これらの条件のいずれかが違反されるならば、 Web Bean マネージャは初期化時に例外をスローします。
ko_kr: 이러한 조건을 위반할 경우, Web Bean 관리자는 초기화시 예외 처리를 넘기게 됩니다.
pt_br: Se qualquer uma dessas condições são violadas, o gerenciador do Web Bean lança uma excepção em tempo de inicialização.
zh_cn: 如果任何一条有冲突的话，Web Bean管理器将在初始化时抛出一个异常。
zh_tw: 若任何的這些條件被違反的話，Web Bean 管理員便會在初始化時回傳一個 exception。

source: Therefore, we can be certain that the superclass will <emphasis>never</emphasis> be called in any deployment of the system where the Web Bean annotated <literal>@Specializes</literal> is deployed and enabled.
de_de: Wir können daher sicher sein, dass die Superklasse <emphasis>nie</emphasis> bei einem Deployment des Systems bei dem das mit <literal>@Specializes</literal> annotierte Web Bean deployt und aktiviert wird, aufgerufen wird.
es_es: Por lo tanto, podemos estar seguros que la superclase <emphasis>nunca</emphasis> será llamada en ningún despliegue del sistema donde el Web Bean anotado <literal>@Specializes</literal> esté desplegado y habilitado.
ja_jp: したがって、 <literal>@Specializes</literal> の付いた Web Bean がデプロイされ、有効化されると、スーパークラスがデプロイの間に <emphasis>決して</emphasis> 呼び出されないことは確かです。
ko_kr: 따라서, <literal>@Specializes</literal>라고 어노테이션된 Web Bean이 배치되어 활성화된 시스템의 어떤 배치에서도 상위클래스는 <emphasis>절대로</emphasis> 호출되지 않음을 확인할 수 있습니다.
zh_cn: 因此，我们可以确定当使用<literal>@Specializes</literal>注释的Web Bean被部署和激活时，超类在系统的任何部署中<emphasis>都不会</emphasis>被调用。
zh_tw: 因此，我們能夠確定當標記為 <literal>@Specializes</literal> 的 Web Bean 被建置並啟用的情況下，superclass <emphasis>絕不</emphasis>會在系統的任何 deployment 中被調用。
