Repository: 1tchy/core
Catalog: reference/*/stereotypes.po
Languages: de_de, es_es, ja_jp, ko_kr, pt_br, zh_cn, zh_tw

source: Stereotypes
de_de: Stereotypen
es_es: Estereotipos
ja_jp: ステレオタイプ
ko_kr: 스테레오타입 (Stereotypes)
pt_br: Steriotipos
zh_cn: 模板
zh_tw: 主要探討模板（Stereotypes）

source: According to the Web Beans specification:
de_de: Gemäß der Web Beans Spezifikation:
es_es: Según la especificación de Web Beans:
ja_jp: Web Beans の仕様に従って
ko_kr: Web Beans 사양에 따라:
pt_br: De acordo com a especificação Web Beans:
zh_cn: 根据Web Bean规范：
zh_tw: 根據 Web Bean 規格：

source: In many systems, use of architectural patterns produces a set of recurring Web Bean roles. A stereotype allows a framework developer to identify such a role and declare some common metadata for Web Beans with that role in a central place.
de_de: In vielen Systemen produziert die Verwendung architektonischer Muster einen Satz wiederkehrender Web Bean Rollen. Ein Stereotyp gestattet dem Entwickler eines Frameworks die Identifizierung einer solchen Rolle und die Deklaration einiger gemeinsamer Metadaten für Web Beans mit dieser Rolle an einer zentralen Stelle.
es_es: En muchos sistemas, el uso de patrones arquitecturales produce una serie de roles de Web Beans recurrentes. Un estereotipo permite al desarrollador de marco identificar dicho rol y declarar algunos metadatos comunes para Web Beans con ese rol en un lugar central.
ja_jp: 多くのシステムでは、アーキテクチャパターンを使用することで、繰り返される Web Bean の役割を作り出すことでしょう。ステレオタイプは、フレームワーク開発者がそのような役割を認識し、集約された場所において Web Beans のための共通のメタデータを宣言できるようにします。
ko_kr: 여러 시스템에서, 아키텍처 패턴을 사용하여 Web Bean 역할을 반복하는 모음을 생산합니다. 스테레오타입은 프레임워크 개발자가 이러한 역할을 인식하고 중앙 위치에서의 역할과 함께 Web Beans의 일반적인 메타데이터를 명시하게 합니다.
pt_br: Em muitos sistemas, a utilização de padrões arquiteturais produz um conjunto de recorrentes papéis Web Bean. Um estereótipo permite que um desenvolvedor de framwework identificar esse papel e declarar alguns metadados comums para Web Beans com esse papel em um local centralizado.
zh_cn: 在很多系统中，体系模式的使用会产生一套重复发生的Web Bean角色。一个模板允许一个框架开发者来识别这样的一个角色，并且在一个中心地方为拥有这个角色的Web Bean声明一些通用的元数据。
zh_tw: 在許多系統中，使用架構的模式會產生一組循環的 Web Bean 工作。主要探討模板能讓一個 framework 開發人員辨識出這樣的一項工作，並在一個中央位置中為含有該工作的 Web Bean 宣告一些共通 metadata。

source: A stereotype encapsulates any combination of:
de_de: Ein Stereotyp beinhaltet eine beliebige Kombination von:
es_es: Un estereotipo encapsula cualquier combinación de:
ja_jp: ステレオタイプは、以下のどんな組み合わせでもカプセル化します。
ko_kr: 스테레오타입은 다음의 조합을 캡슐화합니다:
pt_br: Um estereótipo encapsula qualquer combinação de:
zh_cn: 一个模板封装了下面的任何组合：
zh_tw: 主要探討模板包含著下列任意的各種組合：

source: a default deployment type,
de_de: einem standardmäßigen Deployment-Typ,
es_es: un tipo de despliegue predeterminado,
ja_jp: デフォルトデプロイメントタイプ
ko_kr: 기본값 배치 유형
pt_br: um tipo padrão de implantação (deployment type),
zh_cn: 一个默认的部署类型，
zh_tw: 預設的建置類型、

source: a default scope type,
de_de: einem standardmäßigen Geltungsbereich-Typ,
es_es: un tipo de ámbito predeterminado,
ja_jp: デフォルトスコープタイプ
ko_kr: 기본값 범위 유형
pt_br: um tipo de scopo padrão,
zh_cn: 一个默认的范围类型，
zh_tw: 預設的 scope 類型、

source: a restriction upon the Web Bean scope,
de_de: einer Einschränkung hinsichtlich des Geltungsbereichs des Web Beans,
es_es: una restricción en el ámbito de Web Bean,
ja_jp: Web Bean スコープの制限
ko_kr: Web Bean 범위에서의 제한,
pt_br: uma restrição ao escopo do Web Bean,
zh_cn: 一个对于Web Bean范围的限制
zh_tw: 基於 Web Bean scope 的限制、

source: a requirement that the Web Bean implement or extend a certain type, and
de_de: einer Anforderung, dass das Web Bean einen bestimmten Typ implementiert oder erweitert und
es_es: un requisito que implementa el Web Bean o extiende un cierto tipo y
ja_jp: Web Bean が特定の型を実装するか、拡張するという要件
ko_kr: 특정 유형을 Web Bean이 구현하거나 확장하기 위한 요구 사항
pt_br: uma exigência de que o Web Bean implemente ou estenda um certo tipo, e
zh_cn: 一个Web Bean实现或者继承一个特定类型的需求，以及
zh_tw: Web Bean 實做或延伸特定類型的需求，以及

source: a set of interceptor binding annotations.
de_de: einem Satz von Interzeptor Binding Annotationen.
es_es: una serie de anotaciones de enlace del interceptor.
ja_jp: 一組のインタセプタバインディングアノテーション
ko_kr: 인터셉터 바인딩 어노테이션 모음
pt_br: um conjunto de anotações para ligação de interceptadores
zh_cn: 一套拦截器绑定注释。
zh_tw: 一組攔截器綁定標記。

source: A stereotype may also specify that all Web Beans with the stereotype have defaulted Web Bean names.
de_de: Ein Stereotyp kann auch festlegen, dass alle Web Beans mit dem Stereotyp standardmäßige Web Bean Namen besitzen.
es_es: Un estereotipo puede también especificar que todos los Web Beans con el estereotipo tengan nombres de Web Beans predeterminados.
ja_jp: あるステレオタイプを持つすべての Web Beans が、デフォルトの Web Beans 名を持つようにステレオタイプを指定する事もありえます。
ko_kr: 스테레오타입은 스테레오타입이 있는 모든 Web Beans이 Web Bean 이름을 기본값으로 하도록 지정할 수 도 있습니다.
pt_br: Um estereótipo também pode especificar que todos os Web Beans com o estereótipo têm um nome de Web Bean padrão.
zh_cn: 一个模板也可以指定所有使用这个模板的Web Bean拥有的默认的Web Bean名称。
zh_tw: 主要探討模板亦可指定所有還有該主要探討模板的 Web Bean 都含有預設的 Web Bean 名稱。

source: A Web Bean may declare zero, one or multiple stereotypes.
de_de: Ein Web Bean kann null, ein oder mehrere Stereotypen deklarieren.
es_es: Un Web Bean puede declarar cero, uno o múltiples estereotipos.
ja_jp: Web Bean は、無し、一つまたは複数のステレオタイプを宣言することがあります。
ko_kr: Web Bean은 0 또는 하나 이상의 스테레오타입을 명시할 있습니다.
pt_br: Um Web Bean pode declarar zero, um ou vários estereótipos.
zh_cn: 一个Web Bean可以声明零个，一个或者多个模板。
zh_tw: Web Bean 可宣告零、一或多個主要探討模板。

source: A stereotype is a Java annotation type. This stereotype identifies action classes in some MVC framework:
de_de: Bei einem Stereotyp handelt es sich um einen Java Annotationstyp. Dieses Stereotyp identifiziert Action-Klassen in einem MVC-Framework:
es_es: Un estereotipo es un tipo de anotación Java. Dicho estereotipo identifica clases de acción en algún marco MVC:
ja_jp: ステレオタイプは、Java アノテーションタイプです。このステレオタイプは、いくつかの MVC フレームワークでアクションクラスを特定します。
ko_kr: 스테레오타입은 Java 어노테이션 유형입니다. 이러한 스테레오타입은 일부 MVC 프레임워크에서 작업 클래스를 인식합니다:
pt_br: Um estereótipo é um tipo de anotação Java. Este estereótipo identifica as classes de ação em algum frameworks MVC:
zh_cn: 一个模板其实就是一个Java注释类型。这个模板在一些MVC框架中识别动作类：
zh_tw: 主要探討模板為 Java 標記類型。這個主要探討模板可辨識一些 MVC 架構中的動作 class：

source: We use the stereotype by applying the annotation to a Web Bean.
de_de: Wir verwenden das Stereotyp durch Anwendung der Annotation an einem Web Bean.
es_es: Utilizamos el estereotipo aplicando la anotación al Web Bean.
ja_jp: このアノテーションを Web Bean に適用することによって、ステレオタイプを使います。
ko_kr: Web Bean에 어노테이션을 적용하여 스테레오타입을 사용합니다.
pt_br: Nós utilizamos o esteriótipo aplicando a anotoção ao Web Bean.
zh_cn: 我们注释来让Web Bean应用模板
zh_tw: 我們藉由套用標記至 Web Bean 來使用主要探討模板。

source: Default scope and deployment type for a stereotype
de_de: Standardmäßiger Geltungsbereich und Deployment-Typ für ein Stereotyp
es_es: El ámbito predeterminado y el tipo de despliegue para un estereotipo
ja_jp: ステレオタイプのデフォルトスコープとデプロイメントタイプ
ko_kr: 스테레오타입에 대한 기본값 범위 및 배치 유형
pt_br: Scopo padrão e
zh_cn: 一个模板默认的范围和部署类型
zh_tw: 主要探討模板的預設 scope 和建置類型

source: A stereotype may specify a default scope and/or default deployment type for Web Beans with that stereotype. For example, if the deployment type <literal>@WebTier</literal> identifies Web Beans that should only be deployed when the system executes as a web application, we might specify the following defaults for action classes:
de_de: Ein Stereotyp kann den standardmäßigen Geltungsbereich und/oder standardmäßigen Deployment-Typ für Web Beans mit diesem Stereotyp festlegen. Identifiziert der Deployment-Typ <literal>@WebTier</literal> etwa, dass Web Beans nur deployt werden sollten, wenn das System als eine Webanwendung ausgeführt wird, so könnten wird die folgenden Standards für Action-Klassen festlegen:
es_es: Un estereotipo puede especificar un ámbito y /o tipo de despliegue predeterminados para Web Beans con ese estereotipo. Por ejemplo, si el tipo de despliegue <literal>@WebTier</literal> identifica Web Beans que deben ser desplegados sólo cuando el sistema se ejecuta como una aplicación de red, podríamos especificar los siguientes valores por defecto para clases de acción:
ja_jp: ステレオタイプでは、 Web Beans のためにデフォルトスコープやデフォルトデプロイメントタイプを明示することがありえます。たとえば、システムが web アプリケーションとして実行するとき、デプロイメントタイプ<literal>@WebTier</literal>がデプロイされるべき Web Beans を特定するならば、アクションクラスのために以下のデフォルトを明示するかもしれません。
ko_kr: 스테레오타입은 해당 스테레오타입과 함께 Web Beans의 기본값 범위 또는 기본값 배치 유형을 지정할 수 있습니다. 예를 들어, <literal>@WebTier</literal> 배치 유형이 시스템이 웹 애플리케이션으로 실행될 때만 Web Beans이 배치됨을 인식할 경우, 각각의 작업 클래스에 대해 다음과 같은 기본값을 지정할 수 있습니다:
pt_br: Um estereotipo pode especificar um escopo padrão e/ou um tipo padrão de implantação (deployment type) para Web Beans com esse estereótipo. Por exemplo, se o tipo de implantação (deployment type) <literal>@WebTier</literal> identifica Web Beans que só deverão ser implantados quando o sistema executa como uma aplicação web, podemos especificar os seguintes padrões de classes de ação :
zh_cn: 一个模板可以为使用该模板的Web Bean指定一个默认的范围或者默认的部署类型。例如，如果<literal>@WebTier</literal> 部署类型识别那些只应该在系统作为一个Web应用运行时才应该部署的Web Bean，我们可以为动作类指定下面的默认值：
zh_tw: 主要探討模板可為含有該主要探討模板的 Web Bean 指定預設的 scope 與/或預設的建置類型。比方說，若 <literal>@WebTier</literal> 這個建置類型將只應在系統被執行時才被建置的 Web Bean 視為一個網站應用程式的話，我們可為 action class 指定下列預設值：

source: Of course, a particular action may still override these defaults if necessary:
de_de: Natürlich kann eine bestimmte Action diese Standards falls nötig immer noch außer Kraft setzen:
es_es: Obviamente, una acción particular aún puede omitir estos valores predeterminados si es necesario:
ja_jp: もちろん、特定の動作は、必要に応じてこれらのデフォルトに今まで通りオーバーライドすることがありえます。
ko_kr: 물론 특정 작업은 필요할 경우 이러한 기본값을 덮어쓰기할 수 있습니다:
pt_br: Evidentemente, uma determinada ação pode ainda substituir esses padrões, se necessário:
zh_cn: 当然，如果必要的话，一个特殊的动作类仍旧可以重载这些默认值：
zh_tw: 當然，若有必要的話，有個特定的動作也可置換這些預設值：

source: If we want to force all actions to a particular scope, we can do that too.
de_de: Wenn wir alle Actions in einen bestimmten Geltungsbereich zwingen wollen, so können wir auch das tun.
es_es: Si deseamos forzar todas las acciones a un ámbito determinado, también lo podemos hacer.
ja_jp: すべての動作を特定のスコープに移動したいならば、またそうすることができます。
ko_kr: 모든 작업을 특정 범위로 강제시키고자 할 경우, 강제시킬 수 있습니다.
pt_br: Se nós quisermos forçar todas as ações para um escopo particular, nós podemos fazer isso também.
zh_cn: 如果我们想要敬爱那个所有动作类强制在某个特殊的范围，我们也可以这样做。
zh_tw: 若我們希望強制所有動作依照某個特定 scope 的話，我們也可以這麼作。

source: Restricting scope and type with a stereotype
de_de: Einschränkung des Geltungsbereichs und Typs mit einem Stereotyp
es_es: Restricción de ámbito y tipo con un estereotipo
ja_jp: ステレオタイプによるスコープと型の制限
ko_kr: 스테레오타입으로 범위 및 유형 제한
pt_br: Restringindo escopo e tipo com um esteriótipo
zh_cn: 通过模板来限制范围和类型
zh_tw: 利用主要探討模板來限制 scope 與 type

source: Suppose that we wish to prevent actions from declaring certain scopes. Web Beans lets us explicitly specify the set of allowed scopes for Web Beans with a certain stereotype. For example:
de_de: Nehmen wir an, wir wollten verhindern, dass Actions bestimmte Geltungsbereiche deklarieren. Web Beans lässt uns den Satz gestatteter Geltungsbereiche für Web Beans mit einem bestimmten Stereotyp explizit festlegen. Zum Beispiel:
es_es: Supongamos que deseamos evitar acciones de declarar determinados ámbitos. Web Beans nos permite especificar explícitamente la serie de ámbitos permitidos para Web Beans con un estereotipo determinado. Por ejemplo:
ja_jp: 特定のスコープを宣言できないようにしたいと仮定します。 Web Beans では、ステレオタイプを使って Web Beans に許可されたスコープを明示的に指定できます。例を以下に示します。
ko_kr: 어떤 작업이 특정 범위를 명시하지 못하게 하길 원한다고 가정합니다. Web Beans는 특정 스테레오타입과 함께 Web Beans의 허용 범위 모음을 명시적으로 지정할 수 있게 합니다. 예:
pt_br: Suponha que queremos impedir as ações de declarar certos escopos. Web Beans permite-nos indicar explicitamente o conjunto de escopos permitidos para Web Beans com um certo estereótipo. Por exemplo:
zh_cn: 假定我们希望那个通过特定的范围声明来阻止一个动作。Web Bean可以让我们显式地为使用特定模板的Web Bean指定一套允许的范围。例如：
zh_tw: 假設我們希望防止動作去宣告特定 scope，Web Bean 能讓我們透過特定主要探討模板來明確地為 Web Bean 指定一組被允許的 scope。例如：

source: If a particular action class attempts to specify a scope other than the Web Beans request scope, an exception will be thrown by the Web Bean manager at initialization time.
de_de: Falls eine bestimmte Action-Klasse versucht einen anderen Geltungsbereich als den Anfragen-Geltungsbereich der Web Beans festzulegen, so wird zum Initialisierungszeitpunkt durch den Web Bean Manager eine Ausnahme gemeldet.
es_es: Si una clase de acción determinada intenta especificar un ámbito diferente al ámbito de la petición de Web Beans, el administrador de Web Bean producirá una excepción en el momento de inicialización.
ja_jp: 特定のアクションクラスが Web Beans リクエスト スコープ以外のスコープを指定しようとするならば、例外はWeb Bean マネージャによって初期化時点にスローされます。
ko_kr: 특정 작업 클래스가 Web Beans 요청 범위 외의 범위를 지정하려고 할 경우, 초기화시 예외 처리가 Web Bean 관리자에 의해 넘어가게 됩니다.
pt_br: Se uma determinada classe de ação tenta especificar um escopo diferente do escopo de requisição (request scope) do Web Beans, uma exceção será lançada pelo gereneciador do Web Bean em tempo de inicialização.
zh_cn: 如果一个特殊的动作类试图指定超越Web Bean请求范围的范围，Web Bean管理器在初始化时就会抛出一个异常。
zh_tw: 若有個特定 action class 嘗試指定一個非 Web Bean 所請求的 scope 的話，Web Bean 管理員便會在初始化時丟出一個 exception。

source: We can also force all Web Bean with a certain stereotype to implement an interface or extend a class:
de_de: Wir können auch alle Web Beans mit einem bestimmten Stereotyp zur Implementierung eines Interface oder Erweiterung einer Klasse zwingen:
es_es: También podemos forzar todos los Web Bean con un estereotipo determinado para implementar una interfaz o extender una clase:
ja_jp: 特定のステレオタイプをもつすべての Web Bean にインターフェースを実装するか、クラスを拡張することを強制することもできます。
ko_kr: 특정 스테레오타입과 함께 모든 Web Bean을 강제하여 인터페이스를 구현하거나 클래스를 확장할 수 있습니다:
pt_br: Nós também podemos forçar todos os Web Bean com um certo estereótipo implementar uma interface ou estender uma classe:
zh_cn: 我们也可以强制所有的使用特定模板的Web Bean实现一个接口或者继承一个类：
zh_tw: 我們也能強制所有含有特定主要探討模板的 Web Bean 實做一個介面或延伸一個 class：

source: If a particular action class does not extend the class <literal>AbstractAction</literal>, an exception will be thrown by the Web Bean manager at initialization time.
de_de: Falls eine bestimmte Action-Klasse die Klasse <literal>AbstractAction</literal> nicht erweitert, so wird zum Initialisierungszeitpunkt eine Ausnahme durch den Web Bean Manager gemeldet.
es_es: Si una clase particular de acción no extiende la clase <literal>AbstractAction</literal>, el administrador de Web Bean producirá una excepción en el momento de inicialización.
ja_jp: 特定のアクションクラスがクラス <literal>AbstractAction</literal> を拡張しないならば、例外は Web Bean マネージャによって初期化時点にスローされます。
ko_kr: 특정 작업 클래스가 <literal>AbstractAction</literal> 클래스를 확장하지 않을 경우, 초기화시 예외 처리가 Web Bean 관리자에 의해 넘어가게 됩니다.
pt_br: Se uma determinada classe de ação não estende a classe <literal>AbstractAction</literal>, uma exceção será lançada pelo gerenciador do Web Bean em tempo de inicialização.
zh_cn: 如果一个特殊的动作类没有继承 <literal>AbstractAction</literal>，Web Bean管理器会在初始化时抛出一个异常。
zh_tw: 若某個特定 action class 沒有延伸 <literal>AbstractAction</literal> 這個 class 的話，Web Bean 管理員便會在初始化時丟出一個 exception。

source: Interceptor bindings for stereotypes
de_de: Interzeptor-Bindings für Stereotypen
es_es: Enlaces de interceptor para esterotipos
ja_jp: ステレオタイプのためのインターセプタバインディング
ko_kr: 스테레오타입 용 인터셉터 바인딩
pt_br: Interceptor bindings de estereótipos
zh_cn: 模板的拦截器绑定
zh_tw: 主要探討模板的攔截器綁定

source: A stereotype may specify a set of interceptor bindings to be inherited by all Web Beans with that stereotype.
de_de: Ein Stereotyp kann einen Satz von Interzeptor-Bindings festlegen, der an alle Web Beans mit diesem Stereotyp vererbt werden soll.
es_es: Un estereotipo puede especificar una serie de enlaces de interceptor para que sean heredados por todos los Web Beans con ese estereotipo.
ja_jp: ステレオタイプは、そのステレオタイプですべての Web Beans によって受け継がれるために、一組のインターセプタバインディングを明示することがありえます。
ko_kr: 스테레오타입은 스테레오타입과 함께 모든 Web Beans에 의해 상속되기 위해 인터셉터 바인딩 모음을 지정할 수 있습니다.
pt_br: Um esteriótipo pode especificar um conjunto de interceptadores de ligação (interceptor bindings) a ser herdado por todos os Web Beans com esse estereótipo.
zh_cn: 一个模板指定一套拦截器绑定让使用该模板的Web Bean继承。
zh_tw: 主要探討模板可指定一組攔截器綁定來被所有含有該主要探討模板的 Web Bean 繼承。

source: This helps us get technical concerns even further away from the business code!
de_de: Dies hilft uns einen weiteren Schritt weiter in Richtung der Trennung technischer Probleme und Business Code!
es_es: ¡Esto nos ayuda a obtener cuestiones técnicas aún más allá del código de negocios!
ja_jp: これは、ビジネスコードから離れてさらに技術的関心事を理解するのを助けます。
ko_kr: 이는 비지니스 코드에서 발생할 수 있는 기술적 문제를 발생하지 않게 합니다!
pt_br: Isso nos ajuda a manter as preocupações técnicas (technical concerns) ainda mais longe do código de negócios!
zh_cn: 这将能够帮助我们从业务代码中剥离技术关注点！
zh_tw: 這可協助我們減少 business code 中技術上的問題！

source: Name defaulting with stereotypes
de_de: Namensstandardisierung und Stereotype
es_es: Predeterminación de nombre con estereotipos
ja_jp: ステレオタイプによる名前のデフォルティング
ko_kr: 스테레오타입과 함께 이름을 기본값으로 지정
pt_br: Padronização de nomes com estereótipos
zh_cn: 模板的默认命名
zh_tw: 主要探討模板的名稱預設

source: Finally, we can specify that all Web Beans with a certain stereotype have a Web Bean name, defaulted by the Web Bean manager. Actions are often referenced in JSP pages, so they're a perfect use case for this feature. All we need to do is add an empty <literal>@Named</literal> annotation:
de_de: Zu guter Letzt können wir auch noch festlegen, dass alle Web Beans mit einem bestimmten Stereotyp einen Web Bean Namen besitzen, der vom Web Bean Manager standardisiert wird. Actions werden oft in JSP-Seiten referenziert, so dass sie den perfekten Anwendungsfall für dieses Feature darstellen. Alles, was wir tun müssen ist eine leere <literal>@Named</literal>-Annotation hinzuzufügen:
es_es: Por último, podemos especificar que todos los Web Beans con un determinado estereotipo tengan un nombre de Web Bean, predeterminado por el administrador del Web Bean. Se suele hacer referencia a las acciones en páginas JSP, así que son un caso de uso perfecto para esta función. Todo lo que necesitamos es agregar una anotación vacía a <literal>@Named</literal>.
ja_jp: 最後に、特定のステレオタイプによるすべての Web Beans が Web Bean の名前を持つことを明示することができて、 Web Bean マネージャによってデフォルトとしました。アクションは JSP ページでよく参照されるので、それらがこの機能の完璧なユースケースとなっています。必要なのは、空の <literal>@Named</literal> アノテーションを加えることだけです。
ko_kr: 마지막으로 특정 스테레오타입과 함께 모든 Web Beans가 Web Bean 관리자에 의해 기본값으된 Web Bean 이름을 갖도록 지정할 수 있습니다. 작업은 JSP 페이지에서 참조할 수 있어, 이러한 기능을 완벽하게 사용할 수 있는 경우라 할 수 있습니다. 필요한 작업은 빈 <literal>@Named</literal> 어노테이션을 추가하는 것입니다:
pt_br: Por último, é possível especificar que todos os Web Beans com um certo estereótipo tem um nome Web Bean, padronizado pelo gerenciador do Web Bean. As ações são muitas vezes referenciadas em páginas JSP, por isso eles são um caso de utilização perfeito deste recurso. Tudo o que precisamos fazer é adicionar uma anotação <literal>@Nome</literal> vazia:
zh_cn: 最后，我们可以为所有使用模板的Web Bean指定一个Web Bean名称，Web Bean管理器将其设为默认名称。JSP页面中常常引用动作类，所以它们是这个特性的最好的例子。我们所需做的就是添加一个空的 <literal>@Named</literal> 注释：
zh_tw: 最後，我們能夠指定所有含有特定主要探討模板的 Web Bean 都擁有一組 Web Bean 名稱，並且由 Web Bean 管理員來預設。動作通常參照於 JSP 頁面中，因此它們針對於此功能為完美的 use case。我們只需要新增一個空的 <literal>@Named</literal> 標記即可：

source: Now, <literal>LoginAction</literal> will have the name <literal>loginAction</literal>.
de_de: Jetzt hat <literal>LoginAction</literal> den Namen <literal>loginAction</literal>.
es_es: Ahora, <literal>LoginAction</literal> se llamará<literal>loginAction</literal>.
ja_jp: こうして、 <literal>LoginAction</literal> は、<literal>loginAction</literal> として名前を持つようになります。
ko_kr: 이제 <literal>LoginAction</literal>은 <literal>loginAction</literal>이라는 이름을 갖게 됩니다.
pt_br: Agora, <literal>LoginAction</literal> terá o nome <literal>loginAction</literal>.
zh_cn: 现在， <literal>LoginAction</literal> 将拥有一个名为 <literal>loginAction</literal> Web Bean名称.
zh_tw: 現在，<literal>LoginAction</literal> 將會被命名為 <literal>loginAction</literal>。

source: Standard stereotypes
de_de: Standard-Stereotypen
es_es: Estereotipos estándar
ja_jp: 標準ステレオタイプ
ko_kr: 표준 스테레오타입
pt_br: Estereótipos padrões
zh_cn: 标准的模板
zh_tw: 標準主要探討模板

source: We've already met two standard stereotypes defined by the Web Beans specification: <literal>@Interceptor</literal> and <literal>@Decorator</literal>.
de_de: Wir haben bereits zwei Standard-Stereotypen kennengelernt, die durch die Web Beans Spezifikation definiert werden: <literal>@Interceptor</literal> und <literal>@Decorator</literal>.
es_es: Ya hemos visto dos estereotipos estándar definidos por la especificación de Web Beans: <literal>@Interceptor</literal> y <literal>@Decorator</literal>.
ja_jp: Web Beans 仕様によって定義される <literal>@Interceptor</literal> と <literal>@Decorator</literal> の二つの標準ステレオタイプをすでに経験しました。
ko_kr: Web Beans 사양에 의해 정의된 두가지 표준 스테레오타입 <literal>@Interceptor</literal> 및 <literal>@Decorator</literal>를 살펴보았습니다.
pt_br: Já conhecemos dois estereótipos padrões definidos pela especificação de Web Beans : <literal>@Interceptor</literal> e <literal>@Decorator</literal>.
zh_cn: 我们已经见到了Web Bean规范定义的两个标准的模板：<literal>@Interceptor</literal> 和 <literal>@Decorator</literal>。
zh_tw: 我們已談到了 Web Bean 規格所定義的兩個標準主要探討模板：<literal>@Interceptor</literal> 與 <literal>@Decorator</literal>。

source: Web Beans defines one further standard stereotype:
de_de: Web Beans definiert einen weiteren Standard-Stereotyp:
es_es: Web Beans define otro estereotipo estándar:
ja_jp: Web Beans は、一つの更なる標準的なステレオタイプを定めます。
ko_kr: Web Beans는 하나 이상의 표준 스테레오타입을 정의합니다:
pt_br: Web Beans define mais um estereótipo padrão:
zh_cn: Web Bean还定义了另一个标准模板：
zh_tw: Web Bean 還額外定義了一個標準主要探討模板：

source: This stereotype is intended for use with JSF. Instead of using JSF managed beans, just annotate a Web Bean <literal>@Model</literal>, and use it directly in your JSF page.
de_de: Dieser Stereotyp ist für den Gebrauch mit JSF vorgesehen. Statt JSF gemanagte Beans zu verwenden, annotieren Sie ein Web Bean einfach <literal>@Model</literal>, und verwenden Sie es direkt in Ihrer JSF-Seite.
es_es: Este estereotipo está destinado a ser utilizado con JSF. En lugar de usar beans JSF administrados, solamente anote un Web Bean <literal>@Model</literal>, y utilícelo directamente en su página JSF.
ja_jp: このステレオタイプは、 JSF と一緒に使う事が意図されています。 JSF 管理 beans を使うのではなく、ただ Web Bean に <literal>@Model</literal> アノテーションを付加するだけで、 JSFページで直接それを使えるようになります。
ko_kr: 이러한 스테레오타입은 JSF와 함께 사용하기 위한 것입니다. JSF 관리 beans을 사용하지 않고 Web Bean <literal>@Model</literal>을 어노테이션하여 이를 직접 JSF 페이지에서 사용합니다.
pt_br: Este estereótipo é destinado para uso com o JSF. Em vez de utilizar JSF managed beans, basta anotar um Web Bean com <literal>@Model</literal>, e utilizá-lo diretamente na sua página JSF.
zh_cn: 这个模板是为了JSF使用的。我们可以直接在一个Web Bean上使用 <literal>@Model</literal> 注释就可以让这个Web Bean替代JSF的管理Bean。你可以直接在JSF页面中使用这个Web Bean。
zh_tw: 這個主要探討模板主要用於 JSF。與其使用 JSF 管理的 bean，只要標記一個 <literal>@Model</literal> Web Bean 然後直接在您的 JSF 頁面中使用它即可。
