Repository: 1tchy/core
Catalog: reference/*/xml.po
Languages: es_es, fr_fr, ja_jp, pt_br, zh_cn

source: Defining Web Beans using XML
es_es: Definición de Web Beans utilizando XML
fr_fr: Définir des Web Beans en utilisant XML
ja_jp: XML を使っている Web Beans を定める
pt_br: Definindo Web Beans utilizando XML
zh_cn: 使用XML定义Web Bean

source: So far, we've seen plenty of examples of Web Beans declared using annotations. However, there are a couple of occasions when we can't use annotations to define the Web Bean:
es_es: Hasta ahora hemos visto varios ejemplos de Web Beans declarados mediante anotaciones. No obstante, hay un par de ocasiones en que no podemos utilizar anotaciones para definir el Web Bean.
fr_fr: Jusqu'ici, nous avons vu plein d'exemples de Web Beans déclarés à l'aide d'annotations. Cependant, il y a quelques cas où nous ne pouvons pas utiliser les annotations pour définir un Web Bean:
ja_jp: これまで、アノテーションを使用して宣言される Web Beans の多くの例を見ました。しかし、Web Bean を定義するためにアノテーションを使うことができない場合があります。
pt_br: Até agora, temos visto muitos exemplos de declaração de Web Beans usando anotações. No entanto, há várias situações em que não podemos usar anotações para definir um Web Bean:
zh_cn: 目前为止，我们看了大量使用注释来声明Web Bean的例子。然而，我们有时候并不使用注释来定义Web Bean，如下列情况:

source: when the implementation class comes from some preexisting library, or
es_es: cuando la clase de implementación viene de alguna biblioteca preexistente, o
fr_fr: quand la class d'implémentation provient d'une librairie existante, ou
ja_jp: インプリメンテーションクラスがいくつかの既存のライブラリからなるとき
pt_br: quando a classe de implementação vem de alguma biblioteca preexistente, ou
zh_cn: 当实现类是从先前已经存在的类库中产生的时候，或者

source: when there should be multiple Web Beans with the same implementation class.
es_es: cuando debe haber múltiples Web Beans con la misma clase de implementación.
fr_fr: quand il y aurait plusieurs Web Beans ayant la même classe d'implémentation.
ja_jp: 複数の Web Beans が同じインプリメンテーションクラスでなければならないとき
pt_br: quando deveria haver vários Web Beans com a mesma classe de implementação.
zh_cn: 多个Web Bean对应同一个实现类的时候。

source: In either of these cases, Web Beans gives us two options:
es_es: En estos casos, Web Beans nos ofrece dos opciones:
fr_fr: Dans tous ces cas, les Web Beans nous offrent deux possibilités:
ja_jp: これらのケースのどちらででも、 Web Beans は二つのオプションを与えます。
pt_br: Em qualquer destes casos, We Beans nos dá duas opções:
zh_cn: 在上述任何一种情况下，Web Bean给我们两种选择：

source: write a producer method, or
es_es: escribir un método de productor, o
fr_fr: écrire une méthode productrice, ou
ja_jp: プロデューサメソッドを書きます
pt_br: escrever um método produtor (producer method), ou
zh_cn: 写一个生产者方法，或者

source: declare the Web Bean using XML.
es_es: declarar el Web Bean utilizando XML
fr_fr: déclarer le Web Bean en utilisant XML.
ja_jp: XML を使って Web Bean を宣言します
pt_br: declarar um Web Bean utilizando XML.
zh_cn: 使用XML来声明Web Bean。

source: Many frameworks use XML to provide metadata relating to Java classes. However, Web Beans uses a very different approach to specifying the names of Java classes, fields or methods to most other frameworks. Instead of writing class and member names as the string values of XML elements and attributes, Web Beans lets you use the class or member name as the name of the XML element.
es_es: Muchos marcos utilizan XML para proporcionar metadatos relacionados con clases de Java. Sin embargo, Web Beans usa un método muy diferente para especificar los nombres de clases de Java, campos o métodos para la mayoría de otros marcos. En lugar de escribir nombres de clase y miembro como valores de cadena de elementos XML y atributos, Web Beans le permite utilizar el nombre de clase o miembro como el nombre del elemento XML.
fr_fr: De nombreux frameworks utilisent XML pour fournir des métadonnées relatives aux classes Java. Cependant, les Web Beans utilisent une approche très différente pour spécifier les noms des classes, champs ou méthodes Java aux autres frameworks. Au lieu d'écrire les noms des classes et des membres dans des éléments et attributs XML, les Web Beans vous permettent d'utiliser le nom de class ou de membre comme nom de l'élément XML.
ja_jp: 多くのフレームワークは、 Java クラスに関してメタデータを提供するために、 XML を使います。しかし、 Web Beans は大部分の他のフレームワークに Java クラス、フィールドまたはメソッドの名前を明示する非常に異なるアプローチを使います。 XML 要素と属性の文字列値としてクラスとメンバー名を書く代わりに、 Web Beans はクラスまたはメンバー名を XML 要素の名前として使うことができます。
pt_br: Muitos frameworks usam XML para fornecer metadados relativos às classes Java. No entanto, Web Beans utiliza uma abordagem muito diferente para especificar os nomes de classes Java, atributos ou métodos dos outros frameworks. Em vez de escrever os nomes das classes e dos membros como uma String de valores em elementos e atributos XML, Web Beans permite que você use o nome da classe ou membro como o nome do elemento XML.
zh_cn: 很多框架使用XML来提供Java类相关的元数据。然而，Web Bean使用了和大多其他框架不同的方法来指定Java类的名字，域或者方法。Web Bean让你使用类或者成员名作为XML元素名，而不是将类和成员名作为XML元素的字符串值来声明Web Bean。

source: The advantage of this approach is that you can write an XML schema that prevents spelling errors in your XML document. It's even possible for a tool to generate the XML schema automatically from the compiled Java code. Or, an integrated development environment could perform the same validation without the need for the explicit intermediate generation step.
es_es: La ventaja de este enfoque es que se puede escribir un esquema de XML que evita errores de ortografía en su documento de XML. Es incluso posible que una herramienta genere automáticamente el esquema XML desde el código de Java compilado. O, un entorno de desarrollo integrado podría realizar la misma validación sin la necesidad de una etapa de generación intermedia explícita.
fr_fr: L'avantage de cette méthode est que vous pouvez écrire une schéma XML qui empêche les erreurs de saisies dans votre document XML. Il est même possible de générer le schéma XML automatiquement à partir du code Java compilé, grâce à un outil. Ou, un environnement de développement intégré pourrait effectuer la même validation sans avoir besoin d'une étape de génération explicite.
ja_jp: このアプローチの長所は、 XML 文書でスペルミスを防止する XML スキーマを記述することができるということです。ツールがコンパイルされた Java コードから自動的に XML スキーマを生み出すことさえ可能です。あるいは、統合した開発環境は、明確な中間の生成ステップを行うことなく、同じ妥当性の検証を実行することがありえます。
pt_br: A vantagem desta abordagem é que você pode escrever um esquema XML (XML schema) que evita erros ortográficos no seu documento XML. É até mesmo possível para uma ferramenta gerar o esquema XML (XML schema) automaticamente a partir do código Java compilado. Ou, um ambiente integrado de desenvolvimento poderia fazer a mesma validação sem a necessidade explicíta do passo intermediário de geração.
zh_cn: 这种方法的好处是你可以使用XML模式来验证XML, 阻止XML文档中的拼写错误。它甚至可以让一个工具从编译好的Java代码中自动生成XML模式。或者一个整合开发环境（IDE）可以直接进行验证，无需使用显式的中间生成步骤。

source: Declaring Web Bean classes
es_es: Declaración de clases de Web Bean
fr_fr: Déclarer des classes Web Beans
ja_jp: Web Bean クラスを宣言する
pt_br: Declarando classes Web Beans
zh_cn: 声明Web Bean类

source: For each Java package, Web Beans defines a corresponding XML namespace. The namespace is formed by prepending <literal>urn:java:</literal> to the Java package name. For the package <literal>com.mydomain.myapp</literal>, the XML namespace is <literal>urn:java:com.mydomain.myapp</literal>.
es_es: Para cada paquete de Java, Web Beans define el espacio de nombre de XML correspondiente. El espacio de nombre se forma añadiendo <literal>urn:java:</literal> al nombre de paquete de Java. Para el paquete <literal>com.mydomain.myapp</literal>, el espacio de nombre de XML es <literal>urn:java:com.mydomain.myapp</literal>.
fr_fr: Pour chaque paquetage Java, les Web Beans définissent un espace de nom XML correspondant. L'espace de nom est fabriqué en préfixant le nom du paquetage Java par <literal>urn:java:</literal>. Pour le paquetage <literal>com.mydomain.myapp</literal>, l'espace de nom XML est <literal>urn:java:com.mydomain.myapp</literal>.
ja_jp: Java パッケージごとに、 Web Beans は対応する XML 名前空間を定めます。名前空間は、 Java パッケージ名前に <literal>urn:java:</literal> を前に付加することによって作られます。パッケージ <literal>com.mydomain.myapp</literal> により、 XML 名前空間は、 <literal>urn:java:com.mydomain.myapp</literal> となります。
pt_br: Para cada pacote Java, Web Beans define um namespace XML correspondente. O nome é formado precedendo <literal>urn:java:</literal> ao nome do pacote Java. Para o pacote <literal>com.mydomain.myapp</literal>, o namespace XML é <literal>urn:java:com.mydomain.myapp</literal>.
zh_cn: 对于每个Java包，Web Bean定义了一个对应的XML名域空间。这个名域由 <literal>urn:java:</literal>前缀加上Java包名组成。对于 <literal>com.mydomain.myapp</literal> 包来说，对应的XML名域是 <literal>urn:java:com.mydomain.myapp</literal>。

source: Java types belonging to a package are referred to using an XML element in the namespace corresponding to the package. The name of the element is the name of the Java type. Fields and methods of the type are specified by child elements in the same namespace. If the type is an annotation, members are specified by attributes of the element.
es_es: Los tipos Java pertenecientes a un paquete se conocen por un elemento XML en el espacio de nombre correspondiente al paquete. El nombre del elemento es el nombre del tipo de Java y los métodos del tipo están especificados por elementos secundarios en el mismo espacio de nombre. Si el tipo es una anotación, los miembros son especificados por atributos del elemento.
fr_fr: Les types Java appartenant à un paquetage sont référencés dans un élément XML du namespace correspondant au paquetage. Le nom de l'élément est le nom du type Java. Les champs et méthodes du type sont spécifiés par des éléments enfants dans le même espace de noms. Si le type est une annotation, les membres sont spécifiés par des attributs de l'élément.
ja_jp: パッケージに属している Java 型は、パッケージと一致している名前空間で XML 要素を使用することにゆだねられます。要素の名前は、 Java 型の名前です。型のフィールドとメソッドは、同じ名前空間で子要素で明示されます。型がアノテーションであるならば、メンバーは要素の特質によって明示されます。
pt_br: Tipos Java pertencentes a um pacote são referenciados à utilizar um elemento XML no namespace correspondente ao pacote. O nome do elemento é o nome do tipo Java. Atributos e métodos do tipo são especificados por elementos filhos do mesmo namespace. Se o tipo é uma anotação, os membros são definidos por atributos do elemento.
zh_cn: 属于一个包的Java类型指的是在对应这个包的名域中使用一个XML元素。元素的名字就是Java类型的名字。类型的域和方法通过相同的名域下的子元素定义。如果类型是一个注释的话，其成员通过这个元素的属性指定。

source: For example, the element <literal>&lt;util:Date/&gt;</literal> in the following XML fragment refers to the class <literal>java.util.Date</literal>:
es_es: Por ejemplo, el elemento <literal>&lt;util:Date/&gt;</literal> en el siguiente fragmento XML se refiere a la clase <literal>java.util.Date</literal>:
fr_fr: Par exemple, l'élément <literal>&lt;util:Date/&gt;</literal> dans le fragment XML suivant référencela class <literal>java.util.Date</literal>:
ja_jp: たとえば、以下の XML 断片の要素 <literal>&lt;util:Date/&gt;</literal> は、クラス <literal>java.util.Date</literal> を参照します。
pt_br: Por exemplo, o elemento <literal>&lt;util:Date/&gt;</literal> no seguinte fragmento XML refere-se a classe <literal>java.util.Date</literal>:
zh_cn: 例如， 在下面的XML片段中的元素<literal>&lt;util:Date/&gt;</literal>指的是 <literal>java.util.Date</literal> 类：

source: And this is all the code we need to declare that <literal>Date</literal> is a simple Web Bean! An instance of <literal>Date</literal> may now be injected by any other Web Bean:
es_es: ¡Y este es todo el código que necesitamos para declarar que <literal>Date</literal> es un Web Bean sencillo! Una instancia de <literal>Date</literal> puede ahora ser inyectada por cualquier otro Web Bean:
fr_fr: Et ceci est tout le code dont nous avons besoin pour déclarer que <literal>Date</literal> est un simple Web Bean! Un instance de <literal>Date</literal> peut maintenant être injectée par n'importe quel autre Web Bean:
ja_jp: そして、これは <literal>Date</literal> をシンプル Web Bean として宣言するためのすべてのコードです。<literal>Date</literal> のインスタンスは、現在他のどの Web Bean にも導入されることがありえます。
pt_br: E esse é todo o código necessário para declarar que <literal>Date</literal> é um simples Web Bean! Uma instancia de <literal>Date</literal> pode agora ser injetada por qualquer outro Web Bean:
zh_cn: 这个是将<literal>Date</literal> 声明为一个简单web Bean所需的所有代码！现在任何一个 <literal>Date</literal> 实例都可以被任何其他Web Bean注入了：

source: Declaring Web Bean metadata
es_es: Declaración de metadatos de Web Bean
fr_fr: Déclarer les métadonnées d'un Web Bean
ja_jp: Web Bean メタデータを宣言する
pt_br: Declarando metadados Web Bean
zh_cn: 声明Web Bean的元数据

source: We can declare the scope, deployment type and interceptor binding types using direct child elements of the Web Bean declaration:
es_es: Podemos declarar el ámbito, el tipo de despliegue y los tipos de enlace de interceptor mediante elementos directos secundarios de la declaración del Web Bean:
fr_fr: Nous pouvons déclarer la portée, le type de déploiement et les types de liaison d'intercepteurs en utilisant les éléments enfants directs de la déclaration du Web Bean:
ja_jp: バインディングタイプが Web Bean 宣言の直接の子要素を使用して型を検査するスコープ、デプロイメントタイプとインタセプターを宣言することができます。
pt_br: Nós podemos declarar o escopo, tipo de puplicação (deployment type) e tipo de ligação de interceptador (interceptor binding types) com a utilização direta de elementos filhos na declaração do Web Bean:
zh_cn: 我们可以直接通过Web Bean声明的子元素来声明范围，部署类型和拦截器绑定类型：

source: We use exactly the same approach to specify names and binding type:
es_es: Utilizamos exactamente el mismo método para especificar nombres y tipo de enlace:
fr_fr: Nous utilisons exactement la même approche pour spécifier les noms et les types de liaison:
ja_jp: 名前とバインディングタイプを明示するために、正確に同じアプローチを使います。
pt_br: Nós utilizamos exatamente a mesma abordagem para especificar nomes e tipos de ligação:
zh_cn: 我们可以使用相同方法来指定名字和绑定类型：

source: Where <literal>@Login</literal> and <literal>@SystemStart</literal> are binding annotations types.
es_es: Donde <literal>@Login</literal> y <literal>@SystemStart</literal> son tipos de anotaciones de enlace.
fr_fr: Où <literal>@Login</literal> et <literal>@SystemStart</literal> sont des types d'annotations de liaison.
ja_jp: <literal>@Login</literal> と <literal>@SystemStart</literal> アノテーションタイプを結びつけているところ。
pt_br: Onde <literal>@Login</literal> e <literal>@SystemStart</literal> são anotações do tipo ligação.
zh_cn: <literal>@Login</literal> 和 <literal>@SystemStart</literal> 是绑定注释类型。

source: As usual, a Web Bean may support multiple binding types:
es_es: Como es usual, un Web Bean puede soportar múltiples tipos de enlace:
fr_fr: Comme d'habitude, un Web Bean supporte plusieurs types de liaison:
ja_jp: 通常通り、 Web Bean は複数のバインディングタイプをサポートすることがありえます。
pt_br: Como é habitual, um Web Bean pode suportar múltiplos tipos de ligação (binding types):
zh_cn: 通常，一个Web Bean可以支持多个绑定类型：

source: Interceptors and decorators are just simple Web Beans, so they may be declared just like any other simple Web Bean:
es_es: Los interceptores y decoradores son sólo Web Beans sencillos, por consiguiente, pueden ser declarados como cualquier otro Web Bean sencillo:
fr_fr: Les intercepteurs et les décorateurs sont juste de Web Beans simples, donc ils peuvent être déclarés comme n'importe quel Web Bean simple:
ja_jp: インタセプタとデコレータは単なるシンプル Web Beans であるので、それらはまるで他のシンプル Web Bean のように宣言されることがありえます。
pt_br: Interceptadores e Decoradores são simplesmente Web Beans, sendo assim, podem ser declarados como qualquer outro Web Bean:
zh_cn: 拦截器和装饰器只不过是简单的Web Beans，所以它们可以像其他简单Web Bean一样被声明：

source: Declaring Web Bean members
es_es: Declaración de miembros de Web Bean
fr_fr: Déclarer des membres de Web Beans
ja_jp: Web Bean メンバーを宣言する
pt_br: Declarando membros Web Bean
zh_cn: 声明Web Bean成员

source: TODO!
ja_jp: やるべきこと。

source: Declaring inline Web Beans
es_es: Declaración de Web Beans en línea
fr_fr: Déclarer des Web Beans à la volée
ja_jp: インライン Web Beans を宣言する
pt_br: Declarando inline Web Beans
zh_cn: 声明内联的Web Beans

source: Web Beans lets us define a Web Bean at an injection point. For example:
es_es: Web Beans nos permite definir un Web Bean en el punto de inyección. Por ejemplo:
fr_fr: Les Web Beans nous permettent de définir un Web Bean à un point d'injection. Par exemple:
ja_jp: Web Beans は、依存性注入ポイントで Web Bean を定義できます。例を以下に示します。
pt_br: Web Beans nos permite definir um Web Bean em um ponto de injeção. Por exemplo:
zh_cn: Web Beans让我们能够在一个注入点定义一个Web Bean。例如：

source: The <literal>&lt;Name&gt;</literal> element declares a simple Web Bean of scope <literal>@Dependent</literal> and class <literal>Name</literal>, with a set of initial field values. This Web Bean has a special, container-generated binding and is therefore injectable only to the specific injection point at which it is declared.
es_es: El elemento <literal>&lt;Name&gt;</literal> declara un Web Bean sencillo de ámbito <literal>@Dependent</literal> y clase <literal>Name</literal>, con una serie de valores de campo iniciales. Este Web Bean tiene un enlace de contenedor-generado y es, por lo tanto, inyectable únicamente en el punto de inyección en el cual es declarado.
fr_fr: L'élément <literal>&lt;Name&gt;</literal> déclare un Web Bean simple de portée <literal>@Dependant</literal> et la classe <literal>Name</literal>, avec un ensembl de valeurs initials sur ses champs. Ce Web Bean a une liaison spéciale générée par le conteneur, et est par conséquent injectable seulement au point d'injection spécifique où il a été déclaré.
ja_jp: 一組の最初のフィールド値で、 <literal>&lt;Name&gt;</literal> エレメントはスコープ <literal>@Dependent</literal> とクラス <literal>Name</literal> の単純な Web Bean を宣言します。
pt_br: O elemento <literal>&lt;Name&gt;</literal> declara um Web Bean simples de escopo <literal>@Dependent</literal> e classe <literal>Name</literal>, com um conjunto inicial de valores para os campos. Esse Web Bean possui a especial, container-generated binding and is therefore injectable only to the specific injection point at which it is declared.
zh_cn: <literal>&lt;Name&gt;</literal> 元素声明了一个范围为 <literal>@Dependent</literal> ，类为 <literal>Name</literal> 的一个简单的Web Bean，并且设置了一套初始的域值。这个Web Bean有一个特殊的，容器生成的绑定，因此只能在它声明的特定注入点被注入。

source: This simple but powerful feature allows the Web Beans XML format to be used to specify whole graphs of Java objects. It's not quite a full databinding solution, but it's close!
es_es: Esta función simple pero poderosa permite que el formato XML de Web Beans pueda utilizarse para especificar gráficos completos de objetos Java. No es del todo una solución para enlazar datos, pero ¡está cerca!
fr_fr: Cette fonctionnalité simple, mais puissante permet au format XML des Web Beans d'être utilisé pour spécifier des graphes entiers d'objets Java. Ce n'est pas une solution intégrale pour la liaison de données, mais cela s'en approche!
ja_jp: この単純であるが、強力な機能によって、 Java オブジェクトの全部のグラフを明示するのにWeb Beans XML フォーマットを用いることができます。それは完全なデータバインディングの解決案とは言えませんが、それにほとんど近いものです。
pt_br: Este simples mas poderoso recurso permite que o formato XML do Web Beans seja utilizado para especificar gráfos completos de objetos Java. Não é uma solução de ligação de dados (databinding) completa, mas está bem próxima!
zh_cn: 这个简单但是很强大的特性能够让我们使用Web Bean XML配置格式来指定整个Java类的图。这并不是完整的数据绑定方案，但是它很接近了！

source: Using a schema
es_es: Uso de un esquema
fr_fr: Utiliser un schéma
ja_jp: スキーマを使用する
pt_br: Utilizando um esquema
zh_cn: 使用一个模式

source: If we want our XML document format to be authored by people who aren't Java developers, or who don't have access to our code, we need to provide a schema. There's nothing specific to Web Beans about writing or using the schema.
es_es: Si deseamos que nuestro formato de documento XML sea creado por personas que no son desarrolladores de Java, o que no tienen acceso a nuestro código, necesitamos proporcionar un esquema. No hay nada específico de Web Beans sobre escribir o utilizar el esquema.
fr_fr: Si nous voulons que le format de notre document XML soit écrit par des gens qui ne sont pas des développeurs Java, ou qui n'ont pas accès à notre code, nous devons fournir un schéma. Ecrire ou utiliser le schéma n'a rien de spécifique aux Web Beans.
ja_jp: XML 文書フォーマットに Java 開発者でない、または、コードにアクセスしない人々によって記述して欲しいならば、スキーマを提供する必要があります。 Web Beans に特有のスキーマを記述するか、記述する必要はありません。
pt_br: Se desejamos que o formato do documento XML seja criado por pessoas que não são desenvolvedores Java, ou por pessoas que não têm acesso ao nosso código, precisamos fornecer um esquema (XML schema). Não há nada específico no Web Beans sobre escrever ou utilizar o esquema.
zh_cn: 如果我们希望我们的XML文档格式由非Java开发者或者没有权限访问我们代码的人来制定，我们需要提供一个模式。在Web Beans中使用模式没有什么特殊的地方。

source: Writing an XML schema is quite tedious. Therefore, the Web Beans RI project will provide a tool which automatically generates the XML schema from compiled Java code.
es_es: La escritura de un esquema XML es bastante tediosa. Por lo tanto, el proyecto de la IR de Web Beans proporcionará una herramienta que genere automáticamente el esquema de XML desde el código de Java compilado.
fr_fr: Ecrire un schéma XML est assez ennuyeux. C'est pour cela que le projet Web Beans RI fournira un outil qui génèrera automatiquement le schéma XML à partir du code Java compilé.
ja_jp: XML スキーマを記述することは、全く退屈です。したがって、 Web Beans RI プロジェクトは、コンパイルされた Java コードから自動的に XML スキーマを生み出すツールを提供します。
pt_br: Escrever um esquema XML (XML schema) é um tanto tedioso. Toda via, o projeto Web Beans RI irá fornecer uma ferramenta que automaticamente gera o esquema XML (XML schema) a partir do código da classe Java compilada.
zh_cn: 编写一个XML模式相当繁琐。因此，Web Bean的参考实现项目提供了一个工具，可以从编译好的Java代码中自动化生成XML模式。
